MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_lptim.c
/**
  **********************************************************************************************************************
  * @file    stm32c5xx_hal_lptim.c
  * @brief   LPTIM HAL module driver.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32_hal.h"

/** @addtogroup STM32C5xx_HAL_Driver
  *  @{
  */
#if defined (LPTIM1)
#if defined(USE_HAL_LPTIM_MODULE) && (USE_HAL_LPTIM_MODULE == 1)

/** @addtogroup LPTIM
  *  @{
  */
/** @defgroup LPTIM_Introduction LPTIM Introduction
  * @{
  - The LPTIM hardware abstraction layer (HAL) provides a set of APIs to interface with STM32 low-power timers.

  - STM32 low-power timers (LPTIM) provide ultra-low-power time base generation, periodic events, pulse counting,
    and low-frequency PWM while the device operates in low-power modes. They enable energy-efficient wake-up scheduling,
    low-speed signal measurement, and autonomous timing functions in battery-powered and power-constrained embedded
    systems.

  - The LPTIM HAL driver simplifies the configuration, initialization, and management of low-power timer operations by
    supporting polling, interrupt, and, where available, DMA modes, enabling flexible and efficient low-power timing
    control.

  - Additionally, it supports multiple LPTIM instances and features such as encoder mode, one-pulse mode, and external
    clocking, depending on the STM32 device, ensuring portability and consistency of low-power timing capabilities
    across different STM32 series.
  */
/**
  * @}
  */

/** @defgroup LPTIM_How_To_Use LPTIM How To Use
  * @{

  Use the LPTIM HAL driver as follows:
  ===============

  # (Non-optional call) Call HAL_LPTIM_Init() to initialize the LPTIM driver by establishing a link with
    the LPTIM physical instance.

  # (Non-optional call) Call HAL_LPTIM_SetConfig() to configure the timebase unit:
      <ul>
        <li> Select the clock source @ref hal_lptim_clk_src_t:
        <ul>
          <li> @ref HAL_LPTIM_CLK_INTERNAL : \n
            LPTIM is clocked by an internal clock source.
            The counter is incremented following each internal clock pulse.
          <li> @ref HAL_LPTIM_CLK_EXTERNAL_SYNCHRONOUS : \n
            The LPTIM counter clock signal is generated from the external Input1 signal. \n
            The LPTIM external Input1 is sampled with the internal clock provided to the LPTIM. \n
            Configure LPTIM Input1 with @ref HAL_LPTIM_SetConfigInput1(). \n
          <li> @ref HAL_LPTIM_CLK_EXTERNAL_ASYNCHRONOUS : \n
            The LPTIM counter clock signal is generated from the external Input1 signal. \n
            Configure the LPTIM external Input1 by calling HAL_LPTIM_SetConfigInput1(). \n
          <li> @ref HAL_LPTIM_CLK_ENCODER_SUBMODE_1 to @ref HAL_LPTIM_CLK_ENCODER_SUBMODE_3 : \n
            The LPTIM counter clock signal is generated from the two external input signals, Input1 and Input2.
        </ul>
        <li> Select the <b>prescaler</b> division factor @ref hal_lptim_clk_src_presc_t
        <li> Set <b>period</b> value: number from 0 to 65535 (0x0000 to 0xFFFF)
        <li> Set <b>repetition counter</b> value: number from 0 to 255 (0x00 to 0xFF)
        <li> Select the functioning mode with @ref hal_lptim_mode_t:
        <ul>
          <li> @ref HAL_LPTIM_ONE_SHOT :
                When the LPTIM counter is stopped, a trigger event starts it.
                The counter is stopped on an update event.
          <li> @ref HAL_LPTIM_SET_ONCE :
                A first trigger event starts the LPTIM counter for a single one-shot cycle.
          <li> @ref HAL_LPTIM_CONTINUOUS :
                The LPTIM counter starts from a trigger event and never stops until the timer is disabled.
          <li> @ref HAL_LPTIM_TIMEOUT :
                The detection of an active edge on one selected trigger input can be used to reset the LPTIM counter.
        </ul>
      </ul>

  # If needed, call HAL_LPTIM_DeInit() to reset the driver.

  # When an external clock is used, configure LPTIM Input1 by calling HAL_LPTIM_SetConfigInput1().
    <ul>
      <li> Select the Input1 source with @ref hal_lptim_input1_src_t
      <li> Select the Input1 polarity with @ref hal_lptim_input1_polarity_t
      <li> Select the Input1 filter with @ref hal_lptim_filter_t
    </ul>

# Select the usage:
  - To use an LPTIM instance as a simple counter:
  --------------------------------------------
    - Configure the LPTIM time base unit. The functioning mode must be set to @ref HAL_LPTIM_CONTINUOUS
      when calling HAL_LPTIM_SetConfig().
    - Start the LPTIM counter. Two execution modes are available:
      - Polling: HAL_LPTIM_Start()
      - Interrupt: HAL_LPTIM_Start_IT(), in this case, the update interrupt is enabled
    - Stop the LPTIM counter. Call HAL_LPTIM_Stop() and HAL_LPTIM_Stop_IT(), as per the selected execution mode.
    @note If needed, some configuration parameters can be changed on the fly (e.g., period @ref HAL_LPTIM_SetPeriod()).

  - To generate a PWM signal:
  --------------------------------------------
  - Configure the LPTIM time base unit. The functioning mode must be set to @ref HAL_LPTIM_CONTINUOUS
    when calling HAL_LPTIM_SetConfig().
  - Configure the output channel(s) by calling HAL_LPTIM_OC_SetConfigChannel().
  - To start PWM signal generation, first start the output channel, then the LPTIM time base unit
    by calling HAL_LPTIM_Start().
  Three execution modes are available:
    - Polling: HAL_LPTIM_OC_StartChannel()
    - Interrupt: HAL_LPTIM_OC_StartChannel_IT(), in this case, the compare match interrupt is enabled
  - Stop PWM signal generation. Call HAL_LPTIM_OC_StopChannel() or HAL_LPTIM_OC_StopChannel_IT(),
    as per the selected execution mode.
  @note If needed, some configuration parameters can be changed on the fly
    (e.g., PWM duty cycle @ref HAL_LPTIM_OC_SetChannelPulse()).

  - To generate a one-pulse signal:
  --------------------------------------------
  - Configure the LPTIM time base unit. The functioning mode must be set to @ref HAL_LPTIM_ONE_SHOT
    when calling HAL_LPTIM_SetConfig().
  - Configure the output channel(s) by calling HAL_LPTIM_OC_SetConfigChannel().
  - If the pulse generation is triggered when an active edge is detected on the external trigger input,
    configure the external trigger input by calling HAL_LPTIM_SetConfigExtTrigInput().
  - To start pulse generation, first start the output channel(s), then the LPTIM time base unit
    by calling HAL_LPTIM_Start().
  Three execution modes are available:
    - Polling: HAL_LPTIM_OC_StartChannel()
    - Interrupt: HAL_LPTIM_OC_StartChannel_IT(), in this case, the compare match interrupt is enabled
  - Stop signal generation. Call HAL_LPTIM_OC_StopChannel() or HAL_LPTIM_OC_StopChannel_IT(),
     as per the selected execution mode.
  @note In case of software start (external trigger not configured),
    call HAL_LPTIM_Start() to start the LPTIM counter for one-shot counting. \n
    In one-pulse mode, the output waveform is similar to the PWM mode for the first pulse.
      Then the output is permanently reset.

  - To generate a set once signal:
  --------------------------------------------
  - Configure the LPTIM time base unit. The functioning mode must be set to @ref HAL_LPTIM_SET_ONCE
    when calling HAL_LPTIM_SetConfig().
  - If the signal generation is triggered when an active edge is detected on the external trigger input,
      configure the external trigger input by calling HAL_LPTIM_SetConfigExtTrigInput().
  - Configure the output channel(s) by calling HAL_LPTIM_OC_SetConfigChannel().
  - To start signal generation, first start the channel(s), then the LPTIM time base unit by calling HAL_LPTIM_Start().
  Two execution modes are available:
    - Polling: HAL_LPTIM_OC_StartChannel()
    - Interrupt: HAL_LPTIM_OC_StartChannel_IT(), in this case, the compare match interrupt is enabled
  - Stop signal generation. Call HAL_LPTIM_OC_StopChannel() or HAL_LPTIM_OC_StopChannel_IT(),
    as per the selected execution mode.
    @note If needed, some configuration parameters can be changed on the fly
      (e.g., PWM duty cycle @ref HAL_LPTIM_OC_SetChannelPulse()).

  - To capture an input signal:
  --------------------------------------------
  - Configure the LPTIM time base unit. The functioning mode must be set to @ref HAL_LPTIM_CONTINUOUS
    when calling HAL_LPTIM_SetConfig().
  - Configure the input channel(s) by calling HAL_LPTIM_IC_SetConfigChannel().
  - To start a capture, first start the input channel, then the LPTIM time base unit (HAL_LPTIM_Start()).
  Three execution modes are available:
    - Polling: HAL_LPTIM_IC_StartChannel()
    - Interrupt: HAL_LPTIM_IC_StartChannel_IT(), in this case, the capture interrupt is enabled
    - DMA: HAL_LPTIM_IC_StartChannel_DMA(), in this case, the capture DMA request is enabled
  - Stop input signal capture. Call HAL_LPTIM_IC_StopChannel() or HAL_LPTIM_IC_StopChannel_IT()
    or HAL_LPTIM_IC_StopChannel_DMA(), as per the selected execution mode.

