MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_lptim.c
  - To use the LPTIM timeout feature:
  --------------------------------------------
  - Configure the LPTIM time base unit. The functioning mode must be set to @ref HAL_LPTIM_TIMEOUT
    when calling HAL_LPTIM_SetConfig().
  - Configure the external trigger input by calling HAL_LPTIM_SetConfigExtTrigInput().
  - Configure the timeout value by calling HAL_LPTIM_OC_SetPulse().
  Two execution modes are available:
    - Polling: HAL_LPTIM_Start()
    - Interrupt: HAL_LPTIM_Start_IT(), in this case, the update event is enabled
  - To stop pulse generation, call HAL_LPTIM_Stop() and HAL_LPTIM_Stop_IT(),
    as per the selected execution mode.
    @note If needed, some configuration parameters can be changed on the fly
      (e.g., PWM duty cycle @ref HAL_LPTIM_OC_SetChannelPulse()).

  - To use the LPTIM encoder interface:
  --------------------------------------------
  - Configure the LPTIM time base unit. The functioning mode must be set to @ref HAL_LPTIM_CONTINUOUS \n
  and encoder mode must be selected as the LPTIM clock source when calling HAL_LPTIM_SetConfig().
  - Configure the encoder interface (LPTIM Input1 and Input2) by calling HAL_LPTIM_SetConfigEncoder().
  Two execution modes are available:
    - Polling: HAL_LPTIM_Start()
    - Interrupt: HAL_LPTIM_Start_IT(), in this case, the update event is enabled
  - To stop the encoder interface, call HAL_LPTIM_Stop() and HAL_LPTIM_Stop_IT(), as per the selected execution mode.
    @note If needed, some configuration parameters can be changed on the fly (e.g., period @ref HAL_LPTIM_SetPeriod()).

  # Callbacks definition in interrupt or DMA mode
      - When the compilation define <b>USE_HAL_LPTIM_REGISTER_CALLBACKS</b> is set to 1,
      the user can configure the driver callbacks dynamically using their own method:

  Callback name                | Default callback                       | Register callback
  -----------------------------|----------------------------------------|----------------------------------------
  ErrorCallback                |  HAL_LPTIM_ErrorCallback               | HAL_LPTIM_RegisterErrorCallback
  StopCallback                 |  HAL_LPTIM_StopCallback                | HAL_LPTIM_RegisterStopCallback
  InputCaptureStopCallback     |  HAL_LPTIM_InputCaptureStopCallback    | HAL_LPTIM_RegisterChannelStopCallback
  UpdateCallback               |  HAL_LPTIM_UpdateCallback              | HAL_LPTIM_RegisterUpdateCallback
  UpdateHalfCpltCallback       |  HAL_LPTIM_UpdateHalfCpltCallback      | HAL_LPTIM_RegisterUpdateHalfCpltCallback
  RepUpdateCallback            |  HAL_LPTIM_RepUpdateCallback           | HAL_LPTIM_RegisterRepUpdateCallback
  TriggerCallback              |  HAL_LPTIM_TriggerCallback             | HAL_LPTIM_RegisterTriggerCallback
  InputCaptureCallback         |  HAL_LPTIM_InputCaptureCallback        | HAL_LPTIM_RegisterInputCaptureCallback
  InputCaptureHalfCpltCallback | HAL_LPTIM_InputCaptureHalfCpltCallback | HAL_LPTIM_RegisterInputCaptureHalfCpltCallback
  InputOverCaptureCallback     |  HAL_LPTIM_InputOverCaptureCallback    | HAL_LPTIM_RegisterOverCaptureCallback
  CompareMatchCallback         |  HAL_LPTIM_CompareMatchCallback        | HAL_LPTIM_RegisterCompareMatchCallback
  CompareUpdateCallback        |  HAL_LPTIM_CompareUpdateCallback       | HAL_LPTIM_RegisterCompareUpdateCallback
  AutoReloadMatchCallback      |  HAL_LPTIM_AutoReloadMatchCallback     | HAL_LPTIM_RegisterAutoReloadMatchCallback
  AutoReloadUpdateCallback     |  HAL_LPTIM_AutoReloadUpdateCallback    | HAL_LPTIM_RegisterAutoReloadUpdateCallback
  DirectionDownCallback        |  HAL_LPTIM_DirectionDownCallback       | HAL_LPTIM_RegisterDirectionDownCallback
  DirectionUpCallback          |  HAL_LPTIM_DirectionUpCallback         | HAL_LPTIM_RegisterDirectionUpCallback

  To unregister a callback, register the default callback via the registration function.

  By default, after HAL_LPTIM_Init() and when the state is @ref HAL_LPTIM_STATE_INIT, all callbacks are set to the
  corresponding default weak functions.

  Callbacks can be registered in the handle global state @ref HAL_LPTIM_STATE_INIT and @ref HAL_LPTIM_STATE_IDLE.

  When the compilation define <b>USE_HAL_LPTIM_REGISTER_CALLBACKS</b> is set to 0 or is not defined,
  the callback registration feature is not available and weak callbacks are used, represented by the default value in
  the table above.
  */
/**
  * @}
  */

/** @defgroup LPTIM_Configuration_Table LPTIM Configuration Table
  * @{
  ## Configuration inside the HAL LPTIM driver:

  Config defines                   | Where        | Default value     | Note
  -------------------------------  | -------------| ------------------| -------------------------------------------
  USE_HAL_LPTIM_MODULE             | hal_conf.h   |         1         | Enable the HAL LPTIM module
  USE_HAL_LPTIM_REGISTER_CALLBACKS | hal_conf.h   |         0         | Allow the user to define custom callbacks
  USE_HAL_LPTIM_CLK_ENABLE_MODEL   | hal_conf.h   | HAL_CLK_ENABLE_NO | Enable the gating of the peripheral clock
  USE_HAL_LPTIM_USER_DATA          | hal_conf.h   |         0         | Add user data inside the HAL LPTIM handle
  USE_HAL_LPTIM_GET_LAST_ERRORS    | hal_conf.h   |         0         | Enable retrieval of the last process error codes
  USE_HAL_LPTIM_DMA                | hal_conf.h   |         1         | Enable DMA support inside HAL LPTIM
  USE_HAL_CHECK_PARAM              | hal_conf.h   |         0         | Enable checking of vital parameters at runtime
  USE_HAL_MUTEX                    | hal_conf.h   |         0         | Enable semaphore usage in the HAL driver
  USE_HAL_CHECK_PROCESS_STATE      | hal_conf.h   |         0         | Enable atomic access to process state checks
  USE_ASSERT_DBG_PARAM             | PreProc env  |        NONE       | Enable parameter checks for HAL
  USE_ASSERT_DBG_STATE             | PreProc env  |        NONE       | Enable state checks for HAL

  **********************************************************************************************************************

  */
/**
  * @}
  */

/** @defgroup LPTIM_Private_Types LPTIM Private Types
  *  @{
  */

/**
  * @brief Alias for the CMSIS instance type definition.
  */
typedef LPTIM_TypeDef lptim_t;

/**
  *  @}
  */

/** @defgroup LPTIM_Private_Constants  LPTIM Private Constants
  *  @{
  */
/**
  * @brief Timeout
  */
#define LPTIM_TIMEOUT 1000UL /* 1s timeout */

/**
  * @brief Internal mapping helper used to translate HAL enumerations into
  *        low-level (LL) register selector values for external trigger and
  *        input capture sources.
  */
typedef struct
{
  /** LL selector value */
  uint32_t ll_value;

