MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_lptim.c
  /** HAL LPTIM instance this entry applies to. */
  hal_lptim_t instance;
  union
  {
    /** HAL external trigger source associated to ll_value. */
    hal_lptim_ext_trig_src_t  exttrig_src;

    /** HAL input capture channel source associated to ll_value. */
    hal_lptim_ic_src_t        channel_src;
  };
} lptim_mapping_t;

/**
  * @brief Mapping table translating HAL external trigger sources to LL TRIGSEL selector values.
  */
static const lptim_mapping_t extrig_mapping[] =
{
  {LL_LPTIM_TRIG_SOURCE_GPIO,          HAL_LPTIM1, {.exttrig_src = HAL_LPTIM_EXT_TRIG_GPIO}},
  {LL_LPTIM_TRIG_SOURCE_RTC_ALRA_TRG,  HAL_LPTIM1, {.exttrig_src = HAL_LPTIM_EXT_TRIG_RTC_ALRA_TRG}},
  {LL_LPTIM_TRIG_SOURCE_RTC_ALRB_TRG,  HAL_LPTIM1, {.exttrig_src = HAL_LPTIM_EXT_TRIG_RTC_ALRB_TRG}},
  {LL_LPTIM_TRIG_SOURCE_TAMP_TRG1,     HAL_LPTIM1, {.exttrig_src = HAL_LPTIM_EXT_TRIG_TAMP_TRG1}},
  {LL_LPTIM_TRIG_SOURCE_TAMP_TRG2,     HAL_LPTIM1, {.exttrig_src = HAL_LPTIM_EXT_TRIG_TAMP_TRG2}},
  {LL_LPTIM_TRIG_SOURCE_LPDMA_CH1_TC,  HAL_LPTIM1, {.exttrig_src = HAL_LPTIM_EXT_TRIG_LPDMA_CH1_TC}},
  {LL_LPTIM_TRIG_SOURCE_COMP1_OUT,     HAL_LPTIM1, {.exttrig_src = HAL_LPTIM_EXT_TRIG_COMP1_OUT}},
  {LL_LPTIM_TRIG_SOURCE_EVENTOUT,      HAL_LPTIM1, {.exttrig_src = HAL_LPTIM_EXT_TRIG_EVENTOUT}},

  /* End of map */
  {.ll_value = 0xFFFFFFFFU}
};


/**
  * @brief IC1 mapping: LPTIMx input capture 1 connections.
  */
static const lptim_mapping_t ic1_mapping[] =
{
  {LL_LPTIM_LPTIM1_IC1_RMP_GPIO,         HAL_LPTIM1, {.channel_src = HAL_LPTIM_INPUT_GPIO}},
  {LL_LPTIM_LPTIM1_IC1_RMP_COMP1_OUT,    HAL_LPTIM1, {.channel_src = HAL_LPTIM_INPUT_COMP1_OUT}},
  {LL_LPTIM_LPTIM1_IC1_RMP_EVENTOUT,     HAL_LPTIM1, {.channel_src = HAL_LPTIM_INPUT_EVENTOUT}},
  {LL_LPTIM_LPTIM1_IC1_RMP_MCO1,         HAL_LPTIM1, {.channel_src = HAL_LPTIM_INPUT_MCO1}},

  /* End of map */
  {.ll_value = 0xFFFFFFFFU}
};

/**
  * @brief IC2 mapping: LPTIMx input capture 2 connections.
  */
static const lptim_mapping_t ic2_mapping[] =
{
  {LL_LPTIM_LPTIM1_IC2_RMP_GPIO,         HAL_LPTIM1, {.channel_src = HAL_LPTIM_INPUT_GPIO}},
  {LL_LPTIM_LPTIM1_IC2_RMP_LSI,          HAL_LPTIM1, {.channel_src = HAL_LPTIM_INPUT_LSI}},
  {LL_LPTIM_LPTIM1_IC2_RMP_LSE,          HAL_LPTIM1, {.channel_src = HAL_LPTIM_INPUT_LSE}},
  {LL_LPTIM_LPTIM1_IC2_RMP_RCC_HSE_1MHZ, HAL_LPTIM1, {.channel_src = HAL_LPTIM_INPUT_RCC_HSE_1MHZ}},

  /* End of map */
  {.ll_value = 0xFFFFFFFFU}
};


/**
  * @brief Helper structure grouping compare-match and capture IT mask for one channel.
  */
typedef struct
{
  /** DIER bit enabling compare register OK interrupt for the channel. */
  uint32_t cmp;

  /** DIER bit enabling capture/compare interrupt for the channel. */
  uint32_t cc;
} lptim_channel_it_t;

/**
  * @brief Per-channel interrupt bit mapping for compare-match and capture events.
  */

static const lptim_channel_it_t channel_it[] =
{
  {LL_LPTIM_DIER_CMP1OKIE, LPTIM_DIER_CC1IE},
  {LL_LPTIM_DIER_CMP2OKIE, LPTIM_DIER_CC2IE},
};

/**
  * @brief Define the channel idle state, whether it is an OC or an IC channel.
  */
#define LPTIM_CHANNEL_STATE_IDLE \
  (HAL_LPTIM_OC_CHANNEL_STATE_IDLE | HAL_LPTIM_IC_CHANNEL_STATE_IDLE)

/**
  * @brief Mask for the polarity bits of the clock.
  */
#define LPTIM_CLOCK_POLARITY_MASK \
  (LL_LPTIM_CLK_POLARITY_FALLING | LL_LPTIM_CLK_POLARITY_RISING_FALLING)

/**
  * @brief Mask for the source bits in CFGR of the external trigger.
  */
#define LPTIM_ETR_SRC_MASK LPTIM_CFGR_TRIGSEL_Msk

/**
  * @brief Mask for the polarity bits in CFGR of the external trigger.
  */
#define LPTIM_ETR_POLARITY_MASK LL_LPTIM_TRIG_POLARITY_RISING_FALLING

/**
  * @brief Mask for all interrupt bits in DIER.
  */
#define LPTIM_DIER_INTERRUPTS_MASK (LL_LPTIM_DIER_ARROKIE | LL_LPTIM_DIER_ARRMIE | \
                                    LL_LPTIM_DIER_REPOKIE | LL_LPTIM_DIER_UEIE | \
                                    LL_LPTIM_DIER_UPIE | LL_LPTIM_DIER_DOWNIE | \
                                    LL_LPTIM_DIER_CC1IE | LPTIM_DIER_CC2IE)

/**
  * @brief Mask for the filter bits of the input trigger.
  */
#define LPTIM_ETR_FILTER_SHIFT 6U

/**
  * @brief Mask for the filter bits of the input trigger with shift.
  */
#define LPTIM_ETR_FILTER_MASK (3U << LPTIM_ETR_FILTER_SHIFT)

/**
  * @brief Mask for LPTIM_CFGR.
  */
#define LPTIM_MODE_CFGR_MASK \
  (LL_LPTIM_OC_WAVEFORM_SETONCE | LPTIM_CFGR_TIMOUT)

/**
  * @brief Mask for LPTIM_CR.
  */
#define LPTIM_MODE_CR_MASK \
  (LL_LPTIM_OPERATING_MODE_ONESHOT | LL_LPTIM_OPERATING_MODE_CONTINUOUS)

/**
  * @brief Mask to determine whether the clock source is internal, external, or encoder. \n
  *        The mask lets us select the ENC, the COUNTMODE, and the CKSEL of the CFGR register.
  */
#define LPTIM_CLOCK_TYPE_MASK       \
  (LL_LPTIM_CLK_SOURCE_EXTERNAL   | \
   LL_LPTIM_COUNTER_MODE_EXTERNAL | \
   LL_LPTIM_ENCODER_MODE_ENABLE)


/**
  *  @}
  */

/** @defgroup  LPTIM_Private_Macros LPTIM Private Macros
  *  @{
  */

/**
  * @brief  Check the validity of an output channel parameter.
  * @param  instance  LPTIM instance.
  * @param  channel   The channel to check (@ref hal_lptim_channel_t).
  * @retval SET (compare channel is valid) or RESET (compare channel is invalid).
  */
#define IS_LPTIM_OC_CHANNEL(instance, channel) \
  ((((channel) == HAL_LPTIM_CHANNEL_1) && IS_LPTIM_CC1_INSTANCE((instance)))      \
   || (((channel) == HAL_LPTIM_CHANNEL_2) && IS_LPTIM_CC2_INSTANCE((instance))))

/**
  * @brief  Check if the timeout period is expired.
  * @param  delta_ticks  Delta ticks to compare with the timeout period
  * @retval SET (timeout period is expired) or RESET (otherwise).
  */
#define LPTIM_TIMEOUT_PERIOD_EXPIRED(delta_ticks) \
  ((delta_ticks) > (uint32_t)LPTIM_TIMEOUT)

/**
  * @brief  Get the LPTIM instance from the handle.
  * @param  hlptim  LPTIM handle.
  * @retval LPTIM instance.
  */
#define LPTIM_INSTANCE(hlptim) ((lptim_t *)((uint32_t)((hlptim)->instance)))

#if defined(USE_HAL_LPTIM_DMA) && (USE_HAL_LPTIM_DMA == 1)
/**
  * @brief  Macro that returns the global state depending on the DMA silent mode.
  * @param  interrupts  DMA interrupts.
  * @retval HAL_LPTIM_STATE_ACTIVE_SILENT (DMA silent mode is active) or
  *         HAL_LPTIM_STATE_ACTIVE (DMA silent mode is not active).
  */
#define LPTIM_STATE_ACTIVE(interrupts) \
  HAL_LPTIM_STATE_ACTIVE |             \
  ((((interrupts) & HAL_DMA_OPT_IT_SILENT) == HAL_DMA_OPT_IT_SILENT) ? LPTIM_ACTIVE_SILENT : LPTIM_ACTIVE_NOT_SILENT)

/**
  * @brief  Macro that returns the input channel state depending on the DMA silent mode.
  * @param  interrupts  DMA interrupts.
  * @retval HAL_LPTIM_IC_CHANNEL_STATE_ACTIVE_SILENT (DMA silent mode is active) or
  *         HAL_LPTIM_IC_CHANNEL_STATE_ACTIVE (DMA silent mode is not active).
  */
#define LPTIM_IC_CHANNEL_STATE_ACTIVE(interrupts) \
  ((STM32_IS_BIT_SET((interrupts), (uint32_t)HAL_DMA_OPT_IT_SILENT)) ? \
   HAL_LPTIM_IC_CHANNEL_STATE_ACTIVE_SILENT : HAL_LPTIM_IC_CHANNEL_STATE_ACTIVE)

#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
/**
  * @brief  Macro for the control of DMA silent mode validity.
  * @param  handle     LPTIM handle.
  * @param  channel    DMA channel.
  * @param  interrupts DMA interrupts.
  * @retval SET (DMA silent mode is valid) or RESET (DMA silent mode is invalid).
  */
#define IS_LPTIM_DMA_VALID_SILENT_MODE(handle, channel, interrupts) \
  (((interrupts) == HAL_LPTIM_OPT_DMA_IT_SILENT)                    \
   && ((handle)->hdma[(channel)]->xfer_mode != HAL_DMA_XFER_MODE_LINKEDLIST_CIRCULAR) ? 0U : 1U)

#endif /* USE_HAL_DMA_LINKEDLIST */
/**
  * @brief  Tell whether the DMA silent mode is active.
  * @param  state  The state to check.
  * @retval SET (DMA silent mode is active) or RESET (otherwise).
  */
#define IS_LPTIM_ACTIVE_SILENT(state) \
  ((uint32_t)(state) & (uint32_t)LPTIM_ACTIVE_SILENT)

#endif /* USE_HAL_LPTIM_DMA */

/**
  * @brief  Check the validity of the channel.
  * @param  channel  The channel to check (@ref hal_lptim_channel_t).
  * @retval SET (channel is valid) or RESET (channel is invalid).
  */
#define IS_LPTIM_CHANNEL(channel)     \
  (((channel) == HAL_LPTIM_CHANNEL_1) \
   || ((channel) == HAL_LPTIM_CHANNEL_2))

/**
  * @brief  Check the validity of the LPTIM1 channel sources.
  * @param  channel   The channel to check (@ref hal_lptim_channel_t).
  * @param  src       The channel source to check (@ref hal_lptim_ic_src_t).
  * @retval SET (channel source is valid) or RESET (channel source is invalid).
  */
#define IS_LPTIM1_CHANNEL_SRC(channel, src) \
  ((((channel) == HAL_LPTIM_CHANNEL_1) \
    && (((src) == HAL_LPTIM_INPUT_GPIO) \
        || ((src) == HAL_LPTIM_INPUT_COMP1_OUT) \
        || ((src) == HAL_LPTIM_INPUT_EVENTOUT) \
        || ((src) == HAL_LPTIM_INPUT_MCO1))) \
   || (((channel) == HAL_LPTIM_CHANNEL_2) \
       && (((src) == HAL_LPTIM_INPUT_GPIO) \
           || ((src) == HAL_LPTIM_INPUT_LSI) \
           || ((src) == HAL_LPTIM_INPUT_LSE) \
           || ((src) == HAL_LPTIM_INPUT_RCC_HSE_1MHZ))))

/**
  * @brief  Check the validity of the channel sources.
  * @param  instance  LPTIM instance.
  * @param  channel   The channel to check (@ref hal_lptim_channel_t).
  * @param  src       The channel source to check (@ref hal_lptim_ic_src_t).
  * @retval SET (channel source is valid) or RESET (channel source is invalid).
  */
#define IS_LPTIM_CHANNEL_SRC(instance, channel, src) \
  ((((instance) == LPTIM1) && IS_LPTIM1_CHANNEL_SRC((channel), (src))))


/**
  * @brief  Check the validity of the input1 polarity.
  * @param  polarity  The input1 polarity to check (@ref hal_lptim_input1_polarity_t).
  * @retval SET (input1 polarity is valid) or RESET (input1 polarity is invalid).
  */
#define IS_LPTIM_INPUT1_POLARITY(polarity)     \
  (((polarity) == HAL_LPTIM_INPUT1_RISING)     \
   || ((polarity) == HAL_LPTIM_INPUT1_FALLING) \
   || ((polarity) == HAL_LPTIM_INPUT1_RISING_FALLING))

/**
  * @brief  Check the validity of the input1 source.
  * @param  src  The input1 source to check (@ref hal_lptim_input1_src_t).
  * @retval SET (input1 polarity is valid) or RESET (input1 polarity is invalid).
  */
#define IS_LPTIM_INPUT1_SRC(src)   \
  (((src) == HAL_LPTIM_INPUT1_GPIO)\
   || ((src) == HAL_LPTIM_INPUT1_COMP1_OUT))

/**
  * @brief Check input2 source
  */
#if defined(COMP2)
#define IS_LPTIM_INPUT2_SRC(src)       \
  (((src) == HAL_LPTIM_INPUT2_GPIO)    \
   || ((src) == HAL_LPTIM_INPUT2_COMP2_OUT))
#else
#define IS_LPTIM_INPUT2_SRC(src)       \
  (((src) == HAL_LPTIM_INPUT2_GPIO))
#endif /* COMP2 */

/**
  * @brief  Check the validity of the clock encoder submode.
  * @param  src  The clock encoder submode to check (@ref hal_lptim_clk_src_t).
  * @retval SET (clock encoder submode is valid) or RESET (clock encoder submode is invalid).
  */
#define IS_LPTIM_CLK_ENCODER(src)                \
  (((src) == HAL_LPTIM_CLK_ENCODER_SUBMODE_1)    \
   || ((src) == HAL_LPTIM_CLK_ENCODER_SUBMODE_2) \
   || ((src) == HAL_LPTIM_CLK_ENCODER_SUBMODE_3))

/**
  * @brief  Check the validity of the clock source with respect to the instance.
  * @param  instance  LPTIM instance.
  * @param  src  The clock source to check (@ref hal_lptim_clk_src_t).
  * @retval SET (clock source is valid) or RESET (clock source is invalid).
  */
#define IS_LPTIM_CLK_SRC(instance, src)              \
  (((src) == HAL_LPTIM_CLK_INTERNAL)                 \
   || ((src) == HAL_LPTIM_CLK_EXTERNAL_SYNCHRONOUS)  \
   || ((src) == HAL_LPTIM_CLK_EXTERNAL_ASYNCHRONOUS) \
   || (IS_LPTIM_CLK_ENCODER(src)                     \
       && (IS_LPTIM_ENCODER_INTERFACE_INSTANCE(instance))))

/**
  * @brief  Check the validity of the clock source prescaler with respect to the clock source.
  * @param  clock_source  The clock source to check prescaler (@ref hal_lptim_clk_src_t).
  * @param  prescaler     The prescaler to check (@ref hal_lptim_clk_src_presc_t).
  * @note   When the clock source is either HAL_LPTIM_CLK_EXTERNAL_SYNCHRONOUS
  *         or HAL_LPTIM_CLK_ENCODER_SUBMODE_x the internal clock provided to
  *         the LPTIM must not be prescaled.
  * @retval SET (clock source and prescaler is valid) or RESET (clock source and prescaler is invalid).
  */
#define IS_LPTIM_CLK_SRC_PRESC(clock_source, prescaler)   \
  (((clock_source) == HAL_LPTIM_CLK_EXTERNAL_SYNCHRONOUS) \
   || (IS_LPTIM_CLK_ENCODER(clock_source))                \
   ? ((prescaler) == HAL_LPTIM_CLK_SRC_DIV1)              \
   : (((prescaler) == HAL_LPTIM_CLK_SRC_DIV1)             \
      || ((prescaler) == HAL_LPTIM_CLK_SRC_DIV2)          \
      || ((prescaler) == HAL_LPTIM_CLK_SRC_DIV4)          \
      || ((prescaler) == HAL_LPTIM_CLK_SRC_DIV8)          \
      || ((prescaler) == HAL_LPTIM_CLK_SRC_DIV16)         \
      || ((prescaler) == HAL_LPTIM_CLK_SRC_DIV32)         \
      || ((prescaler) == HAL_LPTIM_CLK_SRC_DIV64)         \
      || ((prescaler) == HAL_LPTIM_CLK_SRC_DIV128)))

/**
  * @brief  Check the validity of the clock source with respect to the counter mode.
  * @param  clock_source  The clock source to check counter mode (@ref hal_lptim_clk_src_t).
  * @param  mode          The counter mode to check (@ref hal_lptim_mode_t).
  * @note   When the clock source is a clock encoder, the mode provided must be CONTINUOUS.
  * @retval SET (clock source and counter mode is valid) or RESET (clock source and counter mode is invalid).
  */
#define IS_LPTIM_MODE(clock_source, mode) \
  ((IS_LPTIM_CLK_ENCODER(clock_source)) ? ((mode) == HAL_LPTIM_CONTINUOUS) : (((mode) == HAL_LPTIM_ONE_SHOT)      \
                                                                              || ((mode) == HAL_LPTIM_SET_ONCE)   \
                                                                              || ((mode) == HAL_LPTIM_CONTINUOUS) \
                                                                              || ((mode) == HAL_LPTIM_TIMEOUT)))

/**
  * @brief  Check the value to store in the auto-reload register (ARR).
  * @param  period    Period value.
  * @retval SET (period value valid) or RESET (period value invalid).
  */
#define IS_LPTIM_PERIOD(period) \
  (((period) > 0U) && ((period) <= 0x0000FFFFU))

/**
  * @brief  Check the value to store in the repetition counter register (RCR).
  * @param  rep  Repetition counter value.
  * @retval SET (repetition counter value valid) or RESET (repetition counter value invalid).
  */
#define IS_LPTIM_REPETITION_COUNTER(rep) \
  ((rep) <= 0x000000FFU)

/**
  * @brief  Check the validity of the DMA index.
  * @param  idx  The DMA index to check (@ref hal_lptim_dma_index_t).
  * @retval SET (DMA index is valid) or RESET (DMA index is invalid).
  */
#define IS_LPTIM_DMA_INDEX(idx)       \
  (((idx) == HAL_LPTIM_DMA_ID_UPDATE) \
   || ((idx) == HAL_LPTIM_DMA_ID_CC1) \
   || ((idx) == HAL_LPTIM_DMA_ID_CC2))

/**
  * @brief Check external trigger LPTIM1.
  */
#define IS_LPTIM1_EXT_TRIG_SRC(src)              \
  (((src) == HAL_LPTIM_EXT_TRIG_GPIO)            \
   || ((src) == HAL_LPTIM_EXT_TRIG_RTC_ALRA_TRG) \
   || ((src) == HAL_LPTIM_EXT_TRIG_RTC_ALRB_TRG) \
   || ((src) == HAL_LPTIM_EXT_TRIG_TAMP_TRG1)    \
   || ((src) == HAL_LPTIM_EXT_TRIG_TAMP_TRG2)    \
   || ((src) == HAL_LPTIM_EXT_TRIG_LPDMA_CH1_TC) \
   || ((src) == HAL_LPTIM_EXT_TRIG_COMP1_OUT)    \
   || ((src) == HAL_LPTIM_EXT_TRIG_EVENTOUT))


/**
  * @brief Check external trigger.
  */
#define IS_LPTIM_EXT_TRIG_SRC(instance, src)                   \
  ((((instance) == LPTIM1) && IS_LPTIM1_EXT_TRIG_SRC((src))))

/**
  * @brief  Check the validity of the input channel prescaler.
  * @param  prescaler  The input channel prescaler to check (@ref hal_lptim_ic_prescaler_t).
  * @retval SET (input channel prescaler is valid) or RESET (input channel prescaler is invalid).
  */
#define IS_LPTIM_IC_PRESCALER(prescaler) \
  (((prescaler) == HAL_LPTIM_IC_DIV1)    \
   || ((prescaler) == HAL_LPTIM_IC_DIV2) \
   || ((prescaler) == HAL_LPTIM_IC_DIV4) \
   || ((prescaler) == HAL_LPTIM_IC_DIV8))

/**
  * @brief  Check the validity of the external trigger polarity.
  * @param  polarity  The external trigger polarity to check (@ref hal_lptim_ext_trig_polarity_t).
  * @retval SET (external trigger polarity is valid) or RESET (external trigger polarity is invalid).
  */
#define IS_LPTIM_EXT_TRIG_POLARITY(polarity) \
  (((polarity) == HAL_LPTIM_TRIG_RISING)     \
   || ((polarity) == HAL_LPTIM_TRIG_FALLING) \
   || ((polarity) == HAL_LPTIM_TRIG_RISING_FALLING))

/**
  * @brief  Check the validity of the filter.
  * @param  fdiv  The filter division to check (@ref hal_lptim_filter_t).
  * @retval SET (filter division is valid) or RESET (filter division is invalid).
  */
#define IS_LPTIM_FILTER(fdiv)        \
  (((fdiv) == HAL_LPTIM_FDIV1)       \
   || ((fdiv) == HAL_LPTIM_FDIV1_N2) \
   || ((fdiv) == HAL_LPTIM_FDIV1_N4) \
   || ((fdiv) == HAL_LPTIM_FDIV1_N8))

/**
  * @brief Check the validity of the output compare pulse.
  * @param pulse The output compare pulse.
  * @retval SET (output compare pulse is valid) or RESET (output compare pulse is invalid).
  */
#define IS_LPTIM_OC_PULSE(pulse) \
  ((pulse) <= 0xFFFFU)

/**
  * @brief  Check the validity of the output channel polarity.
  * @param  polarity  The output channel polarity to check (@ref hal_lptim_oc_polarity_t).
  * @retval SET (output channel polarity is valid) or RESET (output channel polarity is invalid).
  */
#define IS_LPTIM_OC_POLARITY(polarity) \
  (((polarity) == HAL_LPTIM_OC_HIGH)   \
   || ((polarity) == HAL_LPTIM_OC_LOW))

/**
  * @brief  Check the validity of the input channel polarity.
  * @param  polarity  The input channel polarity to check (@ref hal_lptim_ic_polarity_t).
  * @retval SET (input channel polarity is valid) or RESET (input channel polarity is invalid).
  */
#define IS_LPTIM_IC_POLARITY(polarity)     \
  (((polarity) == HAL_LPTIM_IC_RISING)     \
   || ((polarity) == HAL_LPTIM_IC_FALLING) \
   || ((polarity) == HAL_LPTIM_IC_RISING_FALLING))

/**
  * @brief  Check the validity of clock source external asynchronous.
  * @param  clk  The clock source to check (@ref hal_lptim_clk_src_t)
  * @retval SET (Clock src is external asynchronous) or RESET (Clock src is not external asynchronous).
  */
#define IS_LPTIM_CLK_EXTERNAL_ASYNCHRONOUS(clk) \
  ((((clk) & LL_LPTIM_CLK_SOURCE_EXTERNAL) != 0U) ? 1U : 0U)

/**
  * @brief  Check the validity of clock source encoder submode.
  * @param  clk The clock source to check (@ref hal_lptim_clk_src_t)
  * @retval SET (Clock src is an encoder submode type) or RESET (Clock src is not an encoder submode type).
  */
#define IS_LPTIM_CLOCK_TYPE_ENCODER(clk) \
  ((((clk) & LL_LPTIM_ENCODER_MODE_ENABLE) != 0U) ? 1U : 0U)

/**
  * @brief Extract the clock type (internal, external, encoder) from CFGR register.
  */
/**
  * @brief  Extract the clock type (internal, external, encoder) from the CFGR register.
  * @param  cfgr The register needs to extract the clock type.
  * @retval Clock type (internal, external, encoder).
  */
#define LPTIM_GET_CLOCK_TYPE(cfgr) \
  ((uint32_t)((cfgr) & LPTIM_CLOCK_TYPE_MASK))

/**
  * @brief  Extract the clock filter from instance.CFGR register.
  * @param  instance  LPTIM instance.
  * @retval Clock filter
  */
#define LPTIM_GET_CLOCK_FILTER(instance) \
  (uint32_t)(LL_LPTIM_GetClockFilter(instance) >> LPTIM_CFGR_CKFLT_Pos)

/**
  * @brief  Transform the HAL filter into a LL filter.
  * @param  filter  The HAL filter.
  * @retval The LL filter.
  */
#define LPTIM_CFGR_HAL2LL_FILTER(filter) \
  (uint32_t)((filter) << LPTIM_CFGR_CKFLT_Pos)

/**
  * @brief  Transform the HAL filter into a LL IC filter.
  * @param  filter  The HAL filter.
  * @retval The LL IC filter.
  */
#define LPTIM_IC_HAL2LL_FILTER(filter) \
  (uint32_t)((filter) << LPTIM_CCMR1_IC1F_Pos)

/**
  * @brief  Transform the LL filter into a HAL IC filter.
  * @param  filter  The HAL filter.
  * @retval The LL IC filter.
  */
#define LPTIM_IC_LL2HAL_FILTER(filter) \
  (uint32_t)((filter) >> LPTIM_CCMR1_IC1F_Pos)

/**
  * @brief Extract the trigger source from CFGR.
  * @param  cfgr  The CFGR register.
  * @retval The LL trigger source.
  */
#define LPTIM_GET_ETR_SOURCE(cfgr) \
  ((uint32_t)(((cfgr) & LPTIM_ETR_SRC_MASK)))

/**
  * @brief Extract the ETR filter value from CFGR.
  * @param  cfgr  The CFGR register.
  * @retval The LL trigger filter.
  */
#define LPTIM_GET_ETR_FILTER(cfgr) \
  ((uint32_t)(((cfgr) & LPTIM_ETR_FILTER_MASK)))

/**
  * @brief Extract the ETR polarity from CFGR.
  * @param  cfgr  The CFGR register.
  * @retval The LL trigger polarity.
  */
#define LPTIM_GET_ETR_POLARITY(cfgr) \
  ((uint32_t)((cfgr) & LPTIM_ETR_POLARITY_MASK))

/**
  * @brief Reset the clock source prescaler from CFGR register.
  * @param  cfgr  The CFGR register.
  * @retval The CFGR with Clock source prescaler reset.
  */
#define LPTIM_RESET_CLOCK_SOURCE_PRESCALER(cfgr) \
  ((cfgr) &= ~(uint32_t)(LPTIM_CFGR_PRESC))

/**
  * @brief  Get the low-power timer handle registered in the DMA handle.
  * @param  hdma  DMA handle.
  * @retval LPTIM handle.
  */
#define LPTIM_GET_HDMA_PARENT(hdma) \
  (hal_lptim_handle_t *)((hdma)->p_parent)

/**
  *  @}
  */

