MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_lptim.c
/** @defgroup LPTIM_Private_Functions LPTIM Private Functions
  *  @{
  */

#if defined(USE_HAL_LPTIM_CLK_ENABLE_MODEL) && (USE_HAL_LPTIM_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO)
/**
  * @brief  Clock enabling for a particular instance.
  * @param  instance HAL LPTIM instance
  */
__STATIC_FORCEINLINE void LPTIM_EnableClock(hal_lptim_t instance)
{
  switch (instance)
  {
    case HAL_LPTIM1:
      HAL_RCC_LPTIM1_EnableClock();
      break;
    default:
      break;
  }
}
#endif /* USE_HAL_LPTIM_CLK_ENABLE_MODEL */

/**
  * @brief    Wait for a given flag.
  * @param    p_lptim                  CMSIS LPTIM instance
  * @param    ll_lptim_is_active_flag  Is flag active
  * @warning  That is the responsibility of the caller to clear the flag.
  * @return   return                  state of flag
  * @retval 1                       flag not activate
  * @retval 0                       flag is correctly activate
  */
static hal_status_t LPTIM_WaitFlag(const lptim_t *p_lptim,
                                   uint32_t (*ll_lptim_is_active_flag)(const lptim_t *p_lptim))
{
  uint32_t tickstart = HAL_GetTick();
  uint8_t isActiveFlag = 0;

  while (isActiveFlag == 0U)
  {
    isActiveFlag = ll_lptim_is_active_flag(p_lptim);
    if (LPTIM_TIMEOUT_PERIOD_EXPIRED(HAL_GetTick() - tickstart))
    {
      /* New check to avoid false timeout detection in case of preemption */
      if (isActiveFlag == 0U)
      {
        return HAL_ERROR;
      }
    }
  }
  return HAL_OK;
}

/**
  * @brief  Disable LPTIM HW instance.
  * @param  p_lptim   CMSIS LPTIM instance
  * @note   The following sequence is required to solve LPTIM disable HW limitation.
  *         Please check Errata Sheet ES0335 for more details under "MCU remain
  *         stuck in LPTIM interrupt when entering Stop mode" section.
  * @retval None
  */
__STATIC_INLINE hal_status_t LPTIM_CcDisable(lptim_t *p_lptim)
{
  /* save LPTIM Config */
  lptim_t cpyInstance = *p_lptim;

  /* Enter critical section */
  uint32_t primask_bit = __get_PRIMASK();
  __set_PRIMASK(1);

  switch ((uint32_t)p_lptim)
  {
    case HAL_LPTIM1:
      HAL_RCC_LPTIM1_Reset();
      break;
    default:
      break;
  }

  uint32_t dier_reg = LL_LPTIM_READ_REG(&cpyInstance, DIER);
  uint32_t arr_reg = LL_LPTIM_READ_REG(&cpyInstance, ARR);

  if ((dier_reg != 0U) || (arr_reg != 0U))
  {
    LL_LPTIM_Enable(p_lptim);
    LL_LPTIM_WRITE_REG(p_lptim, DIER, LL_LPTIM_READ_REG(&cpyInstance, DIER));
    if (LPTIM_WaitFlag(p_lptim, LL_LPTIM_IsActiveFlag_DIEROK) != HAL_OK)
    {
      return HAL_ERROR;
    }
    LL_LPTIM_ClearFlag_DIEROK(p_lptim);
    LL_LPTIM_SetAutoReload(p_lptim, LL_LPTIM_READ_REG(&cpyInstance, ARR));
    if (LPTIM_WaitFlag(p_lptim, LL_LPTIM_IsActiveFlag_ARROK) != HAL_OK)
    {
      return HAL_ERROR;
    }
    LL_LPTIM_ClearFlag_ARROK(p_lptim);
    LL_LPTIM_Disable(p_lptim);
  }

  LL_LPTIM_OC_SetCompareCH1(p_lptim, LL_LPTIM_READ_REG(&cpyInstance, CCR1));
  LL_LPTIM_OC_SetCompareCH2(p_lptim, LL_LPTIM_READ_REG(&cpyInstance, CCR2));
  LL_LPTIM_SetRepetition(p_lptim, LL_LPTIM_READ_REG(&cpyInstance, RCR));
  LL_LPTIM_WRITE_REG(p_lptim, CFGR, LL_LPTIM_READ_REG(&cpyInstance, CFGR));
  LL_LPTIM_WRITE_REG(p_lptim, CFGR2, LL_LPTIM_READ_REG(&cpyInstance, CFGR2));
  LL_LPTIM_WRITE_REG(p_lptim, CCMR1, LL_LPTIM_READ_REG(&cpyInstance, CCMR1));

  /* Restore LPTIM_Config */
  __set_PRIMASK(primask_bit);
  return HAL_OK;
}

#if defined(USE_HAL_LPTIM_REGISTER_CALLBACKS) && (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
/**
  * @brief Callbacks initialization function.
  * @param hlptim   Pointer to the handle of the LPTIM instance.
  */
__STATIC_FORCEINLINE void LPTIM_InitCallbacks(hal_lptim_handle_t *hlptim)
{
#if defined(USE_HAL_LPTIM_DMA) && (USE_HAL_LPTIM_DMA == 1)
  /* LPTIM Error Callback */
  hlptim->error_callback = HAL_LPTIM_ErrorCallback;

  hlptim->stop_callback = HAL_LPTIM_StopCallback;

  hlptim->input_capture_stop_callback = HAL_LPTIM_InputCaptureStopCallback;
#endif /* USE_HAL_LPTIM_DMA */

  /* LPTIM Period Elapsed Callback */
  hlptim->update_callback = HAL_LPTIM_UpdateCallback;

#if defined(USE_HAL_LPTIM_DMA) && (USE_HAL_LPTIM_DMA == 1)
  /* LPTIM Period Elapsed half complete Callback */
  hlptim->update_half_cplt_callback = HAL_LPTIM_UpdateHalfCpltCallback;
#endif /* USE_HAL_LPTIM_DMA */

  /* LPTIM Auto Reload Update Callback */
  hlptim->auto_reload_update_callback = HAL_LPTIM_AutoReloadUpdateCallback;

  /* LPTIM Auto Reload Match Callback */
  hlptim->auto_reload_match_callback = HAL_LPTIM_AutoReloadMatchCallback;

  /* LPTIM Repetition Update Callback */
  hlptim->rep_update_callback = HAL_LPTIM_RepUpdateCallback;

  /* LPTIM Trigger Callback */
  hlptim->trigger_callback = HAL_LPTIM_TriggerCallback;

  /* LPTIM Output Compare Delay Elapsed Callback */
  hlptim->compare_match_callback = HAL_LPTIM_CompareMatchCallback;

  /* LPTIM Output Compare Update Callback */
  hlptim->compare_update_callback = HAL_LPTIM_CompareUpdateCallback;

  /* LPTIM Input Capture Callback */
  hlptim->input_capture_callback = HAL_LPTIM_InputCaptureCallback;

#if defined(USE_HAL_LPTIM_DMA) && (USE_HAL_LPTIM_DMA == 1)
  /* LPTIM Input Capture half complete Callback */
  hlptim->input_capture_half_cplt_callback = HAL_LPTIM_InputCaptureHalfCpltCallback;
#endif /* USE_HAL_LPTIM_DMA */

  /* LPTIM Over capture Callback */
  hlptim->input_over_capture_callback = HAL_LPTIM_InputOverCaptureCallback;

  /* LPTIM Direction UP Change Callback */
  hlptim->direction_up_callback = HAL_LPTIM_DirectionUpCallback;

  /* LPTIM Direction DOWN Change Callback */
  hlptim->direction_down_callback = HAL_LPTIM_DirectionDownCallback;
}
#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */

/**
  * @brief  Convert external trigger sources to an LL value.
  * @param  hlptim       Pointer to the handle of the LPTIM instance.
  * @param  exttrig_src  External trigger source to convert to an LL value.
  * @return LL value selector.
  */
__STATIC_INLINE uint32_t LPTIM_ConvertHALToLLExttrig(const hal_lptim_handle_t *hlptim,
                                                     hal_lptim_ext_trig_src_t exttrig_src)
{
  uint32_t trigsel = LL_LPTIM_TRIG_SOURCE_GPIO;
  uint32_t i = 0;

