MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_lptim.c
  while (extrig_mapping[i].ll_value != (uint32_t)0xFFFFU)
  {
    if ((extrig_mapping[i].exttrig_src == exttrig_src)
        && ((extrig_mapping[i].instance == (hal_lptim_t)0xFFFFU)
            || (extrig_mapping[i].instance == hlptim->instance)))
    {
      trigsel = extrig_mapping[i].ll_value;
      break;
    }
    ++i;
  }
  return trigsel;
}

/**
  * @brief  Convert an LL external trigger source to a HAL source value.
  * @param  hlptim   Pointer to the handle of the LPTIM instance.
  * @param  trigsel  LL value used to convert to an external trigger source.
  * @return @ref hal_lptim_ext_trig_src_t External trigger source value.
  */
__STATIC_INLINE hal_lptim_ext_trig_src_t LPTIM_ConvertLLToHALExttrig(const hal_lptim_handle_t *hlptim,
                                                                     uint32_t trigsel)
{
  hal_lptim_ext_trig_src_t exttrig_src = HAL_LPTIM_EXT_TRIG_GPIO;
  uint32_t i = 0;

  while (extrig_mapping[i].ll_value != (uint32_t)0xFFFFU)
  {
    if ((extrig_mapping[i].ll_value == trigsel)
        && ((extrig_mapping[i].instance == (hal_lptim_t)0xFFFFU)
            || (extrig_mapping[i].instance == hlptim->instance)))
    {
      exttrig_src = extrig_mapping[i].exttrig_src;
      break;
    }
    ++i;
  }

  return exttrig_src;
}

/**
  * @brief  Convert a HAL input channel source to an LL input source value.
  * @param  hlptim      Pointer to the handle of the LPTIM instance.
  * @param  channel     LPTIM channel identifier.
  * @param  channel_src Input channel source to convert to an LL value.
  * @return LL value selector.
  */
__STATIC_INLINE uint32_t LPTIM_ConvertHALToLLIcx(const hal_lptim_handle_t *hlptim,
                                                 hal_lptim_channel_t channel,
                                                 hal_lptim_ic_src_t channel_src)
{
  uint32_t icxsel = 0x00000000UL; /*ICx_GPIO */
  uint32_t i = 0;
  const lptim_mapping_t *icx_mapping;

  switch (channel)
  {
    case HAL_LPTIM_CHANNEL_1:
      icx_mapping = ic1_mapping;
      break;
    case HAL_LPTIM_CHANNEL_2:
      icx_mapping = ic2_mapping;
      break;
    default:
      icx_mapping = NULL;
      break;
  }

  if (icx_mapping != NULL)
  {
    while (icx_mapping[i].ll_value != (uint32_t)0xFFFFU)
    {
      if ((icx_mapping[i].channel_src == channel_src)
          && ((icx_mapping[i].instance == (hal_lptim_t)0xFFFFU)
              || (icx_mapping[i].instance == hlptim->instance)))
      {
        icxsel = icx_mapping[i].ll_value;
        break;
      }
      ++i;
    }
  }
  return icxsel;
}

/**
  * @brief  Convert an LL input source to a HAL input channel source value.
  * @param  hlptim    Pointer to the handle of the LPTIM instance.
  * @param  channel   LPTIM channel identifier.
  * @param  icxsel    LL value used to convert to input channel sources.
  * @return @ref hal_lptim_ic_src_t.
  */
__STATIC_INLINE hal_lptim_ic_src_t LPTIM_ConvertLLToHALIcx(const hal_lptim_handle_t *hlptim,
                                                           hal_lptim_channel_t channel,
                                                           uint32_t icxsel)
{
  uint32_t i = 0;
  hal_lptim_ic_src_t channel_src = HAL_LPTIM_INPUT_GPIO;
  const lptim_mapping_t *icx_mapping;

  switch (channel)
  {
    case HAL_LPTIM_CHANNEL_1:
      icx_mapping = ic1_mapping;
      break;
    case HAL_LPTIM_CHANNEL_2:
      icx_mapping = ic2_mapping;
      break;
    default:
      icx_mapping = NULL;
      break;
  }

  if (icx_mapping != NULL)
  {
    while (icx_mapping[i].ll_value != (uint32_t)0xFFFFU)
    {
      if ((icx_mapping[i].ll_value == icxsel)
          && ((icx_mapping[i].instance == (hal_lptim_t)0xFFFFU)
              || (icx_mapping[i].instance == hlptim->instance)))
      {
        channel_src = icx_mapping[i].channel_src;
        break;
      }
      ++i;
    }
  }
  return channel_src;

}

/**
  * @brief Get the clock source of the low-power timer time-base unit.
  * @param p_lptim      CMSIS LPTIM instance.
  * @return @ref hal_lptim_clk_src_t clock source mode.
  */
__STATIC_INLINE hal_lptim_clk_src_t LPTIM_GetClockSource(const lptim_t *p_lptim)
{
  volatile uint32_t cfgr = LL_LPTIM_READ_REG(p_lptim, CFGR);
  uint32_t clk_src = (uint32_t)LPTIM_GET_CLOCK_TYPE(cfgr);

  if (IS_LPTIM_CLOCK_TYPE_ENCODER((uint32_t)clk_src) != 0U)
  {
    /* For the encoder mode the polarity gives the submode. */
    clk_src |= (cfgr & LPTIM_CLOCK_POLARITY_MASK);

    /* COUNTMODE force clean... */
    clk_src &= ~LL_LPTIM_COUNTER_MODE_EXTERNAL;

    clk_src &= (cfgr | LPTIM_CFGR_CKPOL_Pos);

  }
  else
  {
    if (IS_LPTIM_CLK_EXTERNAL_ASYNCHRONOUS((uint32_t)clk_src) != 0U)
    {
      /* Just to make sure that LL_LPTIM_COUNTER_MODE_EXTERNAL is 0. */
      clk_src &= ~LL_LPTIM_COUNTER_MODE_EXTERNAL;
    }
  }

  return (hal_lptim_clk_src_t)clk_src;
}

/**
  * @brief  Set the clock source of the low-power timer time-base unit.
  * @param  p_lptim  CMSIS LPTIM instance.
  * @note   Ensure the LPTIM instance is disabled.
  * @param  clk_src  Configured clock source.
  */
__STATIC_FORCEINLINE void LPTIM_SetClockSource(lptim_t *p_lptim,
                                               hal_lptim_clk_src_t clk_src)
{
  volatile uint32_t cfgr = LL_LPTIM_READ_REG(p_lptim, CFGR);

  /* Reset CKSEL (which is set to 1 only when clk_src is
     HAL_LPTIM_CLK_EXTERNAL_ASYNCHRONOUS */
  cfgr &= ~((uint32_t)(HAL_LPTIM_CLK_EXTERNAL_ASYNCHRONOUS));

  /* Reset COUNTMODE */
  cfgr &= ~LL_LPTIM_COUNTER_MODE_EXTERNAL;

  if (IS_LPTIM_CLOCK_TYPE_ENCODER((uint32_t)clk_src) != 0U)
  {
    /* Reset the polarity. */
    cfgr &= ~LPTIM_CLOCK_POLARITY_MASK;
  }

  cfgr |= (uint32_t)clk_src;

  LL_LPTIM_WRITE_REG(p_lptim, CFGR, cfgr);
}

/**
  * @brief  Program the pulse width for output channel mode.
  * @param  p_lptim     CMSIS LPTIM instance
  * @param  channel     Output channel of interest. \n
  *                       Must be one of the following values: \n
  *                       @arg @ref HAL_LPTIM_CHANNEL_1
  *                       @arg @ref HAL_LPTIM_CHANNEL_2
  * @param  pulse       Config pulse.
  * @retval HAL_OK
  * @retval HAL_ERROR   LPTIM_CMP write operation failed.
  */
static hal_status_t LPTIM_OC_SetPulse(lptim_t *p_lptim,
                                      hal_lptim_channel_t channel,
                                      uint32_t pulse)
{
  /* Enable LPTIM if it was disabled when entering this function. */
  uint32_t is_lptim_enabled = LL_LPTIM_IsEnabled(p_lptim);
  LL_LPTIM_Enable(p_lptim);

