MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_lptim.c
  if (channel == HAL_LPTIM_CHANNEL_1)
  {
    /* Clear the compare register 1 update flag */
    LL_LPTIM_WRITE_REG(p_lptim, ICR, LL_LPTIM_ISR_CMP1OK);

    /* Write to CCR1 register the pulse value */
    LL_LPTIM_OC_SetCompareCH1(p_lptim, pulse);
    if (LPTIM_WaitFlag(p_lptim, LL_LPTIM_IsActiveFlag_CMP1OK) != HAL_OK)
    {
      return HAL_ERROR;
    }
    LL_LPTIM_ClearFlag_CMP1OK(p_lptim);
  }
  else /* HAL_LPTIM_CHANNEL_2 */
  {
    /* Clear the compare register 2 update flag */
    LL_LPTIM_WRITE_REG(p_lptim, ICR, LL_LPTIM_ISR_CMP2OK);

    /* Write to CCR2 register the pulse value */
    LL_LPTIM_OC_SetCompareCH2(p_lptim, pulse);
    if (LPTIM_WaitFlag(p_lptim, LL_LPTIM_IsActiveFlag_CMP2OK) != HAL_OK)
    {
      return HAL_ERROR;
    }
    LL_LPTIM_ClearFlag_CMP2OK(p_lptim);
  }

  if (is_lptim_enabled == 0U)
  {
    LL_LPTIM_Disable(p_lptim);
  }

  return HAL_OK;
}

/**
  * @brief  Start the low-power timer with the selected mode.
  * @param  p_lptim     CMSIS LPTIM instance.
  * @param  mode        Selection of the LPTIM modes (list here: @ref hal_lptim_mode_t).
  * @retval HAL_OK
  * @retval HAL_ERROR   Error: encoder clock initialized but continuous mode set.
  */
static hal_status_t LPTIM_Start(lptim_t *p_lptim, uint32_t mode)
{
  /* Ensure the LPTIM instance is disabled, but disable it again for safety. */
  LL_LPTIM_Disable(p_lptim);

  volatile uint32_t cfgr = LL_LPTIM_READ_REG(p_lptim, CFGR);

  if ((IS_LPTIM_CLOCK_TYPE_ENCODER(LPTIM_GET_CLOCK_TYPE(cfgr)) != 0U) && (mode != (uint32_t)HAL_LPTIM_CONTINUOUS))
  {
    return HAL_ERROR;
  }

  cfgr &= ~LPTIM_MODE_CFGR_MASK;
  cfgr |= (mode & LPTIM_MODE_CFGR_MASK);
  LL_LPTIM_WRITE_REG(p_lptim, CFGR, cfgr);

  return HAL_OK;
}

#if defined(USE_HAL_LPTIM_DMA) && (USE_HAL_LPTIM_DMA == 1)

/**
  * @brief  Get the channel associated with a DMA handler.
  * @param  hlptim Pointer to the handle of the LPTIM instance.
  * @param  hdma Pointer to the handle of the DMA instance.
  * @return @ref hal_lptim_channel_t Channel number of the handler.
  */
__STATIC_INLINE hal_lptim_channel_t LPTIM_GetCCxDmaHandler(const hal_lptim_handle_t *hlptim,
                                                           const hal_dma_handle_t *hdma)
{
  if (hdma == hlptim->hdma[HAL_LPTIM_DMA_ID_CC1])
  {
    return HAL_LPTIM_CHANNEL_1;
  }
  else
  {
    return HAL_LPTIM_CHANNEL_2;
  }
}


/**
  * @brief Capture half complete.
  * @param hdma Pointer to the DMA handler.
  */
static void LPTIM_DMACaptureHalfcpltCallback(hal_dma_handle_t *hdma)
{
  hal_lptim_handle_t *hlptim = LPTIM_GET_HDMA_PARENT(hdma);

  /* Identify the channel */
  const hal_lptim_channel_t channel = LPTIM_GetCCxDmaHandler(hlptim, hdma);

#if defined(USE_HAL_LPTIM_REGISTER_CALLBACKS) && (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
  hlptim->input_capture_half_cplt_callback(hlptim, channel);
#else
  HAL_LPTIM_InputCaptureHalfCpltCallback(hlptim, channel);
#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */
}

/**
  * @brief Capture complete.
  * @param hdma Pointer to the DMA handler.
  */
static void LPTIM_DMACaptureCpltCallback(hal_dma_handle_t *hdma)
{
  hal_lptim_handle_t *hlptim = LPTIM_GET_HDMA_PARENT(hdma);

  /* Identify the channel */
  hal_lptim_channel_t channel = LPTIM_GetCCxDmaHandler(hlptim, hdma);

#if defined(USE_HAL_LPTIM_REGISTER_CALLBACKS) && (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
  hlptim->input_capture_callback(hlptim, channel);
#else
  HAL_LPTIM_InputCaptureCallback(hlptim, channel);
#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */
}

/**
  * @brief DMA transfer error callback.
  * @param hdma Pointer to the DMA handler.
  */
static void LPTIM_DMAErrorCallback(hal_dma_handle_t *hdma)
{
  hal_lptim_handle_t *hlptim = LPTIM_GET_HDMA_PARENT(hdma);

#if defined(USE_HAL_LPTIM_REGISTER_CALLBACKS) && (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
  hlptim->error_callback(hlptim);
#else
  HAL_LPTIM_ErrorCallback(hlptim);
#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */
}

/**
  * @brief DMA transfer stopped callback when triggered by an LPTIM update event.
  * @param hdma Pointer to the DMA handler.
  */
static void LPTIM_DMAStopCallback(hal_dma_handle_t *hdma)
{
  hal_lptim_handle_t *hlptim = LPTIM_GET_HDMA_PARENT(hdma);

#if defined(USE_HAL_LPTIM_REGISTER_CALLBACKS) && (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
  hlptim->stop_callback(hlptim);
#else
  HAL_LPTIM_StopCallback(hlptim);
#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */
}

/**
  * @brief Callback for DMA channel stop.
  * @param hdma Pointer to the DMA handler.
  */
static void LPTIM_DMAChannelStopCallback(hal_dma_handle_t *hdma)
{
  hal_lptim_handle_t *hlptim = LPTIM_GET_HDMA_PARENT(hdma);

  /* Identify the channel */
  hal_lptim_channel_t channel = LPTIM_GetCCxDmaHandler(hlptim, hdma);

#if defined(USE_HAL_LPTIM_REGISTER_CALLBACKS) && (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
  hlptim->input_capture_stop_callback(hlptim, channel);
#else
  HAL_LPTIM_InputCaptureStopCallback(hlptim, channel);
#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */
}

/**
  * @brief Callback for DMA update half complete.
  * @param  hdma  Pointer to the DMA handle.
  */
static void LPTIM_DMAUpdateHalfcpltCallback(hal_dma_handle_t *hdma)
{
  hal_lptim_handle_t *hlptim = LPTIM_GET_HDMA_PARENT(hdma);

#if defined(USE_HAL_LPTIM_REGISTER_CALLBACKS) && (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
  hlptim->update_half_cplt_callback(hlptim);
#else
  HAL_LPTIM_UpdateHalfCpltCallback(hlptim);
#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */
}

/**
  * @brief Callback for DMA update complete.
  * @param  hdma  Pointer to the DMA handle.
  */
static void LPTIM_DMAUpdateCpltCallback(hal_dma_handle_t *hdma)
{
  hal_lptim_handle_t *hlptim = LPTIM_GET_HDMA_PARENT(hdma);

#if defined(USE_HAL_LPTIM_REGISTER_CALLBACKS) && (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
  hlptim->update_callback(hlptim);
#else
  HAL_LPTIM_UpdateCallback(hlptim);
#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */
}

/**
  * @brief  Start the low-power timer in DMA mode (optional DMA interrupts).
  * @param  hlptim       Pointer to the LPTIM handle.
  * @param  p_data       Pointer to data.
  * @param  size_byte    Size of data.
  * @param  interrupts  Selection of DMA interrupts. \n
  *                     Can be any of the following values:
  *                     - @ref HAL_LPTIM_OPT_DMA_IT_NONE
  *                     - @ref HAL_LPTIM_OPT_DMA_IT_HT
  *                     - @ref HAL_LPTIM_OPT_DMA_IT_DEFAULT
  * @if (USE_HAL_DMA_LINKEDLIST)
  *                     - @ref HAL_LPTIM_OPT_DMA_IT_SILENT
  * @endif
  * @retval HAL_OK
  * @retval HAL_ERROR    LPTIM_DIER write operation failed.
  */
static hal_status_t LPTIM_Start_DMA_Opt(hal_lptim_handle_t *hlptim,
                                        const uint8_t *p_data,
                                        uint32_t size_byte,
                                        uint32_t interrupts)
{

