MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_lptim.c
  hal_dma_handle_t *hdma = hlptim->hdma[HAL_LPTIM_DMA_ID_UPDATE];
  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  ASSERT_DBG_PARAM((hdma != NULL));

  LL_LPTIM_Enable(p_lptim);

  LL_LPTIM_EnableDMAReq_UPDATE(p_lptim);
  if (LPTIM_WaitFlag(p_lptim, LL_LPTIM_IsActiveFlag_DIEROK) != HAL_OK)
  {
    return HAL_ERROR;
  }
  LL_LPTIM_ClearFlag_DIEROK(p_lptim);

#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  ASSERT_DBG_PARAM(IS_LPTIM_DMA_VALID_SILENT_MODE(hlptim, HAL_LPTIM_DMA_ID_UPDATE, interrupts));
#endif /* USE_HAL_DMA_LINKEDLIST */

  /* Set DMA channel callback function pointers */
  hdma->p_xfer_halfcplt_cb = LPTIM_DMAUpdateHalfcpltCallback;
  hdma->p_xfer_cplt_cb = LPTIM_DMAUpdateCpltCallback;
  hdma->p_xfer_error_cb = LPTIM_DMAErrorCallback;

  /* Start DMA transfer in IT mode: from Memory to ARR register */
  if (HAL_DMA_StartPeriphXfer_IT_Opt(hdma, (uint32_t)p_data,
                                     (uint32_t)((uint32_t *)(&p_lptim->ARR)),
                                     size_byte, interrupts) != HAL_OK)
  {
#if defined(USE_HAL_LPTIM_GET_LAST_ERRORS) && (USE_HAL_LPTIM_GET_LAST_ERRORS == 1)
    hlptim->last_error_codes |= HAL_LPTIM_ERROR_DMA;
#endif /* USE_HAL_LPTIM_GET_LAST_ERRORS */

    hlptim->global_state = HAL_LPTIM_STATE_IDLE;

    return HAL_ERROR;
  }

  LL_LPTIM_StartCounter(p_lptim, (LPTIM_MODE_CR_MASK & (uint32_t)hlptim->mode));

  return HAL_OK;
}

/**
  * @brief  Start input capture channel with DMA and interrupts.
  * @param  hlptim       Pointer to the handle of the LPTIM instance.
  * @param  channel      Channel ID.
  * @param  p_data       Pointer to data.
  * @param  size_byte    Size of data.
  * @param  interrupts  Selection of DMA interrupts. \n
  *                     Can be any of the following values:
  *                     - @ref HAL_LPTIM_OPT_DMA_IT_NONE
  *                     - @ref HAL_LPTIM_OPT_DMA_IT_HT
  *                     - @ref HAL_LPTIM_OPT_DMA_IT_DEFAULT
  * @if (USE_HAL_DMA_LINKEDLIST)
  *                     - @ref HAL_LPTIM_OPT_DMA_IT_SILENT
  * @endif
  * @retval HAL_ERROR    Input channel with DMA and interrupts did not start correctly.
  * @retval HAL_OK       Input channel with DMA and interrupts started correctly.
  */
__STATIC_INLINE hal_status_t LPTIM_IC_StartChannel_DMA_Opt(hal_lptim_handle_t *hlptim,
                                                           hal_lptim_channel_t channel,
                                                           const uint8_t *p_data,
                                                           uint32_t size_byte,
                                                           uint32_t interrupts)
{
  hal_dma_handle_t *hdma;
  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  typedef struct
  {
    uint32_t id_dma;
    uint32_t src_addr;
    void (*lptim_enable_dma_cb)(lptim_t *);
  } lptim_ic_start_mapping_dma_t;

  lptim_ic_start_mapping_dma_t mapping_dma[] =
  {
    {HAL_LPTIM_DMA_ID_CC1, (uint32_t)((uint32_t *)(&p_lptim->CCR1)), LL_LPTIM_EnableDMAReq_CC1},
    {HAL_LPTIM_DMA_ID_CC2, (uint32_t)((uint32_t *)(&p_lptim->CCR2)), LL_LPTIM_EnableDMAReq_CC2},
  };

  /* Temporarily enable the peripheral to modify DIER impact by EnableDMAReq. */
  uint32_t is_lptim_enabled = LL_LPTIM_IsEnabled(p_lptim);
  LL_LPTIM_Enable(p_lptim);

  hdma = hlptim->hdma[mapping_dma[(uint32_t)channel].id_dma];

  ASSERT_DBG_PARAM((hdma != NULL));
#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  ASSERT_DBG_PARAM(IS_LPTIM_DMA_VALID_SILENT_MODE(hlptim, mapping_dma[(uint32_t)channel].id_dma, interrupts));
#endif /* USE_HAL_DMA_LINKEDLIST */

  /* Set DMA channel callback function pointers */
  hdma->p_xfer_halfcplt_cb = LPTIM_DMACaptureHalfcpltCallback;
  hdma->p_xfer_cplt_cb = LPTIM_DMACaptureCpltCallback;
  hdma->p_xfer_error_cb = LPTIM_DMAErrorCallback;

  if (HAL_DMA_StartPeriphXfer_IT_Opt(hdma,
                                     mapping_dma[(uint32_t)channel].src_addr,
                                     (uint32_t)p_data,
                                     size_byte, interrupts) != HAL_OK)
  {
#if defined(USE_HAL_LPTIM_GET_LAST_ERRORS) && (USE_HAL_LPTIM_GET_LAST_ERRORS == 1)
    hlptim->last_error_codes |= HAL_LPTIM_ERROR_DMA;
#endif /* USE_HAL_LPTIM_GET_LAST_ERRORS */
    hlptim->channel_states[(uint32_t)channel] = HAL_LPTIM_IC_CHANNEL_STATE_IDLE;
    return HAL_ERROR;
  }

  mapping_dma[(uint32_t)channel].lptim_enable_dma_cb(p_lptim);

  if (is_lptim_enabled == 0U)
  {
    LL_LPTIM_Disable(p_lptim);
  }

  LL_LPTIM_CC_EnableChannel(p_lptim, (uint32_t)channel);

  return HAL_OK;

}

/**
  * @brief  Abort any ongoing DMA channel transfer.
  * @param  hlptim     Pointer to the handle of the TIM instance.
  * @param  dma_idx  DMA handle index
  * @param  active_silent_mode  Status of the silent mode.
  */
__STATIC_INLINE void LPTIM_Abort_DMA(const hal_lptim_handle_t *hlptim,
                                     const hal_lptim_dma_index_t dma_idx,
                                     const uint32_t active_silent_mode)
{
  hal_dma_cb_t xfer_abort_cb;
  hal_dma_handle_t *hdma = hlptim->hdma[dma_idx];

  ASSERT_DBG_PARAM((hdma != NULL));

  if (active_silent_mode == LPTIM_ACTIVE_SILENT)
  {
    (void)HAL_DMA_Abort(hdma);

    return;
  }

  /* dma stop callback function pointer depends on the dma request source */
  if (dma_idx == HAL_LPTIM_DMA_ID_UPDATE)
  {
    xfer_abort_cb = LPTIM_DMAStopCallback;
  }
  else
  {
    xfer_abort_cb = LPTIM_DMAChannelStopCallback;
  }

  hdma->p_xfer_abort_cb = xfer_abort_cb;
  if (HAL_DMA_Abort_IT(hdma) != HAL_OK)
  {
    xfer_abort_cb(hdma);
  }
}

/**
  * @brief Stop a low-power timer input channel that was started in DMA mode.
  * @param hlptim   Pointer to the handle of the LPTIM instance.
  * @param channel  Channel number to disable.
  * @param active_silent_mode Active silent mode.
  */
static void LPTIM_IC_StopChannel_DMA(const hal_lptim_handle_t *hlptim,
                                     const hal_lptim_channel_t channel,
                                     const uint32_t active_silent_mode)
{
  typedef struct
  {
    hal_lptim_dma_index_t id_dma;
    void (*lptim_disable_dma_cb)(lptim_t *);
  } lptim_ic_stop_mapping_dma_t;

  lptim_ic_stop_mapping_dma_t mapping_dma[] =
  {
    {HAL_LPTIM_DMA_ID_CC1, LL_LPTIM_DisableDMAReq_CC1},
    {HAL_LPTIM_DMA_ID_CC2, LL_LPTIM_DisableDMAReq_CC2},
  };

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  /* Disable capture/compare channel match DMA request */
  mapping_dma[(uint32_t)channel].lptim_disable_dma_cb(p_lptim);

  /* Abort DMA */
  LPTIM_Abort_DMA(hlptim,
                  mapping_dma[(uint32_t)channel].id_dma,
                  active_silent_mode);

