MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_lptim.c
}

#endif /* USE_HAL_LPTIM_DMA */

/**
  *  @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @addtogroup LPTIM_Exported_Functions
  *  @{
  */

/** @addtogroup LPTIM_Exported_Functions_Group1
  *  @{
     This section provides a set of function allowing to:
    - Initialize and deinitialize LPTIM with HAL_LPTIM_Init() and HAL_LPTIM_DeInit()
    - Associate DMA channels to LPTIM DMA requests with HAL_LPTIM_SetDMA()
  */

/**
  * @brief  Initialization function.
  *         Initialize the LPTIM handle and associate an instance.
  * @param  hlptim     Pointer to the handler of the LPTIM instance.
  * @param  instance   One of the values of the hal_lptim_t enumeration.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM Input parameter is invalid
  *                           (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_LPTIM_Init(hal_lptim_handle_t *hlptim, hal_lptim_t instance)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_PARAM(IS_LPTIM_INSTANCE((lptim_t *)((uint32_t)instance)));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hlptim == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Register the LPTIM instance */
  hlptim->instance = instance;

#if defined(USE_HAL_LPTIM_CLK_ENABLE_MODEL) && (USE_HAL_LPTIM_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO)
  LPTIM_EnableClock(instance);
#endif /* USE_HAL_LPTIM_CLK_ENABLE_MODEL */

#if defined(USE_HAL_LPTIM_REGISTER_CALLBACKS) && (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
  LPTIM_InitCallbacks(hlptim);
#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */

#if defined(USE_HAL_LPTIM_DMA) && (USE_HAL_LPTIM_DMA == 1)
  for (uint32_t dma_idx = 0; dma_idx < LPTIM_DMA_REQUESTS; dma_idx++)
  {
    hlptim->hdma[dma_idx] = NULL;
  }
#endif /* USE_HAL_LPTIM_DMA */

  /* Init the handle internal parameters */

#if defined(USE_HAL_LPTIM_USER_DATA) && (USE_HAL_LPTIM_USER_DATA == 1)
  hlptim->p_user_data = NULL;
#endif /* USE_HAL_LPTIM_USER_DATA */

  /* Reset channels state */
  for (uint32_t i = 0; i < HAL_LPTIM_CHANNELS; ++i)
  {
    hlptim->channel_states[i] = HAL_LPTIM_CHANNEL_STATE_RESET;
  }

#if defined(USE_HAL_LPTIM_GET_LAST_ERRORS) && (USE_HAL_LPTIM_GET_LAST_ERRORS == 1)
  hlptim->last_error_codes = HAL_LPTIM_ERROR_NONE;
#endif /* USE_HAL_LPTIM_GET_LAST_ERRORS */

  hlptim->global_state = HAL_LPTIM_STATE_INIT;

  return HAL_OK;
}

/**
  * @brief   Reset function.\n
  *          Stop all current operations and reset states.\n
  *          Hence: \n
  *          @arg stop the counter.
  *          @arg disable interrupts / DMA transfers.
  *          @arg clear status flags.
  *          @arg set channels' states to RESET.
  *          @arg set global state to RESET.
  *
  * @param   hlptim  Pointer to the handler of the LPTIM instance.
  * @warning Be careful if you used an external clock to have called HAL_LPTIM_SetConfigInput1() before Deinit!
  */
void HAL_LPTIM_DeInit(hal_lptim_handle_t *hlptim)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  ASSERT_DBG_PARAM(IS_LPTIM_INSTANCE(p_lptim));

  LL_LPTIM_Enable(p_lptim);

  LL_LPTIM_WRITE_REG(p_lptim, DIER, 0U);

  (void)LPTIM_WaitFlag(p_lptim, LL_LPTIM_IsActiveFlag_DIEROK);

  LL_LPTIM_WRITE_REG(p_lptim, ICR, LL_LPTIM_FLAG_ALL);

  /* Disable the LPTIM instance */
  LL_LPTIM_Disable(p_lptim);

  /* Reset channels state */
  for (uint32_t channel_id = 0; channel_id < HAL_LPTIM_CHANNELS; ++channel_id)
  {
    LL_LPTIM_CC_DisableChannel(p_lptim, channel_id);
    hlptim->channel_states[channel_id] = HAL_LPTIM_CHANNEL_STATE_RESET;
  }

  hlptim->global_state = HAL_LPTIM_STATE_RESET;
}

#if defined(USE_HAL_LPTIM_DMA) && (USE_HAL_LPTIM_DMA == 1)

/**
  * @brief    Link a DMA handle to a DMA request.
  * @param    hlptim     Pointer to the handle of the LPTIM instance.
  * @param    dma_idx    Index of the DMA request.
  * @param    hdma       Pointer to a handle of the DMA instance.
  * @retval   HAL_OK
  */
hal_status_t HAL_LPTIM_SetDMA(hal_lptim_handle_t *hlptim,
                              hal_lptim_dma_index_t dma_idx,
                              hal_dma_handle_t *hdma)
{
  ASSERT_DBG_PARAM((hlptim != NULL));
  ASSERT_DBG_PARAM((hdma != NULL));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdma == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_INIT | HAL_LPTIM_STATE_IDLE));

  ASSERT_DBG_PARAM(IS_LPTIM_DMA_INDEX(dma_idx));

  /* Link the DMA handle to the LPTIM handle. */
  hlptim->hdma[(uint32_t)dma_idx] = hdma;
  hdma->p_parent = hlptim;

  return HAL_OK;
}

#endif /* USE_HAL_LPTIM_DMA */

/**
  *  @}
  */

/** @addtogroup LPTIM_Exported_Functions_Group2
  *  @{
  * This section provides a set of functions for state and error management.
  *  - Call HAL_LPTIM_GetState() to get information about the low-power timer state.
  *  - Call HAL_LPTIM_GetChannelState() to get the channel state.
  *  - Call HAL_LPTIM_GetLastErrorCodes() to get the last error codes.
  */

/**
  * @brief  Get the low-power timer state.
  * @param  hlptim  Pointer to the handle of the LPTIM instance.
  * @retval hal_lptim_state_t HAL LPTIM state.
  */
hal_lptim_state_t HAL_LPTIM_GetState(const hal_lptim_handle_t *hlptim)
{
  ASSERT_DBG_PARAM((hlptim != NULL));
  return hlptim->global_state;
}

/**
  * @brief  Get the state of a channel.
  * @param  hlptim  Pointer to the handle of the LPTIM instance.
  * @param  channel Channel of interest.
  * @retval hal_lptim_channel_state_t LPTIM channel state.
  */
hal_lptim_channel_state_t HAL_LPTIM_GetChannelState(const hal_lptim_handle_t *hlptim,
                                                    hal_lptim_channel_t channel)
{
  ASSERT_DBG_PARAM((hlptim != NULL));
  ASSERT_DBG_PARAM(IS_LPTIM_CHANNEL(channel));
  return hlptim->channel_states[(uint32_t)channel];
}

#if defined(USE_HAL_LPTIM_GET_LAST_ERRORS) && (USE_HAL_LPTIM_GET_LAST_ERRORS == 1)

/**
  * @brief  Retrieve the HAL LPTIM last errors.
  * @param  hlptim   Pointer to the handle of the LPTIM instance.
  * @retval uint32_t HAL LPTIM bit-mapped last errors.\n
  *                  Values are:\n
  *                  @ref HAL_LPTIM_ERROR_NONE \n
  *                  @ref HAL_LPTIM_ERROR_DMA \n
  *                  @ref HAL_LPTIM_ERROR_TIMEOUT
  */
uint32_t HAL_LPTIM_GetLastErrorCodes(const hal_lptim_handle_t *hlptim)
{
  ASSERT_DBG_PARAM((hlptim != NULL));
  return hlptim->last_error_codes;
}

#endif /* USE_HAL_LPTIM_GET_LAST_ERRORS */

/**
  *  @}
  */

