MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_lptim.c
/** @addtogroup LPTIM_Exported_Functions_Group3
  *  @{
  *     This group contains the functions used to configure and control
  *           the time-base unit.
  *
  *           - Call HAL_LPTIM_SetConfig() to set the LPTIM configuration.
  *           - Call HAL_LPTIM_GetConfig() to get the LPTIM configuration.
  *           - Call HAL_LPTIM_SetMode() to set the LPTIM mode (CONTINUOUS or ONE-SHOT).
  *           - Call HAL_LPTIM_GetMode() to get the LPTIM mode.
  *           - Call HAL_LPTIM_SetClockSource() to set the LPTIM clock source (INTERNAL, EXTERNAL SYNCHRONOUS,
  *                                               EXTERNAL ASYNCHRONOUS, ENCODER SUBMODE 1 TO 3).
  *           - Call HAL_LPTIM_GetClockSource() to get the LPTIM clock source.
  *           - Call HAL_LPTIM_SetClockSourcePrescaler() to set the LPTIM clock source prescaler division.
  *           - Call HAL_LPTIM_GetClockSourcePrescaler() to get the LPTIM clock source prescaler division.
  *           - Call HAL_LPTIM_SetPeriod() to set the period.
  *           - Call HAL_LPTIM_GetPeriod() to get the period.
  *           - Call HAL_LPTIM_SetRepetitionCounter() to set the repetition counter.
  *           - Call HAL_LPTIM_GetRepetitionCounter() to get the repetition counter.
  *           - Call HAL_LPTIM_GetCounter() to get the counter.
  *           - Call HAL_LPTIM_ResetCounter() to reset the counter.
  *           - Call HAL_LPTIM_EnableResetCounterAfterRead() to enable reset counter after read.
  *           - Call HAL_LPTIM_DisableResetCounterAfterRead() to disable reset counter after read.
  *           - Call HAL_LPTIM_IsEnableResetCounterAfterRead() to check whether reset counter after read is enabled.
  *           - Call HAL_LPTIM_EnablePreload() to enable preload.
  *           - Call HAL_LPTIM_DisablePreload() to disable preload.
  *           - Call HAL_LPTIM_IsEnabledPreload() to check whether preload is enabled.
  *           - Call HAL_LPTIM_SetConfigInput1() to configure Input1.
  *           - Call HAL_LPTIM_GetConfigInput1() to get the configuration for Input1.
  *           - Call HAL_LPTIM_SetInput1Source() to set the Input1 source.
  *           - Call HAL_LPTIM_GetInput1Source() to get the Input1 source setup.
  *           - Call HAL_LPTIM_SetInput1Polarity() to set Input1 polarity (RISING, FALLING, or both).
  *           - Call HAL_LPTIM_GetInput1Polarity() to get the Input1 polarity setup.
  *           - Call HAL_LPTIM_SetInput1Filter() to set the Input1 filter.
  *           - Call HAL_LPTIM_GetInput1Filter() to get the Input1 filter setup.
  *
  * @note When the clock source is HAL_LPTIM_CLK_ENCODER_SUBMODE_[1|2|3],
  *       selection of the sources (two signals from quadrature encoders)
  *       is done with HAL_LPTIM_SetConfigEncoder().
  *
  */

/**
  * @brief  Configure the low-power timer time-base unit.
  * @param  hlptim     Pointer to the handle of the LPTIM instance.
  * @param  p_config   Pointer to the time-base unit configuration structure.
  * @note   If the clock source is set to HAL_LPTIM_CLK_EXTERNAL_SYNCHRONOUS or HAL_LPTIM_CLK_ENCODER_SUBMODE_[1|2|3],
  *         the prescaler is forced to HAL_LPTIM_CLK_SRC_DIV1.
  * @retval HAL_OK
  * @retval HAL_ERROR         LPTIM_ISR or LPTIM_ARR write operation failed.
  * @retval HAL_INVALID_PARAM Input parameter is invalid.
  *                           (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_LPTIM_SetConfig(hal_lptim_handle_t *hlptim,
                                 const hal_lptim_config_t *p_config)
{
  ASSERT_DBG_PARAM((hlptim != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_INIT | HAL_LPTIM_STATE_IDLE));

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  /* Check parameters */
  ASSERT_DBG_PARAM(IS_LPTIM_CLK_SRC(p_lptim, p_config->clock_source));
  ASSERT_DBG_PARAM(IS_LPTIM_MODE(p_config->clock_source,
                                 p_config->mode));
  ASSERT_DBG_PARAM(IS_LPTIM_CLK_SRC_PRESC(p_config->clock_source,
                                          p_config->prescaler));
  ASSERT_DBG_PARAM(IS_LPTIM_PERIOD(p_config->period));
  ASSERT_DBG_PARAM(IS_LPTIM_REPETITION_COUNTER(p_config->repetition_counter));

  /* Store the mode (configuration is done in the process function). */
  hlptim->mode = p_config->mode;

  LL_LPTIM_Enable(p_lptim);

  /* Clear all flags */
  LL_LPTIM_WRITE_REG(p_lptim, ICR, LL_LPTIM_FLAG_ALL);

  /* Set the repetition counter. */
  LL_LPTIM_SetRepetition(p_lptim, p_config->repetition_counter);
  if (LPTIM_WaitFlag(p_lptim, LL_LPTIM_IsActiveFlag_REPOK) != HAL_OK)
  {
    return HAL_ERROR;
  }
  LL_LPTIM_ClearFlag_REPOK(p_lptim);

  /* Set the period. */
  LL_LPTIM_SetAutoReload(p_lptim, p_config->period);
  if (LPTIM_WaitFlag(p_lptim, LL_LPTIM_IsActiveFlag_ARROK) != HAL_OK)
  {
    return HAL_ERROR;
  }
  LL_LPTIM_ClearFlag_ARROK(p_lptim);

  LL_LPTIM_Disable(p_lptim);

  /* Clock source configuration */
  LPTIM_SetClockSource(p_lptim, p_config->clock_source);

  /* If the clock source is HAL_LPTIM_CLK_EXTERNAL_SYNCHRONOUS or
     HAL_LPTIM_CLK_ENCODER_SUBMODE_[1|2|3] the prescaler must be
     HAL_LPTIM_PRESCALER_DIV1 (that is 000). */
  if ((p_config->clock_source == HAL_LPTIM_CLK_EXTERNAL_SYNCHRONOUS)
      || (IS_LPTIM_CLOCK_TYPE_ENCODER((uint32_t)p_config->clock_source) != 0U))
  {
    LL_LPTIM_SetPrescaler(p_lptim, (uint32_t)HAL_LPTIM_CLK_SRC_DIV1);
  }
  else
  {
    LL_LPTIM_SetPrescaler(p_lptim, (uint32_t)p_config->prescaler);
  }

  /* Reset channels (needed only in IDLE state but done by default). */
  for (uint32_t i = 0; i < HAL_LPTIM_CHANNELS; ++i)
  {
    hlptim->channel_states[i] = HAL_LPTIM_CHANNEL_STATE_RESET;
  }

  hlptim->global_state = HAL_LPTIM_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Get the configuration of the low-power timer time-base unit.
  * @param  hlptim     Pointer to the handle of the LPTIM instance.
  * @param  p_config   Pointer to a time-base unit configuration structure to fill.
  */
void HAL_LPTIM_GetConfig(const hal_lptim_handle_t *hlptim,
                         hal_lptim_config_t *p_config)
{
  ASSERT_DBG_PARAM((hlptim != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_INIT | HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  p_config->mode = hlptim->mode;
  p_config->clock_source = LPTIM_GetClockSource(p_lptim);
  p_config->prescaler = (hal_lptim_clk_src_presc_t)LL_LPTIM_GetPrescaler(p_lptim);
  p_config->period = LL_LPTIM_GetAutoReload(p_lptim);
  p_config->repetition_counter = LL_LPTIM_GetRepetition(p_lptim);
}

/**
  * @brief    Set the mode of the low-power timer time-base unit.
  * @param    hlptim  Pointer to the handle of the LPTIM instance.
  * @param    mode    The counter mode selected.
  * @warning  Calling this function while the clock source is HAL_LPTIM_CLK_ENCODER_SUBMODE_x has no effect.
  * @retval   HAL_OK
  */
hal_status_t HAL_LPTIM_SetMode(hal_lptim_handle_t *hlptim,
                               hal_lptim_mode_t mode)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state, HAL_LPTIM_STATE_IDLE);

  lptim_t *p_lptim = (lptim_t *)LPTIM_INSTANCE(hlptim);
  hal_lptim_clk_src_t clk_src = LPTIM_GetClockSource(p_lptim);

  if (IS_LPTIM_CLK_ENCODER(clk_src) == 0U)
  {
    hlptim->mode = mode;
  }
  return HAL_OK;
}

/**
  * @brief  Get the mode of the low-power timer time-base unit.
  * @param  hlptim  Pointer to the handle of the LPTIM instance.
  * @retval hal_lptim_mode_t  Mode in which the low-power timer runs.
  */
hal_lptim_mode_t HAL_LPTIM_GetMode(const hal_lptim_handle_t *hlptim)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_INIT | HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));

  return hlptim->mode;
}

/**
  * @brief  Set the clock source of the low-power timer time-base unit.
  * @param  hlptim    Pointer to the handle of the LPTIM instance.
  * @param  clk_src   Clock source selection.
  * @retval HAL_OK
  *
  */
hal_status_t HAL_LPTIM_SetClockSource(const hal_lptim_handle_t *hlptim,
                                      hal_lptim_clk_src_t clk_src)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_PARAM(IS_LPTIM_CLK_SRC(LPTIM_INSTANCE(hlptim), clk_src));

  ASSERT_DBG_STATE(hlptim->global_state, HAL_LPTIM_STATE_IDLE);

