MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_lptim.c
  LPTIM_SetClockSource(LPTIM_INSTANCE(hlptim), clk_src);

  return HAL_OK;
}

/**
  * @brief  Get the clock source of the low-power timer time-base unit.
  * @param  hlptim                Pointer to the handle of the LPTIM instance.
  * @retval hal_lptim_clk_src_t   Clock source of the LPTIM instance.
  *
  */
hal_lptim_clk_src_t HAL_LPTIM_GetClockSource(const hal_lptim_handle_t *hlptim)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_INIT | HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));
  return LPTIM_GetClockSource(LPTIM_INSTANCE(hlptim));
}

/**
  * @brief  Set the clock source prescaler of the low-power timer time-base unit.
  * @param  hlptim          Pointer to the handle of the LPTIM instance.
  * @param  clk_src_presc   Clock source prescaler for the time base unit.
  * @note   Clock prescaler setting has no effect if the clock source is
  *         HAL_LPTIM_CLK_ENCODER_SUBMODE_[1|2|3].
  * @note   The prescaler must not be used (DIV1) when the LPTIM external Input1 is sampled with the
  *         internal clock (HAL_LPTIM_CLK_EXTERNAL_SYNCHRONOUS).
  * @retval HAL_OK
  */

hal_status_t HAL_LPTIM_SetClockSourcePrescaler(const hal_lptim_handle_t *hlptim,
                                               hal_lptim_clk_src_presc_t clk_src_presc)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  ASSERT_DBG_PARAM(IS_LPTIM_CLK_SRC_PRESC(LPTIM_GetClockSource(p_lptim), clk_src_presc));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_INIT | HAL_LPTIM_STATE_IDLE));

  LL_LPTIM_SetPrescaler(p_lptim, (uint32_t)clk_src_presc);

  return HAL_OK;
}

/**
  * @brief  Get the clock source prescaler of the low-power timer.
  * @param  hlptim  Pointer to the handle of the LPTIM instance.
  * @retval hal_lptim_clk_src_presc_t  Clock source prescaler of the LPTIM instance.
  *
  */
hal_lptim_clk_src_presc_t HAL_LPTIM_GetClockSourcePrescaler(const hal_lptim_handle_t *hlptim)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_INIT | HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));

  return (hal_lptim_clk_src_presc_t)LL_LPTIM_GetPrescaler(LPTIM_INSTANCE(hlptim));
}

/**
  * @brief  Set the period of the low-power timer time-base unit.
  * @param  hlptim   Pointer to the handle of the LPTIM instance.
  * @param  period   Period for the time base unit.
  * @retval HAL_OK
  * @retval HAL_ERROR  LPTIM_ARR write operation failed.
  */
hal_status_t HAL_LPTIM_SetPeriod(const hal_lptim_handle_t *hlptim,
                                 uint32_t period)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state, HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE);

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  ASSERT_DBG_PARAM(IS_LPTIM_PERIOD(period));

  /* Enable LPTIM if it was disabled when entering this function. */
  uint32_t is_lptim_enabled = LL_LPTIM_IsEnabled(p_lptim);
  LL_LPTIM_Enable(p_lptim);

  /* Clear flag */
  LL_LPTIM_WRITE_REG(p_lptim, ICR, LL_LPTIM_ISR_ARROK);

  /* Set the period and wait for the register to be updated. */
  LL_LPTIM_SetAutoReload(p_lptim, period);
  if (LPTIM_WaitFlag(p_lptim, LL_LPTIM_IsActiveFlag_ARROK) != HAL_OK)
  {
    return HAL_ERROR;
  }
  LL_LPTIM_ClearFlag_ARROK(p_lptim);

  if (is_lptim_enabled == 0U)
  {
    LL_LPTIM_Disable(p_lptim);
  }

  return HAL_OK;
}

/**
  * @brief  Get the period of the low-power timer.
  * @param  hlptim    Pointer to the handle of the LPTIM instance.
  * @return uint32_t  Period Value
  */
uint32_t HAL_LPTIM_GetPeriod(const hal_lptim_handle_t *hlptim)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_INIT | HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));

  return LL_LPTIM_GetAutoReload(LPTIM_INSTANCE(hlptim));
}

/**
  * @brief  Set the repetition counter of the low-power timer time-base unit.
  * @param  hlptim              Pointer to the handle of the LPTIM instance.
  * @param  repetition_counter  Repetition value for the time base unit.
  * @retval HAL_OK
  * @retval HAL_ERROR  LPTIM_ISR write operation failed
  */
hal_status_t HAL_LPTIM_SetRepetitionCounter(const hal_lptim_handle_t *hlptim,
                                            uint32_t repetition_counter)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state, HAL_LPTIM_STATE_IDLE);

  ASSERT_DBG_PARAM(IS_LPTIM_REPETITION_COUNTER(repetition_counter));

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  /* Enable LPTIM if it was disabled when entering this function. */
  uint32_t is_lptim_enabled = LL_LPTIM_IsEnabled(p_lptim);
  LL_LPTIM_Enable(p_lptim);

  /* Clear flag */
  LL_LPTIM_WRITE_REG(p_lptim, ICR, LL_LPTIM_ISR_REPOK);

  /* Set the repetition counter and wait for the register to be updated. */
  LL_LPTIM_SetRepetition(p_lptim, repetition_counter);
  if (LPTIM_WaitFlag(p_lptim, LL_LPTIM_IsActiveFlag_REPOK) != HAL_OK)
  {
    return HAL_ERROR;
  }
  LL_LPTIM_ClearFlag_REPOK(p_lptim);

  if (is_lptim_enabled == 0U)
  {
    LL_LPTIM_Disable(p_lptim);
  }

  return HAL_OK;
}

/**
  * @brief  Get the value of the repetition counter of the low-power timer.
  * @param  hlptim    Pointer to the handle of the LPTIM instance.
  * @retval uint32_t  Value of the repetition counter.
  */
uint32_t HAL_LPTIM_GetRepetitionCounter(const hal_lptim_handle_t *hlptim)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_INIT | HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));

  return LL_LPTIM_GetRepetition(LPTIM_INSTANCE(hlptim));
}

/**
  * @brief    Get Counter Register (LPTIMx_CNT) value.
  * @param    hlptim    Pointer to the handle of the LPTIM instance.
  * @warning  When the LPTIM instance is running, reading
  *           the LPTIMx_CNT register can return unreliable values. So in this case
  *           it is necessary to perform two consecutive read accesses and verify
  *           that the two returned values are identical.
  * @return   Counter register value.
  */
uint32_t HAL_LPTIM_GetCounter(const hal_lptim_handle_t *hlptim)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_INIT | HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));

  return LL_LPTIM_GetCounter(LPTIM_INSTANCE(hlptim));
}

/**
  * @brief  Reset Counter Register.
  * @param  hlptim    Pointer to the handle of the LPTIM instance.
  * @retval HAL_OK
  */
hal_status_t HAL_LPTIM_ResetCounter(const hal_lptim_handle_t *hlptim)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_INIT | HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));

  LL_LPTIM_ResetCounter(LPTIM_INSTANCE(hlptim));

  return HAL_OK;
}

/**
  * @brief  Enable Reset Counter After read.
  * @param  hlptim    Pointer to the handle of the LPTIM instance.
  * @retval HAL_OK
  */
hal_status_t HAL_LPTIM_EnableResetCounterAfterRead(const hal_lptim_handle_t *hlptim)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

