MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_lptim.c
  ASSERT_DBG_STATE(hlptim->global_state, HAL_LPTIM_STATE_ACTIVE);

  LL_LPTIM_EnableResetAfterRead(LPTIM_INSTANCE(hlptim));

  return HAL_OK;
}

/**
  * @brief  Disable Reset Counter After read.
  * @param  hlptim    Pointer to the handle of the LPTIM instance.
  * @retval HAL_OK
  */
hal_status_t HAL_LPTIM_DisableResetCounterAfterRead(const hal_lptim_handle_t *hlptim)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state, HAL_LPTIM_STATE_ACTIVE);

  LL_LPTIM_DisableResetAfterRead(LPTIM_INSTANCE(hlptim));

  return HAL_OK;
}

/**
  * @brief  Check Reset Counter After read.
  * @param  hlptim    Pointer to the handle of the LPTIM instance.
  * @retval hal_lptim_reset_after_read_status_t Registers update mode.
  */
hal_lptim_reset_after_read_status_t HAL_LPTIM_IsEnableResetCounterAfterRead(const hal_lptim_handle_t *hlptim)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_INIT | HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));

  return (hal_lptim_reset_after_read_status_t)LL_LPTIM_IsEnabledResetAfterRead(LPTIM_INSTANCE(hlptim));
}

/**
  * @brief  Enable the preload.
  * @param  hlptim    Pointer to the handle of the LPTIM instance.
  * @note   registers ARR, RCR and CCRx will be updated only at the end of the current LPTIM period.
  * @retval HAL_OK
  */
hal_status_t HAL_LPTIM_EnablePreload(const hal_lptim_handle_t *hlptim)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_INIT | HAL_LPTIM_STATE_IDLE));

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  /* Disable LPTIM if it was enabled when entering this function. */
  uint32_t is_lptim_enabled = LL_LPTIM_IsEnabled(p_lptim);
  LL_LPTIM_Disable(p_lptim);
  LL_LPTIM_SetUpdateMode(p_lptim, (uint32_t)HAL_LPTIM_PRELOAD_ENABLED);
  if (is_lptim_enabled != 0U)
  {
    LL_LPTIM_Enable(p_lptim);
  }

  return HAL_OK;
}

/**
  * @brief  Disable the preload.
  * @param  hlptim    Pointer to the handle of the LPTIM instance.
  * @note   registers ARR, RCR and CCR are updated after each APB bus access.
  * @retval HAL_OK
  */
hal_status_t HAL_LPTIM_DisablePreload(const hal_lptim_handle_t *hlptim)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_INIT | HAL_LPTIM_STATE_IDLE));

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  /* Disable LPTIM if it was enabled when entering this function. */
  uint32_t is_lptim_enabled = LL_LPTIM_IsEnabled(p_lptim);
  LL_LPTIM_Disable(p_lptim);
  LL_LPTIM_SetUpdateMode(p_lptim, (uint32_t)HAL_LPTIM_PRELOAD_DISABLED);
  if (is_lptim_enabled != 0U)
  {
    LL_LPTIM_Enable(p_lptim);
  }

  return HAL_OK;
}

/**
  * @brief  Check preload state.
  * @param  hlptim    Pointer to the handle of the LPTIM instance.
  * @retval hal_lptim_preload_status_t Registers update mode.
  */
hal_lptim_preload_status_t HAL_LPTIM_IsEnabledPreload(const hal_lptim_handle_t *hlptim)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_INIT | HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));

  return (hal_lptim_preload_status_t)LL_LPTIM_GetUpdateMode(LPTIM_INSTANCE(hlptim));
}

/**
  * @brief    Configure Input1.
  * @param    hlptim    Pointer to the handle of the LPTIM instance.
  * @param    p_config  Pointer to the input1 configuration structure.
  * @warning  This function must be called only after the clock source is
  *           configured.
  * @warning  If the clock is HAL_LPTIM_CLK_EXTERNAL_ASYNCHRONOUS but the filter
  *           is not HAL_LPTIM_FDIV1, or the polarity is HAL_LPTIM_INPUT1_RISING_FALLING then an auxiliary clock
  *           (one of the Low power oscillator) must be active.
  * @retval   HAL_OK
  * @retval   HAL_ERROR When called with clock source different from
  *                     HAL_LPTIM_CLK_EXTERNAL_SYNCHRONOUS or
  *                     HAL_LPTIM_CLK_EXTERNAL_ASYNCHRONOUS.
  */

hal_status_t HAL_LPTIM_SetConfigInput1(const hal_lptim_handle_t *hlptim,
                                       const hal_lptim_input1_config_t *p_config)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_PARAM((p_config != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hlptim->global_state, HAL_LPTIM_STATE_IDLE);

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  ASSERT_DBG_PARAM(IS_LPTIM_INPUT1_INSTANCE(p_lptim));
  ASSERT_DBG_PARAM(IS_LPTIM_INPUT1_SRC(p_config->src));
  ASSERT_DBG_PARAM(IS_LPTIM_INPUT1_POLARITY(p_config->polarity));
  ASSERT_DBG_PARAM(IS_LPTIM_FILTER(p_config->filter));

  hal_lptim_clk_src_t clk_src = LPTIM_GetClockSource(p_lptim);

  if (!((clk_src == HAL_LPTIM_CLK_EXTERNAL_SYNCHRONOUS)
        || (clk_src == HAL_LPTIM_CLK_EXTERNAL_ASYNCHRONOUS)))
  {
    return HAL_ERROR;
  }

  LL_LPTIM_SetInput1Source(p_lptim, (uint32_t)p_config->src);

  /* Configure the polarity and the filter together (CKPOL and CKFLT in CFGR). */
  LL_LPTIM_ConfigClock(p_lptim, (uint32_t)(p_config->polarity), LPTIM_CFGR_HAL2LL_FILTER((uint32_t)p_config->filter));

  return HAL_OK;
}

/**
  * @brief  Get Input1 configuration.
  * @param  hlptim    Pointer to the handle of the LPTIM instance.
  * @param  p_config  Pointer to an input1 configuration structure.
  */
void HAL_LPTIM_GetConfigInput1(const hal_lptim_handle_t *hlptim,
                               hal_lptim_input1_config_t *p_config)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_PARAM((p_config != NULL));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_INIT | HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  p_config->polarity = (hal_lptim_input1_polarity_t)LL_LPTIM_GetClockPolarity(p_lptim);
  p_config->filter = (hal_lptim_filter_t)(LPTIM_GET_CLOCK_FILTER(p_lptim));
  p_config->src = (hal_lptim_input1_src_t)LL_LPTIM_GetInput1Source(p_lptim);
}

/**
  * @brief    Configure the Input1 source.
  * @param    hlptim     Pointer to the handle of the LPTIM instance.
  * @param    input1_src Source of Input1.
  * @warning  This function must be called only after the clock source is
  *           configured.
  * @retval   HAL_OK
  * @retval   HAL_ERROR When called with clock source different from
  *                     HAL_LPTIM_CLK_EXTERNAL_SYNCHRONOUS or HAL_LPTIM_CLK_EXTERNAL_ASYNCHRONOUS.
  */
hal_status_t HAL_LPTIM_SetInput1Source(const hal_lptim_handle_t *hlptim,
                                       hal_lptim_input1_src_t input1_src)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state, HAL_LPTIM_STATE_IDLE);

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  ASSERT_DBG_PARAM(IS_LPTIM_INPUT1_INSTANCE(p_lptim));
  ASSERT_DBG_PARAM(IS_LPTIM_INPUT1_SRC(input1_src));

