MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_lptim.c
  hal_lptim_clk_src_t clk_src = LPTIM_GetClockSource(p_lptim);

  if (!((clk_src == HAL_LPTIM_CLK_EXTERNAL_SYNCHRONOUS) || (clk_src == HAL_LPTIM_CLK_EXTERNAL_ASYNCHRONOUS)))
  {
    return HAL_ERROR;
  }

  LL_LPTIM_SetInput1Source(p_lptim, (uint32_t)input1_src);

  return HAL_OK;
}

/**
  * @brief  Get the input1 source.
  * @param  hlptim     Pointer to the handle of the LPTIM instance.
  * @retval hal_lptim_input1_src_t The input1 source.
  */
hal_lptim_input1_src_t HAL_LPTIM_GetInput1Source(const hal_lptim_handle_t *hlptim)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_INIT | HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));

  return (hal_lptim_input1_src_t)LL_LPTIM_GetInput1Source(LPTIM_INSTANCE(hlptim));
}

/**
  * @brief    Set Input1 polarity.
  * @param    hlptim      Pointer to the handle of the LPTIM instance.
  * @param    polarity    polarity of Input1.
  * @warning  This function must be called only after the clock source is
  *           configured.
  * @warning  An auxiliary clock (one of the Low power oscillator) must be active
  *           if the polarity is HAL_LPTIM_INPUT1_RISING_FALLING.
  * @retval   HAL_OK
  * @retval   HAL_ERROR When called with clock source different from
  *                     HAL_LPTIM_CLK_EXTERNAL_SYNCHRONOUS or HAL_LPTIM_CLK_EXTERNAL_ASYNCHRONOUS.
  */
hal_status_t HAL_LPTIM_SetInput1Polarity(const hal_lptim_handle_t *hlptim,
                                         hal_lptim_input1_polarity_t polarity)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);
  ASSERT_DBG_STATE(hlptim->global_state, HAL_LPTIM_STATE_IDLE);

  ASSERT_DBG_PARAM(IS_LPTIM_INPUT1_INSTANCE(p_lptim));
  ASSERT_DBG_PARAM(IS_LPTIM_INPUT1_POLARITY(polarity));

  hal_lptim_clk_src_t clk_src = LPTIM_GetClockSource(p_lptim);

  if (!((clk_src == HAL_LPTIM_CLK_EXTERNAL_SYNCHRONOUS) || (clk_src == HAL_LPTIM_CLK_EXTERNAL_ASYNCHRONOUS)))
  {
    return HAL_ERROR;
  }

  LL_LPTIM_SetClockPolarity(p_lptim, (uint32_t)polarity);

  return HAL_OK;
}

/**
  * @brief  Get Input1 polarity.
  * @param  hlptim     Pointer to the handle of the LPTIM instance.
  * @retval hal_lptim_input1_polarity_t Input1 polarity.
  */
hal_lptim_input1_polarity_t HAL_LPTIM_GetInput1Polarity(const hal_lptim_handle_t *hlptim)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_INIT | HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));

  return (hal_lptim_input1_polarity_t)LL_LPTIM_GetClockPolarity(LPTIM_INSTANCE(hlptim));
}

/**
  * @brief    Configure the Input1 filter.
  * @param    hlptim   Pointer to the handle of the LPTIM instance.
  * @param    filter   Filter for Input1.
  * @note     If filtering is used, an auxiliary clock must be active.
  * @warning  This function must be called only after the clock source is
  *           configured.
  * @warning  An auxiliary clock (one of the Low power oscillator) must be active
  *           if the value of the filter is different from HAL_LPTIM_FDIV1.
  * @retval   HAL_OK
  * @retval   HAL_ERROR When called with clock source different from
  *                     HAL_LPTIM_CLK_EXTERNAL_SYNCHRONOUS or HAL_LPTIM_CLK_EXTERNAL_ASYNCHRONOUS.
  */

hal_status_t HAL_LPTIM_SetInput1Filter(const hal_lptim_handle_t *hlptim,
                                       hal_lptim_filter_t filter)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state, HAL_LPTIM_STATE_IDLE);

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  ASSERT_DBG_PARAM(IS_LPTIM_INPUT1_INSTANCE(p_lptim));
  ASSERT_DBG_PARAM(IS_LPTIM_FILTER(filter));

  hal_lptim_clk_src_t clk_src = LPTIM_GetClockSource(p_lptim);

  if (!((clk_src == HAL_LPTIM_CLK_EXTERNAL_SYNCHRONOUS) || (clk_src == HAL_LPTIM_CLK_EXTERNAL_ASYNCHRONOUS)))
  {
    return HAL_ERROR;
  }

  LL_LPTIM_SetClockFilter(p_lptim, LPTIM_CFGR_HAL2LL_FILTER((uint32_t)filter));

  return HAL_OK;
}

/**
  * @brief  Get the input1 filter.
  * @param  hlptim   Pointer to the handle of the LPTIM instance.
  * @return @ref hal_lptim_filter_t Filter applied to Input1.
  */
hal_lptim_filter_t HAL_LPTIM_GetInput1Filter(const hal_lptim_handle_t *hlptim)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_INIT | HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));

  return (hal_lptim_filter_t)LPTIM_GET_CLOCK_FILTER(LPTIM_INSTANCE(hlptim));
}

/**
  *  @}
  */

/** @addtogroup LPTIM_Exported_Functions_Group4
  * @{
  * This section provides a set of functions to start and stop LPTIM services.
  * - Call HAL_LPTIM_Start() to start the low-power timer in polling mode.
  * - Call HAL_LPTIM_Stop() to stop the low-power timer.
  * - Call HAL_LPTIM_Start_IT() to start the low-power timer in interrupt mode.
  * - Call HAL_LPTIM_Stop_IT() to stop the low-power timer and disable interrupts.
  * - Call HAL_LPTIM_Start_DMA_Opt() to start the low-power timer in DMA mode with interrupt options.
  * - Call HAL_LPTIM_Start_DMA() to start the low-power timer in DMA mode.
  * - Call HAL_LPTIM_Stop_DMA() to stop the low-power timer in DMA mode.
  */

/**
  * @brief  Start the low-power timer in polling mode.
  * @param  hlptim    Pointer to the handle of the LPTIM instance.
  * @retval HAL_OK
  * @retval HAL_ERROR When there is a mismatch between the mode and the current clock source.
  */
hal_status_t HAL_LPTIM_Start(hal_lptim_handle_t *hlptim)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state, HAL_LPTIM_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(hlptim, global_state, HAL_LPTIM_STATE_IDLE,
                         HAL_LPTIM_STATE_ACTIVE);

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  if (LPTIM_Start(p_lptim, (uint32_t)hlptim->mode) == HAL_ERROR)
  {
    return HAL_ERROR;
  }

  LL_LPTIM_Enable(p_lptim);

  /* Start the counter in continuous or single counting mode (set the
     CNTSTRT bit or the SNGSTRT bit in CR.)
     Note that the counter starts only if TRIGEN is 00 in CFGR which is
     the case unless an external trigger source was set. */
  LL_LPTIM_StartCounter(p_lptim, (LPTIM_MODE_CR_MASK & (uint32_t)(hlptim->mode)));

  return HAL_OK;
}

/**
  * @brief  Stop the low-power timer that was started in polling mode.
  * @param  hlptim  Pointer to the handle of the LPTIM instance.
  * @retval HAL_OK
  */
hal_status_t HAL_LPTIM_Stop(hal_lptim_handle_t *hlptim)
{
  hal_status_t status;

  ASSERT_DBG_PARAM((hlptim != NULL));

