MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_lptim.c
  ASSERT_DBG_STATE(hlptim->global_state, HAL_LPTIM_STATE_ACTIVE);

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  status = LPTIM_CcDisable(p_lptim);

  /* Reset the WAVE bit and the TIMOUT bit in CFGR. */
  volatile uint32_t cfgr = LL_LPTIM_READ_REG(p_lptim, CFGR);
  cfgr &= ~LPTIM_MODE_CFGR_MASK;
  LL_LPTIM_WRITE_REG(p_lptim, CFGR, cfgr);

  hlptim->global_state = HAL_LPTIM_STATE_IDLE;

  return status;
}

/**
  * @brief  Start the low-power timer in interrupt mode.
  * @param  hlptim    Pointer to the handle of the LPTIM instance.
  * @retval HAL_OK
  * @retval HAL_ERROR When there is a mismatch between the mode
  *                   and the current clock source, or when enabling the
  *                   interrupts failed.
  */
hal_status_t HAL_LPTIM_Start_IT(hal_lptim_handle_t *hlptim)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state, HAL_LPTIM_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(hlptim, global_state, HAL_LPTIM_STATE_IDLE,
                         HAL_LPTIM_STATE_ACTIVE);

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  if (LPTIM_Start(p_lptim, (uint32_t)hlptim->mode) == HAL_ERROR)
  {
    return HAL_ERROR;
  }

  LL_LPTIM_Enable(p_lptim);

  uint32_t it_mask = 0U;

  if (LL_LPTIM_IsEnabledEncoderMode(p_lptim) != 0U)
  {
    it_mask |= (LL_LPTIM_DIER_UPIE | LL_LPTIM_DIER_DOWNIE);
  }
  else if (LL_LPTIM_IsEnabledTimeout(p_lptim) != 0U)
  {
    it_mask |= LL_LPTIM_DIER_CC1IE;
  }
  else
  {
    it_mask |= (LL_LPTIM_DIER_ARROKIE | LL_LPTIM_DIER_ARRMIE |
                LL_LPTIM_DIER_REPOKIE | LL_LPTIM_DIER_UEIE);
  }
  /* Check external trigger active*/
  if (LL_LPTIM_GetTriggerPolarity(p_lptim) != 0U)
  {
    it_mask |= LPTIM_DIER_EXTTRIGIE;
  }

  LL_LPTIM_EnableIT(p_lptim, it_mask);
  if (LPTIM_WaitFlag(p_lptim, LL_LPTIM_IsActiveFlag_DIEROK) != HAL_OK)
  {
    return HAL_ERROR;
  }
  LL_LPTIM_ClearFlag_DIEROK(p_lptim);

  /* Start the counter in continuous or single counting mode (set the
     CNTSTRT bit or the SNGSTRT bit in CR.)
     Note that the counter starts only if TRIGEN is 00 in CFGR which is
     the case unless an external trigger source was set. */
  LL_LPTIM_StartCounter(p_lptim, (LPTIM_MODE_CR_MASK & (uint32_t)hlptim->mode));

  return HAL_OK;
}

/**
  * @brief  Stop the low-power timer that was started in interrupt mode.
  * @param  hlptim    Pointer to the handle of the LPTIM instance.
  * @retval HAL_OK
  * @retval HAL_ERROR LPTIM_DIER write operation failed.
  */
hal_status_t HAL_LPTIM_Stop_IT(hal_lptim_handle_t *hlptim)
{
  hal_status_t status;

  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state, HAL_LPTIM_STATE_ACTIVE);

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  LL_LPTIM_Enable(p_lptim);

  LL_LPTIM_DisableIT(p_lptim, LPTIM_DIER_INTERRUPTS_MASK);
  if (LPTIM_WaitFlag(p_lptim, LL_LPTIM_IsActiveFlag_DIEROK) != HAL_OK)
  {
    return HAL_ERROR;
  }
  LL_LPTIM_ClearFlag_DIEROK(p_lptim);

  status = LPTIM_CcDisable(p_lptim);

  /* Reset the WAVE bit and the TIMOUT bit in CFGR. */
  volatile uint32_t cfgr = LL_LPTIM_READ_REG(p_lptim, CFGR);
  cfgr &= ~LPTIM_MODE_CFGR_MASK;
  LL_LPTIM_WRITE_REG(p_lptim, CFGR, cfgr);

  hlptim->global_state = HAL_LPTIM_STATE_IDLE;

  return status;
}

#if defined(USE_HAL_LPTIM_DMA) && (USE_HAL_LPTIM_DMA == 1)
/**
  * @brief    Start the low-power timer in DMA mode.
  * @param    hlptim      Pointer to the handle of the LPTIM instance.
  * @param    p_data      Pointer to the data buffer.
  * @param    size_byte   Data buffer size (in bytes).
  * @param    interrupts  Selection of the DMA interrupts. \n
  *                     Can be any of the (meaningful) those values:
  *                     - @ref HAL_LPTIM_OPT_DMA_IT_NONE
  *                     - @ref HAL_LPTIM_OPT_DMA_IT_HT
  *                     - @ref HAL_LPTIM_OPT_DMA_IT_DEFAULT
  * @if (USE_HAL_DMA_LINKEDLIST)
  *                    - @ref HAL_LPTIM_OPT_DMA_IT_SILENT
  * @endif
  * @warning  HAL_LPTIM_SetDMA() is to be called with the correct DMA index (see
  *           hal_lptim_dma_index_t) before calling this function.
  * @retval   HAL_OK
  * @retval   HAL_ERROR           Failed to start the DMA transfer.
  * @retval   HAL_INVALID_PARAM   Input parameter is invalid
  *                               (only if USE_HAL_CHECK_PARAM == 1)
  *
  */
hal_status_t HAL_LPTIM_Start_DMA_Opt(hal_lptim_handle_t *hlptim,
                                     const uint8_t *p_data,
                                     uint32_t size_byte,
                                     uint32_t interrupts)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_PARAM((p_data != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_data == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hlptim->global_state, HAL_LPTIM_STATE_IDLE);

  /* Check that DMA is supported by the instance */
  ASSERT_DBG_PARAM(IS_LPTIM_DMA_INSTANCE(LPTIM_INSTANCE(hlptim)));

  HAL_CHECK_UPDATE_STATE(hlptim, global_state, HAL_LPTIM_STATE_IDLE,
                         HAL_LPTIM_STATE_ACTIVE);

  return LPTIM_Start_DMA_Opt(hlptim, p_data, size_byte, interrupts);
}

/**
  * @brief    Start the low-power timer in DMA mode.
  * @param    hlptim      Pointer to the handle of the LPTIM instance.
  * @param    p_data      Pointer to the data buffer.
  * @param    size_byte   Data buffer size (in bytes).
  * @warning  HAL_LPTIM_SetDMA() is to be called with the correct DMA index (see
  *           hal_lptim_dma_index_t) before calling this function.
  * @retval   HAL_OK
  * @retval   HAL_ERROR           Failed to start the DMA transfer.
  * @retval   HAL_INVALID_PARAM   Input parameter is invalid
  *                               (only if USE_HAL_CHECK_PARAM == 1)
  *
  */
hal_status_t HAL_LPTIM_Start_DMA(hal_lptim_handle_t *hlptim,
                                 const uint8_t *p_data,
                                 uint32_t size_byte)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_PARAM((p_data != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_data == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hlptim->global_state, HAL_LPTIM_STATE_IDLE);

  ASSERT_DBG_PARAM(IS_LPTIM_DMA_INSTANCE(LPTIM_INSTANCE(hlptim)));

  HAL_CHECK_UPDATE_STATE(hlptim, global_state, HAL_LPTIM_STATE_IDLE,
                         HAL_LPTIM_STATE_ACTIVE);

  return LPTIM_Start_DMA_Opt(hlptim, p_data, size_byte, HAL_LPTIM_OPT_DMA_IT_DEFAULT);
}

/**
  * @brief  Stop the timer that was started in DMA mode.
  * @param  hlptim  Pointer to the handle of the LPTIM instance.
  * @retval HAL_OK
  */
hal_status_t HAL_LPTIM_Stop_DMA(hal_lptim_handle_t *hlptim)
{
  hal_status_t status;

  ASSERT_DBG_PARAM((hlptim != NULL));

