MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_lptim.c
  ASSERT_DBG_STATE(hlptim->global_state, HAL_LPTIM_STATE_ACTIVE);

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  if (LL_LPTIM_IsEnabledDMAReq_UPDATE(p_lptim) != 0U)
  {
    LL_LPTIM_DisableDMAReq_UPDATE(p_lptim);

    LPTIM_Abort_DMA(hlptim,
                    HAL_LPTIM_DMA_ID_UPDATE,
                    (IS_LPTIM_ACTIVE_SILENT(hlptim->global_state)));
  }

  LL_LPTIM_DisableDMAReq_UPDATE(p_lptim);

  status = LPTIM_CcDisable(p_lptim);

  hlptim->global_state = HAL_LPTIM_STATE_IDLE;

  return status;
}
#endif /* USE_HAL_LPTIM_DMA */

/**
  *  @}
  */

/** @addtogroup LPTIM_Exported_Functions_Group5
  * @{
  *  This group contains the functions used to configure and control
  *    the output stage of the LP Timer's capture/compare channels.
  *
  *     - Call HAL_LPTIM_OC_SetConfigChannel() to set output channel's configuration
  *     - Call HAL_LPTIM_OC_GetConfigChannel() to get output channel's configuration
  *     - Call HAL_LPTIM_OC_SetChannelPolarity() to set output channel's polarity
  *     - Call HAL_LPTIM_OC_GetChannelPolarity() to get output channel's polarity
  *     - Call HAL_LPTIM_OC_SetChannelPulse() to set output channel's pulse width
  *     - Call HAL_LPTIM_OC_GetChannelPulse() to get output channel's pulse width
  *     - Call HAL_LPTIM_OC_StartChannel() to start output channel
  *     - Call HAL_LPTIM_OC_StopChannel() to stop output channel
  *     - Call HAL_LPTIM_OC_StartChannel_IT() to start output channel with compare IT
  *     - Call HAL_LPTIM_OC_StopChannel_IT() to stop output channel with compare IT
  */

/**
  * @brief  Configure the Output channel.
  * @param  hlptim              Pointer to the handle of the LPTIM instance.
  * @param  channel             Output channel of interest. \n
  *                               Must be one of the following values: \n
  *                               @arg @ref HAL_LPTIM_CHANNEL_1
  *                               @arg @ref HAL_LPTIM_CHANNEL_2
  * @param  p_config            Pointer on @ref hal_lptim_oc_config_t
  * @retval HAL_OK
  * @retval HAL_ERROR           When low-power timer PWM setup fails.
  * @retval HAL_INVALID_PARAM   When p_config pointer is NULL
  *                             (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_LPTIM_OC_SetConfigChannel(hal_lptim_handle_t *hlptim,
                                           hal_lptim_channel_t channel,
                                           const hal_lptim_oc_config_t *p_config)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_PARAM((p_config != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hlptim->global_state, HAL_LPTIM_STATE_IDLE);

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  ASSERT_DBG_PARAM((IS_LPTIM_OC_CHANNEL(p_lptim, channel)));

  ASSERT_DBG_STATE(hlptim->channel_states[(uint32_t)channel],
                   (HAL_LPTIM_CHANNEL_STATE_RESET | LPTIM_CHANNEL_STATE_IDLE));

  ASSERT_DBG_PARAM(IS_LPTIM_OC_PULSE(p_config->pulse));
  ASSERT_DBG_PARAM(IS_LPTIM_OC_POLARITY(p_config->polarity));

  LL_LPTIM_OC_SetPolarity(p_lptim, (uint32_t)channel, (uint32_t)p_config->polarity);

  if (LPTIM_OC_SetPulse(p_lptim, channel, p_config->pulse) == HAL_ERROR)
  {
    return HAL_ERROR;
  }
  LL_LPTIM_CC_SetChannelMode(p_lptim, (uint32_t)channel, LL_LPTIM_CCMODE_OUTPUT_PWM);

  hlptim->channel_states[(uint32_t)channel] = HAL_LPTIM_OC_CHANNEL_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Get the configuration of an Output Channel.
  * @param  hlptim     Pointer to the handle of the LPTIM instance.
  * @param  channel   Output channel of interest. \n
  *                     Must be one of the following values: \n
  *                     @arg @ref HAL_LPTIM_CHANNEL_1
  *                     @arg @ref HAL_LPTIM_CHANNEL_2
  * @param  p_config   Pointer on @ref hal_lptim_oc_config_t
  */
void HAL_LPTIM_OC_GetConfigChannel(hal_lptim_handle_t *hlptim,
                                   hal_lptim_channel_t channel,
                                   hal_lptim_oc_config_t *p_config)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_PARAM((p_config != NULL));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_INIT | HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  ASSERT_DBG_PARAM((IS_LPTIM_OC_CHANNEL(p_lptim, channel)));

  ASSERT_DBG_STATE(hlptim->channel_states[(uint32_t)channel],
                   (HAL_LPTIM_OC_CHANNEL_STATE_IDLE | HAL_LPTIM_OC_CHANNEL_STATE_ACTIVE));

  p_config->polarity = (hal_lptim_oc_polarity_t)LL_LPTIM_OC_GetPolarity(p_lptim, (uint32_t)channel);
  p_config->pulse = LL_LPTIM_OC_GetCompareValue(p_lptim, (uint32_t)channel);
}

/**
  * @brief    Set output channel's polarity.
  * @param    hlptim    Pointer to the handle of the LPTIM instance.
  * @param    channel   Output channel of interest. \n
  *                     Must be one of the following values: \n
  *                     @arg @ref HAL_LPTIM_CHANNEL_1
  *                     @arg @ref HAL_LPTIM_CHANNEL_2
  * @param    polarity  Output channel's polarity
  * @warning  Ensure the channel is disabled.
  * @retval   HAL_OK
  */
hal_status_t HAL_LPTIM_OC_SetChannelPolarity(hal_lptim_handle_t *hlptim,
                                             hal_lptim_channel_t channel,
                                             hal_lptim_oc_polarity_t polarity)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state, HAL_LPTIM_STATE_IDLE);

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  ASSERT_DBG_PARAM((IS_LPTIM_OC_CHANNEL(p_lptim, channel)));

  ASSERT_DBG_PARAM(IS_LPTIM_OC_POLARITY(polarity));

  ASSERT_DBG_STATE(hlptim->channel_states[(uint32_t)channel],
                   (LPTIM_CHANNEL_STATE_IDLE));

  LL_LPTIM_OC_SetPolarity(p_lptim, (uint32_t)channel, (uint32_t)polarity);

  return HAL_OK;
}

/**
  * @brief  Get output channel's polarity.
  * @param  hlptim    Pointer to the handle of the LPTIM instance.
  * @param  channel   Output channel of interest. \n
  *                     Must be one of the following values: \n
  *                     @arg @ref HAL_LPTIM_CHANNEL_1
  *                     @arg @ref HAL_LPTIM_CHANNEL_2
  * @return hal_lptim_oc_polarity_t Output channel's polarity mode
  */
hal_lptim_oc_polarity_t HAL_LPTIM_OC_GetChannelPolarity(const hal_lptim_handle_t *hlptim,
                                                        hal_lptim_channel_t channel)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_INIT | HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));

  return (hal_lptim_oc_polarity_t)LL_LPTIM_OC_GetPolarity(LPTIM_INSTANCE(hlptim), (uint32_t)channel);
}

/**
  * @brief  Program the pulse width of the output channel.
  * @param  hlptim    Pointer to the handle of the LPTIM instance.
  * @param  channel   Output channel of interest. \n
  *                     Must be one of the following values: \n
  *                     @arg @ref HAL_LPTIM_CHANNEL_1
  *                     @arg @ref HAL_LPTIM_CHANNEL_2
  * @param  pulse     Value pulse width needs to compare it.
  * @retval HAL_OK
  * @retval HAL_ERROR If pulse set failed.
  */
hal_status_t HAL_LPTIM_OC_SetChannelPulse(hal_lptim_handle_t *hlptim,
                                          hal_lptim_channel_t channel,
                                          uint32_t pulse)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state, HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE);

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  ASSERT_DBG_PARAM((IS_LPTIM_OC_CHANNEL(p_lptim, channel)));

  ASSERT_DBG_PARAM(IS_LPTIM_OC_PULSE(pulse));

