MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_lptim.c
  if (LPTIM_OC_SetPulse(p_lptim, channel, pulse) == HAL_ERROR)
  {
    return HAL_ERROR;
  }

  LL_LPTIM_CC_SetChannelMode(p_lptim, (uint32_t)channel, LL_LPTIM_CCMODE_OUTPUT_PWM);

  return HAL_OK;
}

/**
  * @brief  Get the pulse of the output channel.
  * @param  hlptim    Pointer to the handle of the LPTIM instance.
  * @param  channel   Output channel of interest. \n
  *                     Must be one of the following values: \n
  *                     @arg @ref HAL_LPTIM_CHANNEL_1
  *                     @arg @ref HAL_LPTIM_CHANNEL_2
  * @return Pulse value from channel number.
  */
uint32_t HAL_LPTIM_OC_GetChannelPulse(const hal_lptim_handle_t *hlptim,
                                      hal_lptim_channel_t channel)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_PARAM((IS_LPTIM_OC_CHANNEL(LPTIM_INSTANCE(hlptim), channel)));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));

  return LL_LPTIM_OC_GetCompareValue(LPTIM_INSTANCE(hlptim), (uint32_t)channel);
}

/**
  * @brief  Start a LP-Timer's output channel in polling mode.
  * @param  hlptim    Pointer to the handle of the LPTIM instance.
  * @param  channel   Output channel of interest. \n
  *                     Must be one of the following values: \n
  *                     @arg @ref HAL_LPTIM_CHANNEL_1
  *                     @arg @ref HAL_LPTIM_CHANNEL_2
  * @retval HAL_OK
  */
hal_status_t HAL_LPTIM_OC_StartChannel(hal_lptim_handle_t *hlptim,
                                       hal_lptim_channel_t channel)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  ASSERT_DBG_PARAM((IS_LPTIM_OC_CHANNEL(p_lptim, channel)));

  ASSERT_DBG_STATE(hlptim->channel_states[(uint32_t)channel],
                   HAL_LPTIM_OC_CHANNEL_STATE_IDLE);
  HAL_CHECK_UPDATE_STATE(hlptim, channel_states[(uint32_t)channel],
                         HAL_LPTIM_OC_CHANNEL_STATE_IDLE,
                         HAL_LPTIM_OC_CHANNEL_STATE_ACTIVE);

  LL_LPTIM_CC_DisableChannel(p_lptim, (uint32_t)channel);

  LL_LPTIM_CC_SetChannelMode(p_lptim, (uint32_t)channel, LL_LPTIM_CCMODE_OUTPUT_PWM);

  LL_LPTIM_CC_EnableChannel(p_lptim, (uint32_t)channel);

  return HAL_OK;
}

/**
  * @brief  Stop the low-power timer output channel or output compare.
  * @param  hlptim   Pointer to the handle of the LPTIM instance.
  * @param  channel   Output channel of interest. \n
  *                     Must be one of the following values: \n
  *                     @arg @ref HAL_LPTIM_CHANNEL_1
  *                     @arg @ref HAL_LPTIM_CHANNEL_2
  * @retval HAL_OK
  */
hal_status_t HAL_LPTIM_OC_StopChannel(hal_lptim_handle_t *hlptim,
                                      hal_lptim_channel_t channel)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  ASSERT_DBG_PARAM((IS_LPTIM_OC_CHANNEL(p_lptim, channel)));

  ASSERT_DBG_STATE(hlptim->channel_states[(uint32_t)channel],
                   HAL_LPTIM_OC_CHANNEL_STATE_ACTIVE);

  LL_LPTIM_CC_DisableChannel(p_lptim, (uint32_t)channel);

  hlptim->channel_states[(uint32_t)channel] = HAL_LPTIM_OC_CHANNEL_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Start the low-power timer output channel or output compare in interrupt mode.
  * @param  hlptim    Pointer to the handle of the LPTIM instance.
  * @param  channel   Output channel of interest. \n
  *                     Must be one of the following values: \n
  *                     @arg @ref HAL_LPTIM_CHANNEL_1
  *                     @arg @ref HAL_LPTIM_CHANNEL_2
  * @retval HAL_OK
  * @retval HAL_ERROR No flag has been given.
  */
hal_status_t HAL_LPTIM_OC_StartChannel_IT(hal_lptim_handle_t *hlptim,
                                          hal_lptim_channel_t channel)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  ASSERT_DBG_PARAM((IS_LPTIM_OC_CHANNEL(p_lptim, channel)));

  ASSERT_DBG_STATE(hlptim->channel_states[(uint32_t)channel],
                   HAL_LPTIM_OC_CHANNEL_STATE_IDLE);
  HAL_CHECK_UPDATE_STATE(hlptim, channel_states[(uint32_t)channel],
                         HAL_LPTIM_OC_CHANNEL_STATE_IDLE,
                         HAL_LPTIM_OC_CHANNEL_STATE_ACTIVE);

  /* Enable LPTIM if it was disabled when entering this function. */
  uint32_t is_lptim_enabled = LL_LPTIM_IsEnabled(p_lptim);
  LL_LPTIM_Enable(p_lptim);

  /* Enable IT flag */
  uint32_t it_mask = 0U;
  it_mask |= channel_it[(uint32_t)channel].cmp;
  it_mask |= channel_it[(uint32_t)channel].cc;
  LL_LPTIM_EnableIT(p_lptim, it_mask);

  if (LPTIM_WaitFlag(p_lptim, LL_LPTIM_IsActiveFlag_DIEROK) != HAL_OK)
  {
    return HAL_ERROR;
  }
  LL_LPTIM_ClearFlag_DIEROK(p_lptim);

  LL_LPTIM_CC_SetChannelMode(p_lptim, (uint32_t)channel, LL_LPTIM_CCMODE_OUTPUT_PWM);

  LL_LPTIM_CC_EnableChannel(p_lptim, (uint32_t)channel);

  if (is_lptim_enabled == 0U)
  {
    LL_LPTIM_Disable(p_lptim);
  }

  return HAL_OK;
}

/**
  * @brief  Stop the low-power timer output channel or output compare in interrupt mode.
  * @param  hlptim    Pointer to the handle of the LPTIM instance.
  * @param  channel   Output channel of interest. \n
  *                     Must be one of the following values: \n
  *                     @arg @ref HAL_LPTIM_CHANNEL_1
  *                     @arg @ref HAL_LPTIM_CHANNEL_2
  * @retval HAL_OK
  * @retval HAL_ERROR No flags have been given.
  */
hal_status_t HAL_LPTIM_OC_StopChannel_IT(hal_lptim_handle_t *hlptim,
                                         hal_lptim_channel_t channel)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  ASSERT_DBG_PARAM((IS_LPTIM_OC_CHANNEL(p_lptim, channel)));

  ASSERT_DBG_STATE(hlptim->channel_states[(uint32_t)channel],
                   HAL_LPTIM_OC_CHANNEL_STATE_ACTIVE);

  /* Enable LPTIM if it was disabled when entering this function. */
  uint32_t is_lptim_enabled = LL_LPTIM_IsEnabled(p_lptim);
  LL_LPTIM_Enable(p_lptim);

  LL_LPTIM_CC_DisableChannel(p_lptim, (uint32_t)channel);

  /* Disable IT flag */
  uint32_t it_mask = 0U;
  it_mask |= channel_it[(uint32_t)channel].cmp;
  it_mask |= channel_it[(uint32_t)channel].cc;
  LL_LPTIM_DisableIT(p_lptim, it_mask);

  if (LPTIM_WaitFlag(p_lptim, LL_LPTIM_IsActiveFlag_DIEROK) != HAL_OK)
  {
    return HAL_ERROR;
  }
  LL_LPTIM_ClearFlag_DIEROK(p_lptim);

  if (is_lptim_enabled == 0U)
  {
    LL_LPTIM_Disable(p_lptim);
  }

  hlptim->channel_states[(uint32_t)channel] = HAL_LPTIM_OC_CHANNEL_STATE_IDLE;

  return HAL_OK;
}


/**
  *  @}
  */

/** @addtogroup LPTIM_Exported_Functions_Group6
  * @{
  *
  * This group contains the functions used to configure and control
  * the input stage of the timer's capture/compare channels.
  *    - Call HAL_LPTIM_IC_SetConfigChannel() to set input channel's configuration
  *    - Call HAL_LPTIM_IC_GetConfigChannel() to get input channel's configuration
  *    - Call HAL_LPTIM_IC_SetChannelSource() to set input channel's source
  *    - Call HAL_LPTIM_IC_GetChannelSource() to get input channel's source
  *    - Call HAL_LPTIM_IC_SetChannelPolarity() to set input channel's polarity
  *    - Call HAL_LPTIM_IC_GetChannelPolarity() to get input channel's polarity
  *    - Call HAL_LPTIM_IC_GetChannelFilter() to get input channel's filter
  *    - Call HAL_LPTIM_IC_SetChannelFilter() to set input channel's filter
  *    - Call HAL_LPTIM_IC_GetChannelPrescaler() to get input channel's prescaler
  *    - Call HAL_LPTIM_IC_SetChannelPrescaler() to set input channel's prescaler
  *    - Call HAL_LPTIM_IC_StartChannel() to start input channel
  *    - Call HAL_LPTIM_IC_StopChannel() to stop input channel
  *    - Call HAL_LPTIM_IC_StartChannel_IT() to start input channel with capture IT
  *    - Call HAL_LPTIM_IC_StopChannel_IT() to stop input channel with capture IT
  *    - Call HAL_LPTIM_IC_StartChannel_DMA() to start input channel with capture DMA
  *    - Call HAL_LPTIM_IC_StartChannel_DMA_Opt() to start input channel with capture DMA with DMA IT specific options
  *    - Call HAL_LPTIM_IC_StopChannel_DMA() to stop input channel with capture DMA
  *    - Call HAL_LPTIM_IC_ReadChannelCapturedValue() to read value captured of timer's input channel
  */

/**
  * @brief  Configure an input channel.
  * @param  hlptim              Pointer to the handle of the LPTIM instance.
  * @param  channel   Input channel of interest. \n
  *                     Must be one of the following values: \n
  *                     @arg @ref HAL_LPTIM_CHANNEL_1
  *                     @arg @ref HAL_LPTIM_CHANNEL_2
  * @param  p_config            Pointer on @ref hal_lptim_ic_config_t.
  * @retval HAL_OK
  * @retval HAL_ERROR           When the low-power timer PWM setup failed.
  * @retval HAL_INVALID_PARAM   When p_config pointer is NULL
  *                             (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_LPTIM_IC_SetConfigChannel(hal_lptim_handle_t *hlptim,
                                           hal_lptim_channel_t channel,
                                           const hal_lptim_ic_config_t *p_config)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_PARAM((p_config != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hlptim->global_state, HAL_LPTIM_STATE_IDLE);

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  ASSERT_DBG_PARAM(IS_LPTIM_CHANNEL(channel));

