MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_lptim.c
  ASSERT_DBG_PARAM(IS_LPTIM_INPUT_CAPTURE_INSTANCE(p_lptim));

  ASSERT_DBG_PARAM(IS_LPTIM_CHANNEL_SRC(p_lptim, channel, p_config->source));
  ASSERT_DBG_PARAM(IS_LPTIM_IC_POLARITY(p_config->polarity));
  ASSERT_DBG_PARAM(IS_LPTIM_FILTER(p_config->filter));
  ASSERT_DBG_PARAM(IS_LPTIM_IC_PRESCALER(p_config->prescaler));

  ASSERT_DBG_STATE(hlptim->channel_states[(uint32_t)channel],
                   (HAL_LPTIM_CHANNEL_STATE_RESET | LPTIM_CHANNEL_STATE_IDLE));

  uint32_t ll_channelsource = LPTIM_ConvertHALToLLIcx(hlptim, channel, p_config->source);
  LL_LPTIM_SetRemap(p_lptim, ll_channelsource);

  uint32_t config = LPTIM_IC_HAL2LL_FILTER((uint32_t)p_config->filter) \
                    | (uint32_t)p_config->polarity \
                    | (uint32_t)p_config->prescaler \
                    | (uint32_t)LL_LPTIM_CCMODE_INPUTCAPTURE;
  LL_LPTIM_IC_Config(p_lptim, (uint32_t)channel, config);

  hlptim->channel_states[(uint32_t)channel] = HAL_LPTIM_IC_CHANNEL_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief Get the configuration of an input channel.
  * @param hlptim     Pointer to the handle of the LPTIM instance.
  * @param channel    Input channel of interest to enable.
  * @param p_config   Pointer on @ref hal_lptim_ic_config_t.
  */
void HAL_LPTIM_IC_GetConfigChannel(const hal_lptim_handle_t *hlptim,
                                   hal_lptim_channel_t channel,
                                   hal_lptim_ic_config_t *p_config)
{
  ASSERT_DBG_PARAM((hlptim != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

  ASSERT_DBG_STATE(hlptim->global_state, (HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  ASSERT_DBG_PARAM(IS_LPTIM_CHANNEL(channel));

  ASSERT_DBG_PARAM(IS_LPTIM_INPUT_CAPTURE_INSTANCE(p_lptim));

  ASSERT_DBG_STATE(hlptim->channel_states[(uint32_t)channel],
                   (HAL_LPTIM_IC_CHANNEL_STATE_IDLE | HAL_LPTIM_IC_CHANNEL_STATE_ACTIVE));

  p_config->source = (hal_lptim_ic_src_t)LPTIM_ConvertLLToHALIcx(hlptim, channel, LL_LPTIM_GetRemap(p_lptim));

  uint32_t reg_config = LL_LPTIM_IC_GetConfig(p_lptim, (uint32_t)channel);
  p_config->polarity = (hal_lptim_ic_polarity_t)((uint32_t)(reg_config & LPTIM_CCMR1_CC1P));
  p_config->filter = (hal_lptim_filter_t)LPTIM_IC_LL2HAL_FILTER(reg_config & LPTIM_CCMR1_IC1F);
  p_config->prescaler = (hal_lptim_ic_prescaler_t)((uint32_t)((reg_config & LPTIM_CCMR1_IC1PSC)));
}

/**
  * @brief Set input channel's source.
  *
  * @param    hlptim    Pointer to the handle of the LPTIM instance.
  * @param    channel   Input channel of interest. \n
  *                     Must be one of the following values: \n
  *                     @arg @ref HAL_LPTIM_CHANNEL_1
  *                     @arg @ref HAL_LPTIM_CHANNEL_2
  * @param    source    Input source for the channel.
  * @warning  Ensure the channel is disabled.
  * @retval   HAL_OK
  */
hal_status_t HAL_LPTIM_IC_SetChannelSource(const hal_lptim_handle_t *hlptim,
                                           hal_lptim_channel_t channel,
                                           hal_lptim_ic_src_t source)
{
  STM32_UNUSED(channel);

  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state, (HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  ASSERT_DBG_PARAM(IS_LPTIM_CHANNEL(channel));

  ASSERT_DBG_PARAM(IS_LPTIM_INPUT_CAPTURE_INSTANCE(p_lptim));

  ASSERT_DBG_STATE(hlptim->channel_states[(uint32_t)channel],
                   (HAL_LPTIM_IC_CHANNEL_STATE_IDLE | HAL_LPTIM_IC_CHANNEL_STATE_ACTIVE));


  uint32_t ll_channelsource = LPTIM_ConvertHALToLLIcx(hlptim, channel, source);
  LL_LPTIM_SetRemap(p_lptim, ll_channelsource);

  return HAL_OK;
}

/**
  * @brief    Get the source of a input channel.
  * @param    hlptim     Pointer to the handle of the LPTIM instance.
  * @param    channel    Input channel of interest. \n
  *                      Must be one of the following values: \n
  *                      @arg @ref HAL_LPTIM_CHANNEL_1
  *                      @arg @ref HAL_LPTIM_CHANNEL_2
  * @warning  Ensure the channel is disabled.
  * @retval   hal_lptim_ic_src_t channel input sources
  */
hal_lptim_ic_src_t HAL_LPTIM_IC_GetChannelSource(const hal_lptim_handle_t *hlptim,
                                                 hal_lptim_channel_t channel)
{
  STM32_UNUSED(channel);

  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state, (HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  ASSERT_DBG_PARAM(IS_LPTIM_CHANNEL(channel));

  ASSERT_DBG_PARAM(IS_LPTIM_INPUT_CAPTURE_INSTANCE(p_lptim));

  ASSERT_DBG_STATE(hlptim->channel_states[(uint32_t)channel],
                   (HAL_LPTIM_IC_CHANNEL_STATE_IDLE | HAL_LPTIM_IC_CHANNEL_STATE_ACTIVE));

  return LPTIM_ConvertLLToHALIcx(hlptim, channel, LL_LPTIM_GetRemap(p_lptim));
}

/**
  * @brief Set input channel's polarity.
  *
  * @param hlptim   Pointer to the handle of the LPTIM instance.
  * @param channel  Input channel of interest. \n
  *                 Must be one of the following values: \n
  *                      @arg @ref HAL_LPTIM_CHANNEL_1
  *                      @arg @ref HAL_LPTIM_CHANNEL_2
  * @param polarity input channel's polarity.
  * @warning Ensure the channel is disabled.
  * @retval HAL_OK
  */
hal_status_t HAL_LPTIM_IC_SetChannelPolarity(const hal_lptim_handle_t *hlptim,
                                             hal_lptim_channel_t channel,
                                             hal_lptim_ic_polarity_t polarity)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state, HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_INIT);

  ASSERT_DBG_PARAM(IS_LPTIM_CHANNEL(channel));

  ASSERT_DBG_PARAM(IS_LPTIM_INPUT_CAPTURE_INSTANCE(LPTIM_INSTANCE(hlptim)));

  ASSERT_DBG_PARAM(IS_LPTIM_IC_POLARITY(polarity));

  ASSERT_DBG_STATE(hlptim->channel_states[(uint32_t)channel],
                   (LPTIM_CHANNEL_STATE_IDLE));

  LL_LPTIM_IC_SetPolarity(LPTIM_INSTANCE(hlptim), (uint32_t)channel, (uint32_t)polarity);

  return HAL_OK;
}

/**
  * @brief    Get input channel's polarity.
  * @param    hlptim     Pointer to the handle of the LPTIM instance.
  * @param    channel    Input channel of interest. \n
  *                      Must be one of the following values: \n
  *                      @arg @ref HAL_LPTIM_CHANNEL_1
  *                      @arg @ref HAL_LPTIM_CHANNEL_2
  * @return   hal_lptim_ic_polarity_t The input polarity for the channel
  */
hal_lptim_ic_polarity_t HAL_LPTIM_IC_GetChannelPolarity(const hal_lptim_handle_t *hlptim,
                                                        hal_lptim_channel_t channel)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));

  return (hal_lptim_ic_polarity_t)LL_LPTIM_IC_GetPolarity(LPTIM_INSTANCE(hlptim),
                                                          (uint32_t)channel);
}

/**
  * @brief    Set input channel's filter.
  * @param    hlptim Pointer to the handle of the LPTIM instance.
  * @param    channel    Input channel of interest. \n
  *                      Must be one of the following values: \n
  *                      @arg @ref HAL_LPTIM_CHANNEL_1
  *                      @arg @ref HAL_LPTIM_CHANNEL_2
  * @param    filter  Input filter for the channel.
  * @warning  Ensure the channel is disabled.
  * @retval   HAL_OK
  */
hal_status_t HAL_LPTIM_IC_SetChannelFilter(const hal_lptim_handle_t *hlptim,
                                           hal_lptim_channel_t channel,
                                           hal_lptim_filter_t filter)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state, HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_INIT);

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  ASSERT_DBG_PARAM(IS_LPTIM_CHANNEL(channel));

