MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_lptim.c
  ASSERT_DBG_PARAM(IS_LPTIM_INPUT_CAPTURE_INSTANCE(p_lptim));

  ASSERT_DBG_PARAM(IS_LPTIM_FILTER(filter));

  ASSERT_DBG_STATE(hlptim->channel_states[(uint32_t)channel],
                   (LPTIM_CHANNEL_STATE_IDLE));

  LL_LPTIM_IC_SetFilter(p_lptim, (uint32_t)channel, LPTIM_IC_HAL2LL_FILTER((uint32_t)filter));

  return HAL_OK;
}

/**
  * @brief    Get input channel's filter.
  * @param    hlptim     Pointer to the handle of the LPTIM instance.
  * @param    channel    Input channel of interest. \n
  *                      Must be one of the following values: \n
  *                      @arg @ref HAL_LPTIM_CHANNEL_1
  *                      @arg @ref HAL_LPTIM_CHANNEL_2
  * @return   hal_lptim_filter_t input filter for the channel.
  */
hal_lptim_filter_t HAL_LPTIM_IC_GetChannelFilter(const hal_lptim_handle_t *hlptim,
                                                 hal_lptim_channel_t channel)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));

  return (hal_lptim_filter_t)LPTIM_IC_LL2HAL_FILTER(LL_LPTIM_IC_GetFilter(LPTIM_INSTANCE(hlptim), (uint32_t)channel));
}

/**
  * @brief    Configure the prescaler of an input channel.
  * @param    hlptim Pointer to the handle of the LPTIM instance.
  * @param    channel    Input channel of interest. \n
  *                      Must be one of the following values: \n
  *                      @arg @ref HAL_LPTIM_CHANNEL_1
  *                      @arg @ref HAL_LPTIM_CHANNEL_2
  * @param    prescaler Input prescaler for the channel.
  * @retval   HAL_OK
  */
hal_status_t HAL_LPTIM_IC_SetChannelPrescaler(const hal_lptim_handle_t *hlptim,
                                              hal_lptim_channel_t channel,
                                              hal_lptim_ic_prescaler_t prescaler)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state, HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_INIT | HAL_LPTIM_STATE_ACTIVE);

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  ASSERT_DBG_PARAM(IS_LPTIM_CHANNEL(channel));

  ASSERT_DBG_PARAM(IS_LPTIM_INPUT_CAPTURE_INSTANCE(p_lptim));

  ASSERT_DBG_PARAM(IS_LPTIM_IC_PRESCALER(prescaler));

  ASSERT_DBG_STATE(hlptim->channel_states[(uint32_t)channel],
                   (LPTIM_CHANNEL_STATE_IDLE));

  LL_LPTIM_IC_SetPrescaler(p_lptim, (uint32_t)channel, (uint32_t)prescaler);

  return HAL_OK;
}

/**
  * @brief    Get the prescaler of a input channel.
  * @param    hlptim     Pointer to the handle of the LPTIM instance.
  * @param    channel    Input channel of interest. \n
  *                      Must be one of the following values: \n
  *                      @arg @ref HAL_LPTIM_CHANNEL_1
  *                      @arg @ref HAL_LPTIM_CHANNEL_2
  * @return   hal_lptim_ic_prescaler_t The input prescaler for the channel.
  */
hal_lptim_ic_prescaler_t HAL_LPTIM_IC_GetChannelPrescaler(const hal_lptim_handle_t *hlptim,
                                                          hal_lptim_channel_t channel)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_INIT | HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));

  return (hal_lptim_ic_prescaler_t)LL_LPTIM_IC_GetPrescaler(LPTIM_INSTANCE(hlptim), (uint32_t)channel);
}

/**
  * @brief    Start a low-power timer input channel in polling mode.
  * @param    hlptim     Pointer to the handle of the LPTIM instance.
  * @param    channel    Input channel of interest. \n
  *                      Must be one of the following values: \n
  *                      @arg @ref HAL_LPTIM_CHANNEL_1
  *                      @arg @ref HAL_LPTIM_CHANNEL_2
  * @retval   HAL_OK
  */
hal_status_t HAL_LPTIM_IC_StartChannel(hal_lptim_handle_t *hlptim,
                                       hal_lptim_channel_t channel)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  ASSERT_DBG_PARAM(IS_LPTIM_CHANNEL(channel));

  ASSERT_DBG_PARAM(IS_LPTIM_INPUT_CAPTURE_INSTANCE(p_lptim));

  ASSERT_DBG_STATE(hlptim->channel_states[(uint32_t)channel],
                   HAL_LPTIM_IC_CHANNEL_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(hlptim, channel_states[(uint32_t)channel],
                         HAL_LPTIM_IC_CHANNEL_STATE_IDLE,
                         HAL_LPTIM_IC_CHANNEL_STATE_ACTIVE);

  LL_LPTIM_CC_EnableChannel(p_lptim, (uint32_t)channel);

  return HAL_OK;
}

/**
  * @brief    Stop the low-power timer input channel.
  * @param    hlptim Pointer to the handle of the LPTIM instance.
  * @param    channel    Input channel of interest. \n
  *                      Must be one of the following values: \n
  *                      @arg @ref HAL_LPTIM_CHANNEL_1
  *                      @arg @ref HAL_LPTIM_CHANNEL_2
  * @retval   HAL_OK
  */
hal_status_t HAL_LPTIM_IC_StopChannel(hal_lptim_handle_t *hlptim,
                                      hal_lptim_channel_t channel)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  ASSERT_DBG_PARAM(IS_LPTIM_CHANNEL(channel));

  ASSERT_DBG_PARAM(IS_LPTIM_INPUT_CAPTURE_INSTANCE(p_lptim));

  ASSERT_DBG_STATE(hlptim->channel_states[(uint32_t)channel],
                   HAL_LPTIM_IC_CHANNEL_STATE_ACTIVE);

  LL_LPTIM_CC_DisableChannel(p_lptim, (uint32_t)channel);

  hlptim->channel_states[(uint32_t)channel] = HAL_LPTIM_IC_CHANNEL_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief Start the low-power timer input channel in interrupt mode.
  *
  * @param hlptim Pointer to the handle of the LPTIM instance.
  * @param    channel   Input channel of interest. \n
  *                     Must be one of the following values: \n
  *                     @arg @ref HAL_LPTIM_CHANNEL_1
  *                     @arg @ref HAL_LPTIM_CHANNEL_2
  * @retval HAL_ERROR No flag has been given
  * @retval HAL_OK input channel has been correctly started
  */
hal_status_t HAL_LPTIM_IC_StartChannel_IT(hal_lptim_handle_t *hlptim,
                                          hal_lptim_channel_t channel)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  ASSERT_DBG_PARAM(IS_LPTIM_CHANNEL(channel));

