MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_lptim.c
  ASSERT_DBG_PARAM(IS_LPTIM_INPUT_CAPTURE_INSTANCE(p_lptim));

  ASSERT_DBG_STATE(hlptim->channel_states[(uint32_t)channel],
                   HAL_LPTIM_IC_CHANNEL_STATE_IDLE);
  HAL_CHECK_UPDATE_STATE(hlptim, channel_states[(uint32_t)channel],
                         HAL_LPTIM_IC_CHANNEL_STATE_IDLE,
                         HAL_LPTIM_IC_CHANNEL_STATE_ACTIVE);

  /* Enable LPTIM if it was disabled when entering this function. */
  uint32_t is_lptim_enabled = LL_LPTIM_IsEnabled(p_lptim);
  LL_LPTIM_Enable(p_lptim);

  LL_LPTIM_EnableIT(p_lptim, channel_it[(uint32_t)channel].cc);

  if (LPTIM_WaitFlag(p_lptim, LL_LPTIM_IsActiveFlag_DIEROK) != HAL_OK)
  {
    return HAL_ERROR;
  }
  LL_LPTIM_ClearFlag_DIEROK(p_lptim);

  if (is_lptim_enabled == 0U)
  {
    LL_LPTIM_Disable(p_lptim);
  }

  LL_LPTIM_CC_SetChannelMode(p_lptim, (uint32_t)channel, LL_LPTIM_CCMODE_INPUTCAPTURE);

  LL_LPTIM_CC_EnableChannel(p_lptim, (uint32_t)channel);

  return HAL_OK;
}

/**
  * @brief  Stop the low-power timer input channel in interrupt mode.
  * @param  hlptim    Pointer to the handle of the LPTIM instance.
  * @param  channel   Input channel of interest. \n
  *                     Must be one of the following values: \n
  *                     @arg @ref HAL_LPTIM_CHANNEL_1
  *                     @arg @ref HAL_LPTIM_CHANNEL_2
  * @retval HAL_ERROR No flags have been given.
  * @retval HAL_OK input channel has been correctly stopped
  */
hal_status_t HAL_LPTIM_IC_StopChannel_IT(hal_lptim_handle_t *hlptim,
                                         hal_lptim_channel_t channel)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  ASSERT_DBG_PARAM(IS_LPTIM_CHANNEL(channel));

  ASSERT_DBG_PARAM(IS_LPTIM_INPUT_CAPTURE_INSTANCE(p_lptim));

  ASSERT_DBG_STATE(hlptim->channel_states[(uint32_t)channel], HAL_LPTIM_IC_CHANNEL_STATE_ACTIVE);

  LL_LPTIM_CC_DisableChannel(p_lptim, (uint32_t)channel);

  /* Enable LPTIM if it was disabled when entering this function. */
  uint32_t is_lptim_enabled = LL_LPTIM_IsEnabled(p_lptim);
  LL_LPTIM_Enable(p_lptim);

  LL_LPTIM_DisableIT(p_lptim, channel_it[(uint32_t)channel].cc);

  if (LPTIM_WaitFlag(p_lptim, LL_LPTIM_IsActiveFlag_DIEROK) != HAL_OK)
  {
    return HAL_ERROR;
  }
  LL_LPTIM_ClearFlag_DIEROK(p_lptim);

  if (is_lptim_enabled == 0U)
  {
    LL_LPTIM_Disable(p_lptim);
  }

  hlptim->channel_states[(uint32_t)channel] = HAL_LPTIM_IC_CHANNEL_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Start the low-power timer input channel in DMA mode.
  * @param  hlptim    Pointer to the handle of the LPTIM instance.
  * @param  channel   Input channel of interest. \n
  *                     Must be one of the following values: \n
  *                     @arg @ref HAL_LPTIM_CHANNEL_1
  *                     @arg @ref HAL_LPTIM_CHANNEL_2
  * @param p_data     Pointer to the data buffer
  * @param size_byte  Data buffer size
  * @retval HAL_ERROR No flag has been given
  * @retval HAL_OK
  */
#if defined(USE_HAL_LPTIM_DMA) && (USE_HAL_LPTIM_DMA == 1)
hal_status_t HAL_LPTIM_IC_StartChannel_DMA(hal_lptim_handle_t *hlptim,
                                           hal_lptim_channel_t channel,
                                           uint8_t *p_data,
                                           uint32_t size_byte)
{
  ASSERT_DBG_PARAM((hlptim != NULL));
  ASSERT_DBG_PARAM((p_data != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_data == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));

  ASSERT_DBG_PARAM(IS_LPTIM_CHANNEL(channel));

  ASSERT_DBG_PARAM(IS_LPTIM_INPUT_CAPTURE_INSTANCE(LPTIM_INSTANCE(hlptim)));

  ASSERT_DBG_PARAM((IS_LPTIM_DMA_INSTANCE(LPTIM_INSTANCE(hlptim))));

  ASSERT_DBG_STATE(hlptim->channel_states[(uint32_t)channel],
                   HAL_LPTIM_IC_CHANNEL_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(hlptim, channel_states[(uint32_t)channel],
                         HAL_LPTIM_IC_CHANNEL_STATE_IDLE,
                         HAL_LPTIM_IC_CHANNEL_STATE_ACTIVE);

  return LPTIM_IC_StartChannel_DMA_Opt(hlptim, channel, p_data, size_byte, HAL_LPTIM_OPT_DMA_IT_DEFAULT);
}

/**
  * @brief  Start the low-power timer input channel in DMA mode.
  * @param  hlptim Pointer to the handle of the LPTIM instance.
  * @param  channel    Input channel of interest. \n
  *                    Must be one of the following values: \n
  *                      @arg @ref HAL_LPTIM_CHANNEL_1
  *                      @arg @ref HAL_LPTIM_CHANNEL_2
  * @param  p_data pointer to the data buffer
  * @param  size_byte data buffer size
  * @param  interrupts Selection of the DMA interrupts.
  *                    Can be any of the (meaningful) those values:
  *                    - @ref HAL_LPTIM_OPT_DMA_IT_NONE
  *                    - @ref HAL_LPTIM_OPT_DMA_IT_HT
  *                    - @ref HAL_LPTIM_OPT_DMA_IT_DEFAULT
  * @if (USE_HAL_DMA_LINKEDLIST)
  *                    - @ref HAL_LPTIM_OPT_DMA_IT_SILENT
  * @endif
  * @retval HAL_OK
  * @retval HAL_ERROR No flag has been given
  */
hal_status_t HAL_LPTIM_IC_StartChannel_DMA_Opt(hal_lptim_handle_t *hlptim,
                                               hal_lptim_channel_t channel,
                                               uint8_t *p_data,
                                               uint32_t size_byte,
                                               uint32_t interrupts)
{
  ASSERT_DBG_PARAM((hlptim != NULL));
  ASSERT_DBG_PARAM((p_data != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_data == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));

  ASSERT_DBG_PARAM(IS_LPTIM_CHANNEL(channel));

  ASSERT_DBG_PARAM(IS_LPTIM_INPUT_CAPTURE_INSTANCE(LPTIM_INSTANCE(hlptim)));

  ASSERT_DBG_PARAM(IS_LPTIM_DMA_INSTANCE(LPTIM_INSTANCE(hlptim)));

  ASSERT_DBG_STATE(hlptim->channel_states[(uint32_t)channel],
                   HAL_LPTIM_IC_CHANNEL_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(hlptim, channel_states[(uint32_t)channel],
                         HAL_LPTIM_IC_CHANNEL_STATE_IDLE,
                         HAL_LPTIM_IC_CHANNEL_STATE_ACTIVE);

  return LPTIM_IC_StartChannel_DMA_Opt(hlptim, channel, p_data, size_byte, interrupts);
}

/**
  * @brief  Stop a timer's input channel that was started in DMA mode.
  * @param  hlptim    Pointer to the handle of the LPTIM instance.
  * @param  channel    Input channel of interest. \n
  *                    Must be one of the following values: \n
  *                      @arg @ref HAL_LPTIM_CHANNEL_1
  *                      @arg @ref HAL_LPTIM_CHANNEL_2
  * @retval HAL_OK
  */
hal_status_t HAL_LPTIM_IC_StopChannel_DMA(hal_lptim_handle_t *hlptim,
                                          hal_lptim_channel_t channel)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  ASSERT_DBG_PARAM(IS_LPTIM_CHANNEL(channel));

