MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_lptim.c
  ASSERT_DBG_PARAM(IS_LPTIM_INPUT_CAPTURE_INSTANCE(p_lptim));

  ASSERT_DBG_PARAM(IS_LPTIM_DMA_INSTANCE(p_lptim));

  hal_lptim_channel_state_t channel_state = hlptim->channel_states[(uint32_t)channel];

  ASSERT_DBG_STATE(channel_state,
                   HAL_LPTIM_IC_CHANNEL_STATE_ACTIVE);

  LPTIM_IC_StopChannel_DMA(hlptim, channel,
                           (IS_LPTIM_ACTIVE_SILENT(channel_state)));

  LL_LPTIM_CC_DisableChannel(p_lptim, (uint32_t)channel);

  hlptim->channel_states[(uint32_t)channel] = HAL_LPTIM_IC_CHANNEL_STATE_IDLE;

  return HAL_OK;
}
#endif /* USE_HAL_LPTIM_DMA */

/**
  * @brief  Read the captured value for a low-power timer input channel.
  * @param  hlptim    Pointer to the handle of the LPTIM instance.
  * @param  channel   Input channel of interest. \n
  *                   Must be one of the following values: \n
  *                      @arg @ref HAL_LPTIM_CHANNEL_1
  *                      @arg @ref HAL_LPTIM_CHANNEL_2
  * @retval uint32_t  Captured value
  */
uint32_t HAL_LPTIM_IC_ReadChannelCapturedValue(const hal_lptim_handle_t *hlptim,
                                               hal_lptim_channel_t channel)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  ASSERT_DBG_PARAM(IS_LPTIM_CHANNEL(channel));

  return LL_LPTIM_IC_GetCapturedValue(p_lptim, (uint32_t)channel);
}

/**
  * @brief  Get the input capture glitch filter latency.
  * @param  hlptim    Pointer to the handle of the LPTIM instance.
  * @param  channel   Input channel of interest. \n
  *                   Must be one of the following values: \n
  *                      @arg @ref HAL_LPTIM_CHANNEL_1
  *                      @arg @ref HAL_LPTIM_CHANNEL_2
  * @note  The LPTIM glitch filter and prescaler cause a latency offset in captured values.
  * @note  The real capture value corresponding to the input capture trigger can be calculated using the below formula:
  *        Real capture value = captured(LPTIM_CCRx) - filter latency
  * @retval uint8_t  Glitch filter latency in counter step unit
  */
uint8_t HAL_LPTIM_IC_GetChannelFilterLatency(const hal_lptim_handle_t *hlptim,
                                             hal_lptim_channel_t channel)
{
  uint8_t filter_latency;

  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  ASSERT_DBG_PARAM(IS_LPTIM_CHANNEL(channel));

  filter_latency = LL_LPTIM_IC_GetOffset(p_lptim, (uint32_t) channel);

  return filter_latency;
}

/**
  *  @}
  */

/** @addtogroup LPTIM_Exported_Functions_Group7
  *  @{
  *  This group contains the functions used to configure the encoder stage of the timer.
  *     - Call HAL_LPTIM_SetConfigEncoder() to set the config for the encoder.
  *     - Call HAL_LPTIM_GetConfigEncoder() to get the config for the encoder.
  */

/**
  * @brief    Configure the encoder interface.
  * @param    hlptim    Pointer to the handle of the LPTIM instance.
  * @param    p_encoder Pointer to the encoder configuration structure.
  * @warning  The signals frequency on both input1 and input2 must not exceed the LPTIM internal clock frequency divided
  *           by 4.
  * @retval   HAL_OK
  */
hal_status_t HAL_LPTIM_SetConfigEncoder(const hal_lptim_handle_t *hlptim,
                                        const hal_lptim_encoder_config_t *p_encoder)
{
  ASSERT_DBG_PARAM((hlptim != NULL));
  ASSERT_DBG_PARAM((p_encoder != NULL));

  ASSERT_DBG_STATE(hlptim->global_state, HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE);

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  ASSERT_DBG_PARAM(IS_LPTIM_FILTER(p_encoder->filter));

  ASSERT_DBG_PARAM(IS_LPTIM_ENCODER_INTERFACE_INSTANCE(p_lptim));

  ASSERT_DBG_PARAM(IS_LPTIM_INPUT1_SRC(p_encoder->input1));
  ASSERT_DBG_PARAM(IS_LPTIM_INPUT2_SRC(p_encoder->input2));

  /* The signals frequency on both Input1 and Input2 inputs must not exceed the LPTIM internal
    clock frequency divided by 4.*/
  ASSERT_DBG_PARAM((p_encoder->filter <= HAL_LPTIM_FDIV1_N4));

  LL_LPTIM_SetInput1Source(p_lptim, (uint32_t)p_encoder->input1);
  LL_LPTIM_SetInput2Source(p_lptim, (uint32_t)p_encoder->input2);
  LL_LPTIM_SetClockFilter(p_lptim, LPTIM_CFGR_HAL2LL_FILTER((uint32_t)p_encoder->filter));

  /* Disable LPTIM if it was enabled when entering this function. */
  uint32_t is_lptim_enabled = LL_LPTIM_IsEnabled(p_lptim);
  LL_LPTIM_Disable(p_lptim);

  LL_LPTIM_EnableEncoderMode(p_lptim);

  if (is_lptim_enabled != 0U)
  {
    LL_LPTIM_Enable(p_lptim);
  }
  return HAL_OK;
}

/**
  * @brief Get the configuration of the low-power timer encoder interface.
  * @param hlptim     Pointer to the handle of the LPTIM instance.
  * @param p_encoder  Pointer to the encoder configuration structure.
  */
void HAL_LPTIM_GetConfigEncoder(const hal_lptim_handle_t *hlptim,
                                hal_lptim_encoder_config_t *p_encoder)
{
  ASSERT_DBG_PARAM((hlptim != NULL));
  ASSERT_DBG_PARAM((p_encoder != NULL));

  ASSERT_DBG_STATE(hlptim->global_state, HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE);

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  p_encoder->input1 = (hal_lptim_input1_src_t)LL_LPTIM_GetInput1Source(p_lptim);
  p_encoder->input2 = (hal_lptim_input2_src_t)LL_LPTIM_GetInput2Source(p_lptim);
  p_encoder->filter = (hal_lptim_filter_t)(LPTIM_GET_CLOCK_FILTER(p_lptim));
}

/**
  *  @}
  */

/** @addtogroup LPTIM_Exported_Functions_Group8
  *  @{
  *  This section provides a set of function to configure external trigger
  *      - Call HAL_LPTIM_SetConfigExtTrigInput() Set External trigger input
  *      - Call HAL_LPTIM_GetConfigExtTrigInput() Get Configuration external trigger input
  *      - Call HAL_LPTIM_SetExtTrigInputSource() Set external trigger input Source
  *      - Call HAL_LPTIM_GetExtTrigInputSource() Get External trigger input Source
  *      - Call HAL_LPTIM_SetExtTrigInputPolarity() Set External trigger input Polarity
  *      - Call HAL_LPTIM_GetExtTrigInputPolarity() Get external trigger input Polarity
  *      - Call HAL_LPTIM_SetExtTrigInputFilter() Set External trigger input Filter
  *      - Call HAL_LPTIM_GetExtTrigInputFilter() Get external trigger input Filter
  */

/**
  * @brief  Configure External Trigger input.
  * @param  hlptim    Pointer to the handle of the LPTIM instance.
  * @param  p_config  Pointer to an external trigger input configuration structure.
  * @retval HAL_OK
  */
hal_status_t HAL_LPTIM_SetConfigExtTrigInput(const hal_lptim_handle_t *hlptim,
                                             const hal_lptim_ext_trig_config_t *p_config)
{
  ASSERT_DBG_PARAM((hlptim != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_INIT | HAL_LPTIM_STATE_IDLE));

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

