MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_lptim.c
  ASSERT_DBG_PARAM(IS_LPTIM_EXT_TRIG_POLARITY(p_config->polarity));
  ASSERT_DBG_PARAM(IS_LPTIM_FILTER(p_config->filter));
  ASSERT_DBG_PARAM(IS_LPTIM_EXT_TRIG_SRC(p_lptim, p_config->source));

  /* Disable LPTIM if it was enabled when entering this function. */
  uint32_t is_lptim_enabled = LL_LPTIM_IsEnabled(p_lptim);
  LL_LPTIM_Disable(p_lptim);

  uint32_t trig_src = LPTIM_ConvertHALToLLExttrig(hlptim, p_config->source);
  LL_LPTIM_ConfigTrigger(p_lptim,
                         (uint32_t)trig_src,
                         (uint32_t)(p_config->filter) << LPTIM_CFGR_TRGFLT_Pos,
                         (uint32_t)p_config->polarity);

  if (is_lptim_enabled != 0U)
  {
    LL_LPTIM_Enable(p_lptim);
  }

  return HAL_OK;
}

/**
  * @brief  Get the External Trigger input configuration.
  * @param  hlptim   Pointer to the handle of the LPTIM instance.
  * @param  p_config Pointer to an external trigger input configuration structure.
  */
void HAL_LPTIM_GetConfigExtTrigInput(const hal_lptim_handle_t *hlptim,
                                     hal_lptim_ext_trig_config_t *p_config)
{
  ASSERT_DBG_PARAM((hlptim != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_INIT | HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));

  volatile uint32_t cfgr = LL_LPTIM_READ_REG(LPTIM_INSTANCE(hlptim), CFGR);

  p_config->polarity = (hal_lptim_ext_trig_polarity_t)LPTIM_GET_ETR_POLARITY(cfgr);
  p_config->filter = (hal_lptim_filter_t)(uint32_t)(LPTIM_GET_ETR_FILTER(cfgr) >> LPTIM_CFGR_TRGFLT_Pos);
  p_config->source = (hal_lptim_ext_trig_src_t)LPTIM_ConvertLLToHALExttrig(hlptim, LPTIM_GET_ETR_SOURCE(cfgr));
}

/**
  * @brief  Set the External Trigger input source.
  * @param  hlptim  Pointer to the handle of the LPTIM instance.
  * @param  source  Source selection for the external trigger.
  * @retval HAL_OK
  */
hal_status_t HAL_LPTIM_SetExtTrigInputSource(const hal_lptim_handle_t *hlptim,
                                             hal_lptim_ext_trig_src_t source)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_INIT | HAL_LPTIM_STATE_IDLE));

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  ASSERT_DBG_PARAM(IS_LPTIM_EXT_TRIG_SRC(p_lptim, source));

  uint32_t trig_src = LPTIM_ConvertHALToLLExttrig(hlptim, source);

  LL_LPTIM_SetTriggerSource(p_lptim, (uint32_t)trig_src);

  return HAL_OK;
}

/**
  * @brief  Get the External Trigger input source.
  * @param  hlptim  Pointer to the handle of the LPTIM instance.
  * @retval hal_lptim_ext_trig_src_t Source selected for the external trigger.
  */
hal_lptim_ext_trig_src_t HAL_LPTIM_GetExtTrigInputSource(const hal_lptim_handle_t *hlptim)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_INIT | HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));

  uint32_t trig_src = LL_LPTIM_GetTriggerSource(LPTIM_INSTANCE(hlptim));

  return (LPTIM_ConvertLLToHALExttrig(hlptim, trig_src));
}

/**
  * @brief  Set the External Trigger input polarity.
  * @param  hlptim   Pointer to the handle of the LPTIM instance.
  * @param  polarity Polarity of the ETR input.
  * @retval HAL_OK
  */
hal_status_t HAL_LPTIM_SetExtTrigInputPolarity(const hal_lptim_handle_t *hlptim,
                                               hal_lptim_ext_trig_polarity_t polarity)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_INIT | HAL_LPTIM_STATE_IDLE));

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  ASSERT_DBG_PARAM(IS_LPTIM_EXT_TRIG_POLARITY(polarity));

  LL_LPTIM_SetTriggerPolarity(p_lptim, (uint32_t)polarity);

  return HAL_OK;
}

/**
  * @brief  Get the External Trigger input polarity.
  * @param  hlptim   Pointer to the handle of the LPTIM instance.
  * @retval hal_lptim_ext_trig_polarity_t External trigger polarity.
  */
hal_lptim_ext_trig_polarity_t HAL_LPTIM_GetExtTrigInputPolarity(const hal_lptim_handle_t *hlptim)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_INIT | HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));

  return ((hal_lptim_ext_trig_polarity_t)
          LL_LPTIM_GetTriggerPolarity(LPTIM_INSTANCE(hlptim)));
}

/**
  * @brief  Set the External Trigger input filter.
  * @param  hlptim  Pointer to the handle of the LPTIM instance.
  * @param  filter  Filter the external trigger input.
  * @retval HAL_OK
  */
hal_status_t HAL_LPTIM_SetExtTrigInputFilter(const hal_lptim_handle_t *hlptim,
                                             hal_lptim_filter_t filter)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_INIT | HAL_LPTIM_STATE_IDLE));

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  ASSERT_DBG_PARAM(IS_LPTIM_FILTER(filter));

  LL_LPTIM_SetTriggerFilter(p_lptim, (uint32_t)(filter) << LPTIM_CFGR_TRGFLT_Pos);

  return HAL_OK;
}

/**
  * @brief  Get the External Trigger input filter.
  * @param  hlptim  Pointer to the handle of the LPTIM instance.
  * @retval hal_lptim_filter_t Filter for the external trigger input.
  */
hal_lptim_filter_t HAL_LPTIM_GetExtTrigInputFilter(const hal_lptim_handle_t *hlptim)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  ASSERT_DBG_STATE(hlptim->global_state,
                   (HAL_LPTIM_STATE_INIT | HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE));

  return (hal_lptim_filter_t)(uint32_t)(LL_LPTIM_GetTriggerFilter(LPTIM_INSTANCE(hlptim)) >> LPTIM_CFGR_TRGFLT_Pos);
}

/**
  *  @}
  */

/** @addtogroup LPTIM_Exported_Functions_Group9 Low-power timer IRQ handler and callback functions
  *
  *  This section provides LPTIM IRQ Handler and callback function called within the IRQ Handler

  *     IRQ Handler:
       - Call HAL_LPTIM_IRQHandler() LPTIM interrupt global request handler
       - Call HAL_LPTIM_UPD_IRQHandler() LPTIM interrupt Update request handler
       - Call HAL_LPTIM_CC_IRQHandler() LPTIM interrupt Capture/Compare request handler
       - Call HAL_LPTIM_TRGI_DIR_IRQHandler() LPTIM interrupt Trigger Direction request handler

        Weak Callback:
       - Call HAL_LPTIM_ErrorCallback() Error Callback
       - Call HAL_LPTIM_StopCallback() Stop Callback
       - Call HAL_LPTIM_InputCaptureStopCallback() Channel Stop Callback
       - Call HAL_LPTIM_UpdateCallback() Update Callback
       - Call HAL_LPTIM_UpdateHalfCpltCallback() Update Half Cplt Callback
       - Call HAL_LPTIM_RepUpdateCallback() Rep Update Callback
       - Call HAL_LPTIM_TriggerCallback() Trigger Callback
       - Call HAL_LPTIM_InputCaptureCallback() Input Capture Callback
       - Call HAL_LPTIM_InputCaptureHalfCpltCallback() Input Capture Half Cplt Callback
       - Call HAL_LPTIM_InputOverCaptureCallback() Input Over Capture Callback
       - Call HAL_LPTIM_CompareMatchCallback() Compare Match Callback
       - Call HAL_LPTIM_CompareMatchHalfCpltCallback() Compare Match Half Cplt Callback
       - Call HAL_LPTIM_CompareUpdateCallback() Compare Update Callback
       - Call HAL_LPTIM_AutoReloadMatchCallback() AutoReload Match Callback
       - Call HAL_LPTIM_AutoReloadUpdateCallback() AutoReload Update Callback
       - Call HAL_LPTIM_DirectionUpCallback() Direction Up Callback
       - Call HAL_LPTIM_DirectionDownCallback() Direction Down Callback

       And there register callback:
       - Call HAL_LPTIM_RegisterErrorCallback() Error Callback
       - Call HAL_LPTIM_RegisterStopCallback() Stop Callback
       - Call HAL_LPTIM_RegisterChannelStopCallback() Stop Callback
       - Call HAL_LPTIM_RegisterUpdateCallback() Update Callback
       - Call HAL_LPTIM_RegisterUpdateHalfCpltCallback() Update Half Cplt Callback
       - Call HAL_LPTIM_RegisterRepUpdateCallback() Rep Update Callback
       - Call HAL_LPTIM_RegisterTriggerCallback() Trigger Callback
       - Call HAL_LPTIM_RegisterInputCaptureCallback() Input Capture Callback
       - Call HAL_LPTIM_RegisterInputCaptureHalfCpltCallback() Input Capture Half Cplt Callback
       - Call HAL_LPTIM_RegisterOverCaptureCallback() Input Over Capture Callback
       - Call HAL_LPTIM_RegisterCompareMatchCallback() Compare Match Callback
       - Call HAL_LPTIM_RegisterCompareUpdateCallback() Compare Update Callback
       - Call HAL_LPTIM_RegisterAutoReloadMatchCallback() AutoReload Match Callback
       - Call HAL_LPTIM_RegisterAutoReloadUpdateCallback() AutoReload Update Callback
       - Call HAL_LPTIM_RegisterDirectionUpCallback() Direction Up Callback
       - Call HAL_LPTIM_RegisterDirectionDownCallback() Direction Down Callback
  *  @{
  */

/**
  * @brief This function handles LPTIM generic interrupts requests.
  * @param hlptim  Pointer to the handle of the LPTIM instance.
  * @note  Handle all low-power timer interrupt requests.
  */
void HAL_LPTIM_IRQHandler(hal_lptim_handle_t *hlptim)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  const uint32_t flag_status = LL_LPTIM_READ_REG(p_lptim, ISR);
  const uint32_t it_sources = LL_LPTIM_READ_REG(p_lptim, DIER);
  const uint32_t flag_status_masked = flag_status & it_sources;

  /* Capture compare 1 interrupt caught */
  if ((flag_status_masked & LL_LPTIM_ISR_CC1IF) != 0U)
  {
    LL_LPTIM_ClearFlag_CC1(p_lptim);
    /* input capture catching an event in*/
    if (LL_LPTIM_CC_GetChannelMode(p_lptim, (uint32_t)HAL_LPTIM_CHANNEL_1) == LL_LPTIM_CCMODE_INPUTCAPTURE)
    {
#if defined(USE_HAL_LPTIM_REGISTER_CALLBACKS) && (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
      hlptim->input_capture_callback(hlptim, HAL_LPTIM_CHANNEL_1);
#else
      HAL_LPTIM_InputCaptureCallback(hlptim, HAL_LPTIM_CHANNEL_1);
#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */
    }
    else
    {
#if defined(USE_HAL_LPTIM_REGISTER_CALLBACKS) && (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
      hlptim->compare_match_callback(hlptim, HAL_LPTIM_CHANNEL_1);
#else
      HAL_LPTIM_CompareMatchCallback(hlptim, HAL_LPTIM_CHANNEL_1);
#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */
    }
  }
  /* Capture compare 2 interrupt caught */
  if ((flag_status_masked & LL_LPTIM_ISR_CC2IF) != 0U)
  {
    LL_LPTIM_ClearFlag_CC2(p_lptim);
    if (LL_LPTIM_CC_GetChannelMode(p_lptim, (uint32_t)HAL_LPTIM_CHANNEL_2) == LL_LPTIM_CCMODE_INPUTCAPTURE)
    {
#if defined(USE_HAL_LPTIM_REGISTER_CALLBACKS) && (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
      hlptim->input_capture_callback(hlptim, HAL_LPTIM_CHANNEL_2);
#else
      HAL_LPTIM_InputCaptureCallback(hlptim, HAL_LPTIM_CHANNEL_2);
#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */
    }
    else
    {
#if defined(USE_HAL_LPTIM_REGISTER_CALLBACKS) && (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
      hlptim->compare_match_callback(hlptim, HAL_LPTIM_CHANNEL_2);
#else
      HAL_LPTIM_CompareMatchCallback(hlptim, HAL_LPTIM_CHANNEL_2);
#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */
    }
  }
  /* Compare update interrupt Channel 1*/
  if ((flag_status_masked & LL_LPTIM_ISR_CMP1OK) != 0U)
  {
    LL_LPTIM_ClearFlag_CMP1OK(p_lptim);
#if defined(USE_HAL_LPTIM_REGISTER_CALLBACKS) && (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
    hlptim->compare_update_callback(hlptim, HAL_LPTIM_CHANNEL_1);
#else
    HAL_LPTIM_CompareUpdateCallback(hlptim, HAL_LPTIM_CHANNEL_1);
#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */
  }
  /* Compare update interrupt Channel 2*/
  if ((flag_status_masked & LL_LPTIM_ISR_CMP2OK) != 0U)
  {
    LL_LPTIM_ClearFlag_CMP2OK(p_lptim);
#if defined(USE_HAL_LPTIM_REGISTER_CALLBACKS) && (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
    hlptim->compare_update_callback(hlptim, HAL_LPTIM_CHANNEL_2);
#else
    HAL_LPTIM_CompareUpdateCallback(hlptim, HAL_LPTIM_CHANNEL_2);
#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */
  }
  /* Over capture 1 interrupt caught */
  if ((flag_status_masked & LL_LPTIM_ISR_CC1OF) != 0U)
  {
    LL_LPTIM_ClearFlag_CC1O(p_lptim);
#if defined(USE_HAL_LPTIM_REGISTER_CALLBACKS) && (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
    hlptim->input_over_capture_callback(hlptim, HAL_LPTIM_CHANNEL_1);
#else
    HAL_LPTIM_InputOverCaptureCallback(hlptim, HAL_LPTIM_CHANNEL_1);
#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */
  }
  /* Over capture 2 interrupt caught */
  if ((flag_status_masked & LL_LPTIM_ISR_CC2OF) != 0U)
  {
    LL_LPTIM_ClearFlag_CC2O(p_lptim);
#if defined(USE_HAL_LPTIM_REGISTER_CALLBACKS) && (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
    hlptim->input_over_capture_callback(hlptim, HAL_LPTIM_CHANNEL_2);
#else
    HAL_LPTIM_InputOverCaptureCallback(hlptim, HAL_LPTIM_CHANNEL_2);
#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */
  }
  /* Autoreload matched interrupt */
  if ((flag_status_masked & LL_LPTIM_ISR_ARRM) != 0U)
  {
    LL_LPTIM_ClearFlag_ARRM(p_lptim);
#if defined(USE_HAL_LPTIM_REGISTER_CALLBACKS) && (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
    hlptim->auto_reload_match_callback(hlptim);
#else
    HAL_LPTIM_AutoReloadMatchCallback(hlptim);
#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */
  }
  /* Autoreload update interrupt */
  if ((flag_status_masked & LL_LPTIM_ISR_ARROK) != 0U)
  {
    LL_LPTIM_ClearFlag_ARROK(p_lptim);
#if defined(USE_HAL_LPTIM_REGISTER_CALLBACKS) && (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
    hlptim->auto_reload_update_callback(hlptim);
#else
    HAL_LPTIM_AutoReloadUpdateCallback(hlptim);
#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */
  }
  /* Trigger detected interrupt */
  if ((flag_status_masked & LL_LPTIM_ISR_EXTTRIG) != 0U)
  {
    LL_LPTIM_ClearFlag_EXTTRIG(p_lptim);
#if defined(USE_HAL_LPTIM_REGISTER_CALLBACKS) && (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
    hlptim->trigger_callback(hlptim);
#else
    HAL_LPTIM_TriggerCallback(hlptim);
#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */
  }
  /* Direction counter changed from up to down */
  if ((flag_status_masked & LL_LPTIM_ISR_DOWN) != 0U)
  {
    LL_LPTIM_ClearFlag_DOWN(p_lptim);
#if defined(USE_HAL_LPTIM_REGISTER_CALLBACKS) && (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
    hlptim->direction_down_callback(hlptim);
#else
    HAL_LPTIM_DirectionDownCallback(hlptim);
#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */
  }
  /* Direction counter changed from down to up */
  if ((flag_status_masked & LL_LPTIM_ISR_UP) != 0U)
  {
    LL_LPTIM_ClearFlag_UP(p_lptim);
#if defined(USE_HAL_LPTIM_REGISTER_CALLBACKS) && (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
    hlptim->direction_up_callback(hlptim);
#else
    HAL_LPTIM_DirectionUpCallback(hlptim);
#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */
  }
  /* Repetition counter underflowed or == 0 and LPTIM counter overflow */
  if ((flag_status_masked & LL_LPTIM_ISR_UE) != 0U)
  {
    LL_LPTIM_ClearFlag_UE(p_lptim);
#if defined(USE_HAL_LPTIM_REGISTER_CALLBACKS) && (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
    hlptim->update_callback(hlptim);
#else
    HAL_LPTIM_UpdateCallback(hlptim);
#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */
  }
  /* Successful APB bus write to repetition counter register */
  if ((flag_status_masked & LL_LPTIM_ISR_REPOK) != 0U)
  {
    LL_LPTIM_ClearFlag_REPOK(p_lptim);
#if defined(USE_HAL_LPTIM_REGISTER_CALLBACKS) && (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
    hlptim->rep_update_callback(hlptim);
#else
    HAL_LPTIM_RepUpdateCallback(hlptim);
#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */
  }
}

/**
  * @brief  Low-power timer capture/compare handler.
  * @param  hlptim  Pointer to the handle of the LPTIM instance.
  */
void HAL_LPTIM_CC_IRQHandler(hal_lptim_handle_t *hlptim)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  const uint32_t flag_status = LL_LPTIM_READ_REG(p_lptim, ISR);
  const uint32_t it_sources = LL_LPTIM_READ_REG(p_lptim, DIER);
  const uint32_t flag_status_masked = flag_status & it_sources;

  /* Capture compare 1 interrupt caught */
  if ((flag_status_masked & LL_LPTIM_ISR_CC1IF) != 0U)
  {
    LL_LPTIM_ClearFlag_CC1(p_lptim);
    /* input capture catching an event in*/
    if (LL_LPTIM_CC_GetChannelMode(p_lptim, (uint32_t)HAL_LPTIM_CHANNEL_1) == LL_LPTIM_CCMODE_INPUTCAPTURE)
    {
#if defined(USE_HAL_LPTIM_REGISTER_CALLBACKS) && (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
      hlptim->input_capture_callback(hlptim, HAL_LPTIM_CHANNEL_1);
#else
      HAL_LPTIM_InputCaptureCallback(hlptim, HAL_LPTIM_CHANNEL_1);
#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */
    }
    else
    {
#if defined(USE_HAL_LPTIM_REGISTER_CALLBACKS) && (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
      hlptim->compare_match_callback(hlptim, HAL_LPTIM_CHANNEL_1);
#else
      HAL_LPTIM_CompareMatchCallback(hlptim, HAL_LPTIM_CHANNEL_1);
#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */
    }
  }
  /* Capture compare 2 interrupt caught */
  if ((flag_status_masked & LL_LPTIM_ISR_CC2IF) != 0U)
  {
    LL_LPTIM_ClearFlag_CC2(p_lptim);
    if (LL_LPTIM_CC_GetChannelMode(p_lptim, (uint32_t)HAL_LPTIM_CHANNEL_2) == LL_LPTIM_CCMODE_INPUTCAPTURE)
    {
#if defined(USE_HAL_LPTIM_REGISTER_CALLBACKS) && (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
      hlptim->input_capture_callback(hlptim, HAL_LPTIM_CHANNEL_2);
#else
      HAL_LPTIM_InputCaptureCallback(hlptim, HAL_LPTIM_CHANNEL_2);
#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */
    }
    else
    {
#if defined(USE_HAL_LPTIM_REGISTER_CALLBACKS) && (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
      hlptim->compare_match_callback(hlptim, HAL_LPTIM_CHANNEL_2);
#else
      HAL_LPTIM_CompareMatchCallback(hlptim, HAL_LPTIM_CHANNEL_2);
#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */
    }
  }
}

/**
  * @brief  Low-power timer update handler.
  * @param  hlptim  Pointer to the handle of the LPTIM instance.
  */
void HAL_LPTIM_UPD_IRQHandler(hal_lptim_handle_t *hlptim)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  const uint32_t flag_status = LL_LPTIM_READ_REG(p_lptim, ISR);
  const uint32_t it_sources = LL_LPTIM_READ_REG(p_lptim, DIER);
  const uint32_t flag_status_masked = flag_status & it_sources;

  /* Repetition counter underflowed or == 0 and LPTIM counter overflow */
  if ((flag_status_masked & LL_LPTIM_ISR_UE) != 0U)
  {
    LL_LPTIM_ClearFlag_UE(p_lptim);
#if defined(USE_HAL_LPTIM_REGISTER_CALLBACKS) && (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
    hlptim->update_callback(hlptim);
#else
    HAL_LPTIM_UpdateCallback(hlptim);
#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */
  }
}

/**
  * @brief  Low-power timer trigger input handler.
  * @param  hlptim  Pointer to the handle of the LPTIM instance.
  */
void HAL_LPTIM_TRGI_DIR_IRQHandler(hal_lptim_handle_t *hlptim)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  lptim_t *p_lptim = LPTIM_INSTANCE(hlptim);

  const uint32_t flag_status = LL_LPTIM_READ_REG(p_lptim, ISR);
  const uint32_t it_sources = LL_LPTIM_READ_REG(p_lptim, DIER);
  const uint32_t flag_status_masked = flag_status & it_sources;

