MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_lptim.c
  /* Direction counter changed from up to down */
  if ((flag_status_masked & LL_LPTIM_ISR_DOWN) != 0U)
  {
    LL_LPTIM_ClearFlag_DOWN(p_lptim);
#if defined(USE_HAL_LPTIM_REGISTER_CALLBACKS) && (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
    hlptim->direction_down_callback(hlptim);
#else
    HAL_LPTIM_DirectionDownCallback(hlptim);
#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */
  }
  /* Direction counter changed from down to up */
  if ((flag_status_masked & LL_LPTIM_ISR_UP) != 0U)
  {
    LL_LPTIM_ClearFlag_UP(p_lptim);
#if defined(USE_HAL_LPTIM_REGISTER_CALLBACKS) && (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
    hlptim->direction_up_callback(hlptim);
#else
    HAL_LPTIM_DirectionUpCallback(hlptim);
#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */
  }
  /* Trigger detected interrupt */
  if ((flag_status_masked & LL_LPTIM_ISR_EXTTRIG) != 0U)
  {
    LL_LPTIM_ClearFlag_EXTTRIG(p_lptim);
#if defined(USE_HAL_LPTIM_REGISTER_CALLBACKS) && (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
    hlptim->trigger_callback(hlptim);
#else
    HAL_LPTIM_TriggerCallback(hlptim);
#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */
  }
}

#if defined(USE_HAL_LPTIM_DMA) && (USE_HAL_LPTIM_DMA == 1)
/**
  * @brief    Update Half Complete callback.\n
  *           Function called when the DMA transfer triggered by the timer update
  *           DMA request is half completed.
  * @param    hlptim  Pointer to the handle of the LPTIM instance.
  * @warning  This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_LPTIM_UpdateHalfCpltCallback(hal_lptim_handle_t *hlptim)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hlptim);
}

/**
  * @brief    DMA Error callback. \n
  *           This function is called in case of a DMA transfer error.
  * @param    hlptim  Pointer to the handle of the LPTIM instance.
  * @warning  This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_LPTIM_ErrorCallback(hal_lptim_handle_t *hlptim)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hlptim);
}

/**
  * @brief    DMA Stop callback. \n
  *           This function is called after stopping a DMA transfer triggered
  *           by the timer update event.
  * @param    hlptim  Pointer to the handle of the LPTIM instance.
  * @warning  This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_LPTIM_StopCallback(hal_lptim_handle_t *hlptim)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hlptim);
}

/**
  * @brief    DMA Channel Stop callback. \n
  *           This function is called after stopping a DMA transfer triggered
  *           by a capture/compare event.
  * @param    hlptim  Pointer to the handle of the LPTIM instance.
  * @param    channel Input Channel of interest.
  * @warning  This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_LPTIM_InputCaptureStopCallback(hal_lptim_handle_t *hlptim,
                                               hal_lptim_channel_t channel)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hlptim);
  STM32_UNUSED(channel);
}
#endif /* USE_HAL_LPTIM_DMA */

/**
  * @brief    Update callback. \n
  *           Function called when the timer update interrupt is generated or when
  *           the DMA transfer triggered by the timer update DMA request is completed.
  * @param    hlptim  Pointer to the handle of the LPTIM instance.
  * @warning  This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_LPTIM_UpdateCallback(hal_lptim_handle_t *hlptim)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hlptim);
}

/**
  * @brief    Repetition Update Callback.
  * @param    hlptim  Pointer to the handle of the LPTIM instance.
  * @warning  This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_LPTIM_RepUpdateCallback(hal_lptim_handle_t *hlptim)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hlptim);
}

/**
  * @brief    Trigger callback. \n
  *           Function called when the timer trigger interrupt is generated or when
  *           the DMA transfer triggered by the timer trigger DMA request is completed.
  * @param    hlptim  Pointer to the handle of the LPTIM instance.
  * @warning  This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_LPTIM_TriggerCallback(hal_lptim_handle_t *hlptim)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hlptim);
}

/**
  * @brief    Input Capture Callback.
  * @param    hlptim  Pointer to the handle of the LPTIM instance.
  * @param    channel    input channel of interest to enable.
  * @warning  This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_LPTIM_InputCaptureCallback(hal_lptim_handle_t *hlptim,
                                           hal_lptim_channel_t channel)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hlptim);
  STM32_UNUSED(channel);
}

#if defined(USE_HAL_LPTIM_DMA) && (USE_HAL_LPTIM_DMA == 1)
/**
  * @brief    Callback for the DMA Half Complete transfer triggered by an Input Capture event.
  * @param    hlptim  Pointer to the handle of the LPTIM instance.
  * @param    channel    input channel of interest to enable.
  * @warning  This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_LPTIM_InputCaptureHalfCpltCallback(hal_lptim_handle_t *hlptim,
                                                   hal_lptim_channel_t channel)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hlptim);
  STM32_UNUSED(channel);
}
#endif /* USE_HAL_LPTIM_DMA */

/**
  * @brief    Input Over Capture callback. \n
  *           Function called when an input over capture interrupt is generated.
  * @param    hlptim  Pointer to the handle of the LPTIM instance.
  * @param    channel    input channel of interest to enable.
  * @warning  This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_LPTIM_InputOverCaptureCallback(hal_lptim_handle_t *hlptim,
                                               hal_lptim_channel_t channel)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hlptim);
  STM32_UNUSED(channel);
}

/**
  * @brief    Compare match Callback.
  * @param    hlptim  Pointer to the handle of the LPTIM instance.
  * @param    channel    Output channel of interest to enable.
  * @warning  This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_LPTIM_CompareMatchCallback(hal_lptim_handle_t *hlptim,
                                           hal_lptim_channel_t channel)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hlptim);
  STM32_UNUSED(channel);
}

/**
  * @brief    Compare update Callback.
  * @param    hlptim  Pointer to the handle of the LPTIM instance.
  * @param    channel    Output channel of interest to enable.
  * @warning  This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_LPTIM_CompareUpdateCallback(hal_lptim_handle_t *hlptim,
                                            hal_lptim_channel_t channel)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hlptim);
  STM32_UNUSED(channel);
}

/**
  * @brief    AutoReload Match callback.
  * @param    hlptim  Pointer to the handle of the LPTIM instance.
  * @warning  This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_LPTIM_AutoReloadMatchCallback(hal_lptim_handle_t *hlptim)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hlptim);
}

/**
  * @brief    Autoreload Update callback.
  * @param    hlptim  Pointer to the handle of the LPTIM instance.
  * @warning  This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_LPTIM_AutoReloadUpdateCallback(hal_lptim_handle_t *hlptim)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hlptim);
}

/**
  * @brief    Direction UP callback.
  * @param    hlptim  Pointer to the handle of the LPTIM instance.
  * @warning  This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_LPTIM_DirectionUpCallback(hal_lptim_handle_t *hlptim)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hlptim);
}

/**
  * @brief    Direction Down callback.
  * @param    hlptim  Pointer to the handle of the LPTIM instance.
  * @warning  This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_LPTIM_DirectionDownCallback(hal_lptim_handle_t *hlptim)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hlptim);
}

/* Interfaces for registering callbacks ***************************************/
#if defined(USE_HAL_LPTIM_REGISTER_CALLBACKS) && (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)

#if defined(USE_HAL_LPTIM_DMA) && (USE_HAL_LPTIM_DMA == 1)

/**
  * @brief  Callback registration for the DMA Error.
  * @param  hlptim  Pointer to the handle of the LPTIM instance.
  * @param  fct   Function to register as callback.
  * @retval HAL_OK Register correctly setup
  * @retval HAL_INVALID_PARAM fct is NULL (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_LPTIM_RegisterErrorCallback(hal_lptim_handle_t *hlptim,
                                             hal_lptim_cb_t fct)
{
  ASSERT_DBG_PARAM((hlptim != NULL));
  ASSERT_DBG_PARAM((fct != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (fct == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

