MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_lptim.c
  hlptim->error_callback = fct;

  return HAL_OK;
}

/**
  * @brief  Callback registration for the Stop callback.
  * @param  hlptim  Pointer to the handle of the LPTIM instance.
  * @param  fct   Function to register as callback.
  * @retval HAL_OK Register correctly setup
  * @retval HAL_INVALID_PARAM fct is NULL (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_LPTIM_RegisterStopCallback(hal_lptim_handle_t *hlptim,
                                            hal_lptim_cb_t fct)
{
  ASSERT_DBG_PARAM((hlptim != NULL));
  ASSERT_DBG_PARAM((fct != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (fct == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hlptim->stop_callback = fct;

  return HAL_OK;
}

/**
  * @brief  Callback registration for the Channel Stop callback.
  * @param  hlptim  Pointer to the handle of the LPTIM instance.
  * @param  fct   Function to register as callback.
  * @retval HAL_OK Register correctly setup
  * @retval HAL_INVALID_PARAM fct is NULL (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_LPTIM_RegisterChannelStopCallback(hal_lptim_handle_t *hlptim,
                                                   hal_lptim_channel_cb_t fct)
{
  ASSERT_DBG_PARAM((hlptim != NULL));
  ASSERT_DBG_PARAM((fct != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (fct == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hlptim->input_capture_stop_callback = fct;

  return HAL_OK;
}

#endif /* USE_HAL_LPTIM_DMA */

/**
  * @brief  Callback registration for the Update Event.
  * @param  hlptim  Pointer to the handle of the LPTIM instance.
  * @param  fct   Function to register as callback.
  * @retval HAL_OK Register correctly setup
  * @retval HAL_INVALID_PARAM fct is NULL (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_LPTIM_RegisterUpdateCallback(hal_lptim_handle_t *hlptim,
                                              hal_lptim_cb_t fct)
{
  ASSERT_DBG_PARAM((hlptim != NULL));
  ASSERT_DBG_PARAM((fct != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (fct == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hlptim->update_callback = fct;

  return HAL_OK;
}

#if defined(USE_HAL_LPTIM_DMA) && (USE_HAL_LPTIM_DMA == 1)

/**
  * @brief  Callback registration for the DMA Half Complete transfer
  *            triggered on Update event.
  * @param  hlptim  Pointer to the handle of the LPTIM instance.
  * @param  fct   Function to register as callback.
  * @retval HAL_OK Register correctly setup
  * @retval HAL_INVALID_PARAM fct is NULL (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_LPTIM_RegisterUpdateHalfCpltCallback(hal_lptim_handle_t *hlptim,
                                                      hal_lptim_cb_t fct)
{
  ASSERT_DBG_PARAM((hlptim != NULL));
  ASSERT_DBG_PARAM((fct != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (fct == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hlptim->update_half_cplt_callback = fct;

  return HAL_OK;
}
#endif /* USE_HAL_LPTIM_DMA */

/**
  * @brief  Callback registration for Repetition Update.
  * @param  hlptim  Pointer to the handle of the LPTIM instance.
  * @param  fct   Function to register as callback.
  * @retval HAL_OK Register correctly setup
  * @retval HAL_INVALID_PARAM fct is NULL (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_LPTIM_RegisterRepUpdateCallback(hal_lptim_handle_t *hlptim,
                                                 hal_lptim_cb_t fct)
{
  ASSERT_DBG_PARAM((hlptim != NULL));
  ASSERT_DBG_PARAM((fct != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (fct == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hlptim->rep_update_callback = fct;

  return HAL_OK;
}
/**
  * @brief  Callback registration for the Trigger event.
  * @param  hlptim  Pointer to the handle of the LPTIM instance.
  * @param  fct   Function to register as callback.
  * @retval HAL_OK Register correctly setup
  * @retval HAL_INVALID_PARAM fct is NULL (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_LPTIM_RegisterTriggerCallback(hal_lptim_handle_t *hlptim,
                                               hal_lptim_cb_t fct)
{
  ASSERT_DBG_PARAM((hlptim != NULL));
  ASSERT_DBG_PARAM((fct != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (fct == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hlptim->trigger_callback = fct;

  return HAL_OK;
}

/**
  * @brief  Callback registration for the Input Capture event.
  * @param  hlptim  Pointer to the handle of the LPTIM instance.
  * @param  fct   Function to register as callback.
  * @retval HAL_OK Register correctly setup
  * @retval HAL_INVALID_PARAM fct is NULL (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_LPTIM_RegisterInputCaptureCallback(hal_lptim_handle_t *hlptim,
                                                    hal_lptim_channel_cb_t fct)
{
  ASSERT_DBG_PARAM((hlptim != NULL));
  ASSERT_DBG_PARAM((fct != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (fct == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hlptim->input_capture_callback = fct;

  return HAL_OK;
}

#if defined(USE_HAL_LPTIM_DMA) && (USE_HAL_LPTIM_DMA == 1)
/**
  * @brief  Callback registration for the Input Capture Half Complete.
  * @param  hlptim  Pointer to the handle of the LPTIM instance.
  * @param  fct   Function to register as callback.
  * @retval HAL_OK Register correctly setup
  * @retval HAL_INVALID_PARAM fct is NULL (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_LPTIM_RegisterInputCaptureHalfCpltCallback(hal_lptim_handle_t *hlptim,
                                                            hal_lptim_channel_cb_t fct)
{
  ASSERT_DBG_PARAM((hlptim != NULL));
  ASSERT_DBG_PARAM((fct != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (fct == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hlptim->input_capture_half_cplt_callback = fct;

  return HAL_OK;
}
#endif /* USE_HAL_LPTIM_DMA */

/**
  * @brief  Callback registration for Over Capture.
  * @param  hlptim  Pointer to the handle of the LPTIM instance.
  * @param  fct   Function to register as callback.
  * @retval HAL_OK Register correctly setup
  * @retval HAL_INVALID_PARAM fct is NULL (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_LPTIM_RegisterOverCaptureCallback(hal_lptim_handle_t *hlptim,
                                                   hal_lptim_channel_cb_t fct)
{
  ASSERT_DBG_PARAM((hlptim != NULL));
  ASSERT_DBG_PARAM((fct != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (fct == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hlptim->input_over_capture_callback = fct;

  return HAL_OK;
}

/**
  * @brief  Callback registration for the Compare Match.
  * @param  hlptim  Pointer to the handle of the LPTIM instance.
  * @param  fct   Function to register as callback.
  * @retval HAL_OK Register correctly setup
  * @retval HAL_INVALID_PARAM fct is NULL (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_LPTIM_RegisterCompareMatchCallback(hal_lptim_handle_t *hlptim,
                                                    hal_lptim_channel_cb_t fct)
{
  ASSERT_DBG_PARAM((hlptim != NULL));
  ASSERT_DBG_PARAM((fct != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (fct == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hlptim->compare_match_callback = fct;

  return HAL_OK;
}

/**
  * @brief  Callback registration for the Compare Update.
  * @param  hlptim  Pointer to the handle of the LPTIM instance.
  * @param  fct   Function to register as callback.
  * @retval HAL_OK Register correctly setup
  * @retval HAL_INVALID_PARAM fct is NULL (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_LPTIM_RegisterCompareUpdateCallback(hal_lptim_handle_t *hlptim,
                                                     hal_lptim_channel_cb_t fct)
{
  ASSERT_DBG_PARAM((hlptim != NULL));
  ASSERT_DBG_PARAM((fct != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (fct == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hlptim->compare_update_callback = fct;

  return HAL_OK;
}

/**
  * @brief  Callback registration for the Autoreload Update.
  * @param  hlptim  Pointer to the handle of the LPTIM instance.
  * @param  fct   Function to register as callback.
  * @retval HAL_OK Register correctly setup
  * @retval HAL_INVALID_PARAM fct is NULL (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_LPTIM_RegisterAutoReloadUpdateCallback(hal_lptim_handle_t *hlptim,
                                                        hal_lptim_cb_t fct)
{
  ASSERT_DBG_PARAM((hlptim != NULL));
  ASSERT_DBG_PARAM((fct != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (fct == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hlptim->auto_reload_update_callback = fct;

  return HAL_OK;
}

/**
  * @brief  Callback registration for the Autoreload Match.
  * @param  hlptim  Pointer to the handle of the LPTIM instance.
  * @param  fct   Function to register as callback.
  * @retval HAL_OK Register correctly setup
  * @retval HAL_INVALID_PARAM fct is NULL (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_LPTIM_RegisterAutoReloadMatchCallback(hal_lptim_handle_t *hlptim,
                                                       hal_lptim_cb_t fct)
{
  ASSERT_DBG_PARAM((hlptim != NULL));
  ASSERT_DBG_PARAM((fct != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (fct == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hlptim->auto_reload_match_callback = fct;

  return HAL_OK;
}
/**
  * @brief  Callback registration for the Direction UP changes.
  * @param  hlptim  Pointer to the handle of the LPTIM instance.
  * @param  fct   Function to register as callback.
  * @retval HAL_OK Register correctly setup
  * @retval HAL_INVALID_PARAM fct is NULL (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_LPTIM_RegisterDirectionUpCallback(hal_lptim_handle_t *hlptim,
                                                   hal_lptim_cb_t fct)
{
  ASSERT_DBG_PARAM((hlptim != NULL));
  ASSERT_DBG_PARAM((fct != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (fct == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hlptim->direction_up_callback = fct;

  return HAL_OK;
}
/**
  * @brief  Callback registration for the Direction Down changes.
  * @param  hlptim  Pointer to the handle of the LPTIM instance.
  * @param  fct   Function to register as callback.
  * @retval HAL_OK Register correctly setup
  * @retval HAL_INVALID_PARAM fct is NULL (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_LPTIM_RegisterDirectionDownCallback(hal_lptim_handle_t *hlptim,
                                                     hal_lptim_cb_t fct)
{
  ASSERT_DBG_PARAM((hlptim != NULL));
  ASSERT_DBG_PARAM((fct != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (fct == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hlptim->direction_down_callback = fct;

  return HAL_OK;
}

#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */

/**
  *  @}
  */

#if defined(USE_HAL_LPTIM_USER_DATA) && (USE_HAL_LPTIM_USER_DATA == 1)
/** @addtogroup LPTIM_Exported_Functions_Group10
  *  The user data pointer, *p_user_data, in the HAL LPTIM handle allows user to associate applicative user
  *  data to the HAL LPTIM handle.
  *  The two functions in this group give an application the
  *  possibility to store and retrieve user data pointer into and
  *  from the handle.
  *  - Call HAL_LPTIM_SetUserData() Set user data
  *  - Call HAL_LPTIM_GetUserData() Get user data
  *  @{
  */

/**
  * @brief  Store User Data pointer into the handle.
  * @param  hlptim  Pointer to the handle of the LPTIM instance.
  * @param  p_user_data Pointer to the user data.
  */
void HAL_LPTIM_SetUserData(hal_lptim_handle_t *hlptim, const void *p_user_data)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  hlptim->p_user_data = p_user_data;
}

/**
  * @brief Retrieve User Data pointer from the handle.
  * @param hlptim  Pointer to the handle of the LPTIM instance.
  * @retval Pointer to the user data.
  */
const void *HAL_LPTIM_GetUserData(const hal_lptim_handle_t *hlptim)
{
  ASSERT_DBG_PARAM((hlptim != NULL));

  return hlptim->p_user_data;
}
/**
  *  @}
  */
#endif /* USE_HAL_LPTIM_USER_DATA */

/** @addtogroup LPTIM_Exported_Functions_Group11
  *  Get clock frequency depends on instance used.
  *  - Call HAL_LPTIM_GetClockFreq() Get the LPTIM instance kernel clock frequency
  *  @{
  */

/**
  * @brief  Return the peripheral clock frequency for LPTIMx.
  * @param  hlptim Pointer to the handle of the LPTIM instance.
  * @retval uint32_t Frequency in Hz
  * @retval 0 source clock of the lptimx not configured or not ready
  */
uint32_t HAL_LPTIM_GetClockFreq(const hal_lptim_handle_t *hlptim)
{
  STM32_UNUSED(hlptim);

  /* Check the LPTIM handle */
  ASSERT_DBG_PARAM((hlptim != NULL));

  /* Check the global state, the driver need to be at least configured */
  ASSERT_DBG_STATE(hlptim->global_state, HAL_LPTIM_STATE_INIT | HAL_LPTIM_STATE_IDLE | HAL_LPTIM_STATE_ACTIVE);
  return HAL_RCC_LPTIM1_GetKernelClkFreq();
}

/**
  *  @}
  */

/**
  *  @}
  */

/**
  *  @}
  */

#endif /* USE_HAL_LPTIM_MODULE */
#endif /* LPTIM1 */
/**
  *  @}
  */
